-- @Author: baidwwy
-- @Date:   2023-06-02 01:01:38
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-06-22 21:51:06

function 任务处理类:领取文韵墨香答题任务(id)
----答题
  self:文韵墨香答题(id)
  文韵墨香[id].答题.次数=文韵墨香[id].答题.次数+1
  文韵墨香[id].答题.天王令=1
  文韵墨香[id].答题.地王令=2
  文韵墨香[id].答题.鬼王令=3
  文韵墨香[id].答题.答对=0
  文韵墨香[id].答题.答错=0
  文韵墨香[id].答题.总数=0
  文韵墨香[id].答题.连对=0
  文韵墨香[id].答题.起始=os.time()
  玩家数据[id].角色:刷新任务跟踪()
  -- self:设置文韵墨香题目(连接id,id)
end


function 任务处理类:文韵墨香答题(id) --1
	if 玩家数据[id].角色:取任务(19941)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  local 任务id=id.."_19941_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19941
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你参加了文韵墨香答题！")
end

function 任务处理类:设置文韵墨香题目(连接id,id)
  local 序列=取随机数(1,#科举题库)
  local 正确答案=科举题库[序列][4]
  local 随机答案={}
  for n=2,4 do
    随机答案[n-1]={答案=科举题库[序列][n],序列=取随机数(1,9999)}
  end
  table.sort(随机答案,function(a,b) return a.序列>b.序列 end )
  local 显示答案={}
  for n=1,3 do
    显示答案[n]=随机答案[n].答案
  end
  显示答案[#显示答案+1]="使用法宝"
  玩家数据[id].文韵科举数据={题目=科举题库[序列][1],答案=显示答案,正确答案=正确答案}
  玩家数据[id].文韵科举对话=true
  文韵墨香[id].答题.计时=os.time()
  文韵墨香[id].答题.总数=文韵墨香[id].答题.总数+1
  发送数据(连接id,1501,{名称="礼部侍郎官",模型="考官2",对话=format("#Y/第%s题：#W/%s",文韵墨香[id].答题.总数, 玩家数据[id].文韵科举数据.题目),选项= 玩家数据[id].文韵科举数据.答案})
end


function 任务处理类:文韵科举回答题目(连接id,id,答案,类型) --1天王令 2 帝王令 3使用鬼王令 4鬼王令成功 5 鬼王令失败 6超时
  if 答案=="使用法宝" then --发送法宝界面
    玩家数据[id].文韵科举数据.题目="请选择你要使用的法宝："
    玩家数据[id].文韵科举数据.答案={}
    玩家数据[id].文韵科举数据.答案[1]="天王令(得到正确作答，还可用"..文韵墨香[id].答题.天王令.."次)"
    玩家数据[id].文韵科举数据.答案[2]="地王令(系统作答，正确率50%,还可用"..文韵墨香[id].答题.地王令.."次)"
    --玩家数据[id].文韵科举数据.答案[3]="鬼王令(战斗闯关，还可用"..文韵墨香[id].答题.鬼王令.."次)"
    发送数据(连接id,1501,{名称="礼部侍郎官",模型="考官2",对话=玩家数据[id].文韵科举数据.题目,选项= 玩家数据[id].文韵科举数据.答案})
    玩家数据[id].文韵科举数据.法宝使用=true
    return
  end
  if 玩家数据[id].文韵科举数据.法宝使用 then
    local 法宝序列=0
    for n=1,3 do
      if 答案==玩家数据[id].文韵科举数据.答案[n] then
        法宝序列=n
      end
    end
    if 法宝序列==0 then
      常规提示(id,"#Y/你没有这样的法宝")
      类型=9
    elseif 法宝序列==1 and 文韵墨香[id].答题.天王令<=0 then
      常规提示(id,"#Y/你的这种法宝可用次数已经耗尽")
      类型=9
    elseif 法宝序列==2 and 文韵墨香[id].答题.地王令<=0 then
      常规提示(id,"#Y/你的这种法宝可用次数已经耗尽")
      类型=9
    elseif 法宝序列==3 and 文韵墨香[id].答题.鬼王令<=0 then
      常规提示(id,"#Y/你的这种法宝可用次数已经耗尽")
      类型=9
    else
      类型=法宝序列
      if 类型==3 then
        文韵墨香[id].答题.鬼王令=文韵墨香[id].答题.鬼王令-1
        常规提示(id,"#Y/你使用了鬼王令")
        玩家数据[id].文韵科举数据.法宝使用=nil
        战斗准备类:创建战斗(id,100006,0)
        return
      end
    end
  end
  玩家数据[id].文韵科举数据.法宝使用=nil
  local 正确=false
  玩家数据[id].科举对话=nil
  if 玩家数据[id].角色:取任务(19941)==0 and 类型==nil then
    常规提示(id,"#Y/你没有这样的任务")
    return
  end
  if 类型==nil then --正常作答
    if os.time()-文韵墨香[id].答题.计时<=15 then
      if 答案==玩家数据[id].文韵科举数据.正确答案 then
        正确=true
      end
    else
      常规提示(id,"#Y/答题超时！")
    end
  elseif 类型==1 then
    正确=true
    文韵墨香[id].答题.天王令=文韵墨香[id].答题.天王令-1
    常规提示(id,"#Y/你使用了天王令")
  elseif 类型==2 then
    if 取随机数()<=50 then 正确=true  end
    文韵墨香[id].答题.地王令=文韵墨香[id].答题.地王令-1
    常规提示(id,"#Y/你使用了地王令")
  elseif 类型==4 then
    正确=true
  end
  if 正确 then
    文韵墨香[id].答题.答对=文韵墨香[id].答题.答对+1
    文韵墨香[id].答题.连对= 文韵墨香[id].答题.连对+1
    if 文韵墨香[id].答题.连对>=3 then
      文韵墨香[id].答题.连对=0
      文韵墨香[id].答题.鬼王令=文韵墨香[id].答题.鬼王令+1
      常规提示(id,"#Y/连续答对三道题#R/鬼王令+1")
    end
    local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵答题",1)
    玩家数据[id].角色:添加银子(银子,"文韵答题",1)
    local 奖励参数=取随机数(1,100)
    if 类型~=nil then
      奖励参数=0
    end
    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵答题)#R/%s#Y在文韵答题中如有神助，妙笔生花，获得了考官奖励的#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵答题)#R/%s#Y在文韵答题中如有神助，妙笔生花，获得了考官奖励的#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵答题)#R/%s#Y在文韵答题中如有神助，妙笔生花，获得了考官奖励的#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    end
  else
    文韵墨香[id].答题.答错=文韵墨香[id].答题.答错+1
    文韵墨香[id].答题.连对=0
    常规提示(id,"#Y/你的回答不正确")
  end
  if 文韵墨香[id].答题.总数>=15 then
    文韵墨香[id].答题.耗时=os.time()- 文韵墨香[id].答题.起始
    if 文韵墨香[id].答题.答对>=15 then
      local 等级=取等级(id)
      local 经验=等级*8000*文韵墨香[id].答题.答对
      local 储备=等级*10*文韵墨香[id].答题.答对
      玩家数据[id].角色:添加经验(经验,"文韵答题最终奖励",1)
      玩家数据[id].角色:添加银子(储备,"文韵答题最终奖励",1)
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵答题)#R/%s#Y在文韵答题的表现突出，仅用#W/%s#Y秒的时间就正确作答#W/%s#Y/道题目，因此获得了考官特别奖励的#G/%s",玩家数据[id].角色.数据.名称,文韵墨香[id].答题.耗时,文韵墨香[id].答题.答对,"高级藏宝图"),频道="xt"})
  end
    self:文韵墨香总完成(id,true)
    玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19941))
    常规提示(id,"#Y/恭喜你成功完成了本轮文韵答题")
    玩家数据[id].文韵科举对话=false
    玩家数据[id].文韵科举数据=nil
    活跃数据[id].活跃度=活跃数据[id].活跃度+2
    玩家数据[id].角色.数据.累积活跃.当前积分=玩家数据[id].角色.数据.累积活跃.当前积分+2

  elseif 文韵墨香[id].答题.答错>=10 then
    文韵墨香[id].答题.今日答题 = true
    玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19941))
    常规提示(id,"#Y/你当前累积错误题目数量已达10道，已经无法参加后续的活动了")
    玩家数据[id].文韵科举对话=false
    玩家数据[id].文韵科举数据=nil
    活跃数据[id].活跃度=活跃数据[id].活跃度+2
    玩家数据[id].角色.数据.累积活跃.当前积分=玩家数据[id].角色.数据.累积活跃.当前积分+2
  else
    self:设置文韵墨香题目(连接id,id)
  end
  玩家数据[id].角色:刷新任务跟踪()
end





function 任务处理类:领取文韵墨香烧符(id)
  if 玩家数据[id].角色:取任务(19942)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].烧香=true
  local 任务id=id.."_19942_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19942
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  玩家数据[id].道具:给予道具(id,"商品符",1,nil,nil,"专用")
  添加最后对话(id,"你获得了烧香符,请到大雁塔使用")
end


function 任务处理类:完成文韵墨香烧符(id)
   文韵墨香[id].烧香=false
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19942))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵烧符",1)
    玩家数据[id].角色:添加银子(银子,"文韵烧符",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵烧符)#R/%s#Y在文韵烧符中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵烧符)#R/%s#Y在文韵烧符中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵烧符)#R/%s#Y在文韵烧符中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵烧符)#R/%s#Y在文韵烧符中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end

end

function 任务处理类:领取文韵墨香李世民(id)--3
  if 玩家数据[id].角色:取任务(19943)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].李世民=true
  local 任务id=id.."_19943_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19943
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你领取了寻找李世民任务！")
end

function 任务处理类:完成文韵墨香李世民(id)--3
  文韵墨香[id].李世民=false
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19943))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵寻找李世民",1)
    玩家数据[id].角色:添加银子(银子,"文韵寻找李世民",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找李世民)#R/%s#Y在文韵寻找李世民中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找李世民)#R/%s#Y在文韵寻找李世民中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找李世民)#R/%s#Y在文韵寻找李世民中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找李世民)#R/%s#Y在文韵寻找李世民中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end

end

function 任务处理类:领取文韵墨香砍木头(id)--4
  if 玩家数据[id].角色:取任务(19944)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].砍木头=true
  local 任务id=id.."_19944_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19944
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你领取了帮陈员外砍木头任务！")
end


function 任务处理类:完成文韵墨香砍木头(id)--3
  文韵墨香[id].砍木头=false
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19944))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"帮陈员外砍木头",1)
    玩家数据[id].角色:添加银子(银子,"帮陈员外砍木头",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵砍木头)#R/%s#Y在文韵砍木头中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵砍木头)#R/%s#Y在文韵砍木头中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵砍木头)#R/%s#Y在文韵砍木头中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵砍木头)#R/%s#Y在文韵砍木头中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end

end

function 任务处理类:领取文韵墨香巡逻(id)--5
  if 玩家数据[id].角色:取任务(19945)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].巡逻=true
  local 任务id=id.."_19945_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19945
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你领取了国子监巡逻任务！")

end


function 任务处理类:完成文韵墨香巡逻(id)--3
  文韵墨香[id].巡逻=false
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19945))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵国子监巡逻",1)
    玩家数据[id].角色:添加银子(银子,"文韵国子监巡逻",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵国子监巡逻)#R/%s#Y在文韵国子监巡逻中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵国子监巡逻)#R/%s#Y在文韵国子监巡逻中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵国子监巡逻)#R/%s#Y在文韵国子监巡逻中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵国子监巡逻)#R/%s#Y在文韵国子监巡逻中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end

end


function 任务处理类:文韵墨香护送(id)--6
  if 玩家数据[id].角色:取任务(19946)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].护送.开关=true
  local 任务id=id.."_19946_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19946
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你领取了文韵西域使者护送任务！")
end

function 任务处理类:完成文韵墨香护送(id,类型)--西域使者
 if not 文韵墨香[id].护送.长安 or not 文韵墨香[id].护送.国境 or not 文韵墨香[id].护送.长寿 then
    if 类型=="长安" then
       文韵墨香[id].护送.长安=true
    end
    if 类型=="国境" then
       文韵墨香[id].护送.国境=true
    end
    if 类型=="长寿" then
       文韵墨香[id].护送.长寿=true
    end
    常规提示(id,"#Y/你完成了文韵("..类型..")寻找西域使者任务！")
    玩家数据[id].角色:刷新任务跟踪()
 end
  if  文韵墨香[id].护送.长安 and  文韵墨香[id].护送.国境 and  文韵墨香[id].护送.长寿 then
  文韵墨香[id].护送={开关=false,长安=false,国境=false,长寿=false}
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19946))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵寻找西域使者",1)
    玩家数据[id].角色:添加银子(银子,"文韵寻找西域使者",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找西域使者)#R/%s#Y在文韵寻找西域使者中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找西域使者)#R/%s#Y在文韵寻找西域使者中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找西域使者)#R/%s#Y在文韵寻找西域使者中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵寻找西域使者)#R/%s#Y在文韵寻找西域使者中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end
  end
end


function 任务处理类:文韵墨香送信(id)--7
    if 玩家数据[id].角色:取任务(19947)~=0 then
  添加最后对话(id,"你已经领取过该任务抓紧去完成吧！")
  return
  end
  文韵墨香[id].送信.开关=true
  local 任务id=id.."_19947_"..os.time()
  local 结束时间=3600
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=19947
  }

 local 序列=取随机数(1,#Q_师门送信)
   任务数据[任务id].人物=Q_师门送信[序列].名称
   任务数据[任务id].人物地图=Q_师门送信[序列].地图
   文韵墨香[id].送信.送信人=任务数据[任务id].人物
   添加最后对话(id,format("请帮我把这封送给#Y%s#W的%s，事出紧急，切勿在路上耽搁。",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物))

  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
  玩家数据[id].角色:刷新任务跟踪()
  常规提示(id,"#Y/你领取了文韵师门送信任务！")
end

function 任务处理类:完成文韵墨香送信(id)--7
  文韵墨香[id].送信={开关=false,送信人=false}
   self:文韵墨香总完成(id)
   玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19947))
   local 等级=取等级(id)
    local 经验=等级*10000
    local 银子=等级*15*2
    玩家数据[id].角色:添加经验(经验,"文韵墨香送信",1)
    玩家数据[id].角色:添加银子(银子,"文韵墨香送信",1)
    local 奖励参数=取随机数(1,100)

    if 奖励参数<=20 then
      玩家数据[id].道具:给予道具(id,"藏宝图",0)
      常规提示(id,"#Y/你获得了一张藏宝图")
    elseif 奖励参数<=30 then
      local 名称=取强化石()
      玩家数据[id].道具:给予道具(id,名称,取随机数(5,10))
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵墨香送信)#R/%s#Y在文韵墨香送信中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=35 then
      local 名称="魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵墨香送信)#R/%s#Y在文韵墨香送信中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=50 then
      local 名称="高级藏宝图"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵墨香送信)#R/%s#Y在文韵墨香送信中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    elseif 奖励参数<=60 then
      local 名称="金银锦盒"
      玩家数据[id].道具:给予道具(id,名称,取随机数(1,5))
      常规提示(id,"#Y/你获得了"..名称)
    elseif 奖励参数<=70 then
      local 名称="高级魔兽要诀"
      玩家数据[id].道具:给予道具(id,名称,1)
      常规提示(id,"#Y/你获得了"..名称)
      广播消息({内容=format("#S(文韵墨香送信)#R/%s#Y在文韵墨香送信中如有神助，妙笔生花，获得了奖励#G/%s",玩家数据[id].角色.数据.名称,名称),频道="xt"})
    end

end

function 任务处理类:文韵墨香隐藏任务猜拳(id)--7
end

function 任务处理类:文韵墨香隐藏任务战斗(id)--7
end



function 任务处理类:文韵墨香取消任务(id)
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19941))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19942))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19943))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19944))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19945))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19946))
  玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(19947))
  文韵墨香[id]=nil
  添加最后对话(id,"你的任务已经恢复出厂设置了！")

end
function 任务处理类:文韵墨香总完成(id,循环)
if 循环 then
  if 玩家数据[id].队伍==0 then
    id组={id}
  else
   id组 = 取id组(id)
  end

  for n=1,#id组 do

     文韵墨香[id组[n]].完成次数=文韵墨香[id组[n]].完成次数+1
  if 文韵墨香[id组[n]].完成次数>=7 then
     文韵墨香[id组[n]].完成次数=0
     文韵墨香[id组[n]].轮数=文韵墨香[id组[n]].轮数+1
     商店处理类:设置神秘宝箱(id组[n])
     发送数据(玩家数据[id组[n]].连接id,85,{道具=神秘宝箱[id组[n]]})

  end
  添加最后对话(id组[n],"当前已完成次数:"..文韵墨香[id组[n]].完成次数.."完成轮数:"..文韵墨香[id组[n]].轮数.."----请到文墨使者继续领取新任务！")
  end
else
     文韵墨香[id].完成次数=文韵墨香[id].完成次数+1
  if 文韵墨香[id].完成次数>=7 then
     文韵墨香[id].完成次数=0
     文韵墨香[id].轮数=文韵墨香[id].轮数+1
     商店处理类:设置神秘宝箱(id)
     发送数据(玩家数据[id].连接id,85,{道具=神秘宝箱[id]})

  end
  添加最后对话(id,"当前已完成次数:"..文韵墨香[id].完成次数.."完成轮数:"..文韵墨香[id].轮数.."----请到文墨使者继续领取新任务！")
end


end