-- @Author: baidwwy
-- @Date:   2023-03-10 11:49:53
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-06-22 21:32:21
    --local 武器造型={武器="九霄风雷",级别=160}
    --附加状态={[1]={等级=175,名称="天神护体"}},
            --套装加法  追加法术={[1]={等级=175,名称="XXX"}}
            --奇经八脉={风刃=1},   --加法  奇经八脉={XXX=1}
            --角色=true,
            --锦衣={[1]={名称="黑浪淘纱"}},
            -- 染色方案=3,
            --染色组={[1]=3,[2]=6,[3]=6,序号=3710},
            -- 武器=取武器数据(武器造型.武器,武器造型.级别),
            -- 武器染色组={[1]=1,[2]=0},
            -- 武器染色方案=20113,
            --门派="龙宫",
            --饰品=true,
            -- 攻击修炼=0,  --怪物修炼添加方式
            -- 防御修炼=0,  --怪物修炼添加方式
            -- 法术修炼=0,  --怪物修炼添加方式
            -- 抗法修炼=0,  --怪物修炼添加方式
local qz=math.floor
local 战斗准备类 = class()
function 战斗准备类:初始化()
  self.战斗盒子={}
end
function 战斗准备类:创建玩家战斗(玩家id, 序号, 任务id, 地图)
  if 玩家数据[任务id]==nil or (玩家数据[任务id]~=nil and 玩家数据[任务id].角色.数据.战斗开关) then
    常规提示(玩家id,"#Y/对方正在战斗中......")
    return
  end
  if 玩家id==任务id then
    常规提示(玩家id,"#Y/自己打自己?你是不是打傻了?......")
    return
  end
  if (玩家数据[玩家id].队伍 ~= 0 and 玩家数据[玩家id].队长==false) or (玩家数据[任务id].队伍 ~= 0 and 玩家数据[任务id].队长==false) then
    常规提示(玩家id,"#Y/只有队长才能触发战斗!......")
    return
  end
  if 序号==200006 and 玩家数据[玩家id].角色.数据.帮派数据.编号==玩家数据[任务id].角色.数据.帮派数据.编号 then
    常规提示(玩家id,"#Y/同一帮派的玩家之间无法触发战斗！")
    return
  end
  if 序号==200004 and 玩家数据[玩家id].角色.数据.ip==玩家数据[任务id].角色.数据.ip then
    常规提示(玩家id,"#Y/比武场不能自己和自己刷分")
    return
    elseif 序号==200004 and 玩家数据[玩家id].角色.数据.账号==玩家数据[任务id].角色.数据.账号 then
    常规提示(玩家id,"#Y/比武场不能自己和自己刷分")
    return
  end
  self.临时id = 玩家id .. os.time() .. 取随机数(1, 999999)
  self.临时id = self.临时id + 0
  if 玩家数据[玩家id].队伍==0 then
    玩家数据[玩家id].战斗 = self.临时id
  else
    for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
      if 队伍处理类:取是否助战(玩家数据[玩家id].队伍,n) == 0 then
        玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].战斗=self.临时id
      end
    end
  end
  --接受方所有人设置战斗标识
  if 玩家数据[任务id].队伍==0 then
    玩家数据[任务id].战斗 = self.临时id
  else
    for n=1,#队伍数据[玩家数据[任务id].队伍].成员数据 do
      if 队伍处理类:取是否助战(玩家数据[任务id].队伍,n) == 0 then
        玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[n]].战斗=self.临时id
      end
    end
  end
  地图处理类:设置战斗开关(玩家id,true)
  if 序号 == 200001 or 序号 == 200002 or 序号 == 200003 or 序号 == 200004 or 序号 == 200005 or 序号 == 200006 or 序号 == 200007 or 序号 == 200008  or 序号 == 300001 then
    地图处理类:设置战斗开关(任务id,true)
      玩家数据[任务id].角色.数据.气血=玩家数据[任务id].角色.数据.最大气血
      玩家数据[任务id].角色.数据.魔法=玩家数据[任务id].角色.数据.最大魔法
      玩家数据[玩家id].角色.数据.气血=玩家数据[玩家id].角色.数据.最大气血
      玩家数据[玩家id].角色.数据.魔法=玩家数据[玩家id].角色.数据.最大魔法
    if 序号 == 200003 or 序号==200004 or 序号==200005 or 序号==200006 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中")
    elseif 序号 == 200007 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中,战斗失败将会受到失败死亡惩罚！")
    elseif 序号 == 200008 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中,战斗失败将会受到三倍失败死亡惩罚！")
    elseif 序号 == 300001 then
      常规提示(任务id,"#Y你进入了由#R" .. 玩家数据[玩家id].角色.数据.名称 .. "#Y发起的战斗中,战斗失败将会受到惩罚！")  ---嘎嘎 跨服
    end
  end
  self.战斗盒子[self.临时id] = 战斗处理类.创建()
  self.战斗盒子[self.临时id]:进入战斗(玩家id, 序号, 任务id, 地图)

end


-- function 战斗准备类:创建帮派战斗(玩家id, 序号, 任务id, 地图)
--  self.临时id=玩家id..os.time()..取随机数(1,999999)
--  self.临时id=self.临时id+0
--  if not 帮战进入 then
--   if 服务端参数.小时 <"20"or 服务端参数.小时 >="22"  then
--   常规提示(玩家id,"#y/现在不是帮战时间")
--    return
--   end
--   end
--   if 玩家数据[玩家id].队伍==0 then
--   常规提示(玩家id,"#y/没有队伍就别去找虐了..")
--     return
--    elseif 玩家数据[玩家id].队长==false then
--      常规提示(玩家id,"#y/必须由队长才能发起战斗")
--      return
--    elseif 取队伍人数(玩家id)<1 then
--     常规提示(玩家id,"#Y/队伍低于1人无法战斗")
--     return
--    end
--   if 玩家数据[任务id].队伍==0  then
--    常规提示(玩家id,"#y/对方没有队伍就不要欺负人家了...")
--     return
--     elseif 取队伍人数(任务id)<1 then
--     常规提示(玩家id,"#Y/对面低于1人无法战斗")
--     return
--   end

--   local jj
--   local cc
--   if 玩家数据[玩家id].队伍~=0 then
--        for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
--         jj = 队伍数据[玩家数据[玩家id].队伍].成员数据[n]
--           if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[任务id].队伍 then
--           常规提示(玩家id,"#Y/不要自相残杀哟，小老弟！！")
--             return
--           end
--           if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.数据.帮派数据.编号~=玩家数据[玩家id].角色.数据.帮派数据.编号 then
--           常规提示(玩家id,"#Y/本队伍中含有非本帮成员！")
--             return
--           end
--       end
--   end
--   if 序号 == 200006 then
--      if 玩家数据[任务id].队伍~=0 then
--            for b=1,#队伍数据[玩家数据[任务id].队伍].成员数据 do
--             cc= 队伍数据[玩家数据[任务id].队伍].成员数据[b]
--                if 玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[b]].角色.数据.帮派数据.编号==玩家数据[玩家id].角色.数据.帮派数据.编号 then
--                 常规提示(玩家id,"#Y/该队伍含有本帮成员，不要自行残杀了！")
--                 return
--               end
--               if 玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[b]].角色.数据.帮派数据.编号~= 玩家数据[任务id].角色.数据.帮派数据.编号 then
--                 常规提示(玩家id,"#Y/该队伍成员非同一帮派！无法击杀！")
--                 return
--               end
--           end
--       end
--     end
--     if 玩家数据[cc].角色.数据.战斗开关 then
--       常规提示(玩家id,"#Y/该队伍正在战斗中")
--       return
--     end
--      if 玩家数据[玩家id].队伍~=0 then
--         for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
--           if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
--             玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].战斗=self.临时id
--             玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.数据.战斗开关=true
--             地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
--           end
--         end
--     end
--     if 玩家数据[任务id].队伍~=0 then
--       for n=1,#队伍数据[玩家数据[任务id].队伍].成员数据 do
--         if 玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[n]].队伍==玩家数据[任务id].队伍 then
--           玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[n]].战斗=self.临时id
--           玩家数据[队伍数据[玩家数据[任务id].队伍].成员数据[n]].角色.数据.战斗开关=true
--           地图处理类:设置战斗开关(队伍数据[玩家数据[任务id].队伍].成员数据[n],true)
--         end
--       end
--     end
--     self.战斗盒子[self.临时id]=战斗处理类.创建()
--     self.战斗盒子[self.临时id]:进入战斗(玩家id,序号,任务id,地图)


-- end


function 战斗准备类:创建战斗(玩家id,序号,任务id,地图,假人属性)
  local 临时id=取随机数(999999,9999999).."_"..玩家id.."_"..os.time().."_"..取随机数(1,999999)
   临时id=临时id
   玩家数据[玩家id].战斗=临时id
  if 玩家数据[玩家id].队伍==0 then
    玩家数据[玩家id].角色.数据.战斗开关=true
    地图处理类:设置战斗开关(玩家id,true)
  else
    for n=1,#队伍数据[玩家数据[玩家id].队伍].成员数据 do
      if 玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].队伍==玩家数据[玩家id].队伍 then
        if 队伍处理类:取是否助战(玩家数据[玩家id].队伍,n) == 0 then
          玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].战斗=临时id
          玩家数据[队伍数据[玩家数据[玩家id].队伍].成员数据[n]].角色.数据.战斗开关=true
          地图处理类:设置战斗开关(队伍数据[玩家数据[玩家id].队伍].成员数据[n],true)
        end
      end
    end
  end
  self.战斗盒子[临时id]=战斗处理类.创建()
  if 序号==100001 or 序号==100007 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,地图)
  elseif 序号==100002 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图强盗信息(任务id,玩家id))
  elseif 序号==100003 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图遇怪信息(任务id,玩家id))
  elseif 序号==100004 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取封妖任务信息(任务id,玩家id))
  elseif 序号==100005 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取幼儿园信息(任务id,玩家id))
  elseif 序号==100006 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取科举闯关信息(任务id,玩家id))
  elseif 序号==100008 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取捉鬼任务信息(任务id,玩家id))
  elseif 序号==100009 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取星宿任务信息(任务id,玩家id))
  elseif 序号==100010 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖魔鬼怪信息(任务id,玩家id))
  elseif 序号==100011 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派闯关信息(任务id,玩家id))
  elseif 序号==100012 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取游泳水妖信息(任务id,玩家id))
  elseif 序号==100013 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取官职流氓信息(任务id,玩家id))
  elseif 序号==100014 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取官职巡逻信息(任务id,玩家id))
  elseif 序号==100015 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派巡逻信息(任务id,玩家id))
  elseif 序号==100016 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派示威信息(任务id,玩家id))
  elseif 序号==100017 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派支援信息(任务id,玩家id))
  elseif 序号==100018 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取门派乾坤袋信息(任务id,玩家id))
  elseif 序号==100019 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取迷宫小怪信息(任务id,玩家id))
  elseif 序号==100020 then
    if 任务数据[任务id].模型=="炎魔神" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王炎魔神(任务id,玩家id))
    elseif 任务数据[任务id].模型=="鬼将" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王鬼将(任务id,玩家id))
    elseif 任务数据[任务id].模型=="净瓶女娲" then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖王净瓶女娲(任务id,玩家id))
    end
  elseif 序号==100021 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取江湖大盗信息(任务id,玩家id))
  elseif 序号==100022 then
    if 任务数据[任务id].分类==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取毛贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取销赃贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝贼信息(任务id,玩家id))
    elseif 任务数据[任务id].分类==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取盗贼首领信息(任务id,玩家id))
    end
  elseif 序号==100023 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取皇宫贼王信息(任务id,玩家id))
  elseif 序号==100024 then
    if 任务数据[任务id].等级==150 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取150级世界BOSS信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==150 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取150级世界BOSS信息(任务id,玩家id))
    elseif 任务数据[任务id].等级==150 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取150级世界BOSS信息(任务id,玩家id))
    end
  elseif 序号==100025 then
    local 随机序列=取随机数(1,#任务数据[任务id].完成)
    local 战斗序列=任务数据[任务id].完成[随机序列]
    任务数据[任务id].战斗序列=随机序列
    if 战斗序列==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息1(任务id,玩家id))
    elseif 战斗序列==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息2(任务id,玩家id))
    elseif 战斗序列==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息3(任务id,玩家id))
    elseif 战斗序列==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息4(任务id,玩家id))
    elseif 战斗序列==5 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息5(任务id,玩家id))
    elseif 战斗序列==6 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取镖王信息6(任务id,玩家id))
    end
  elseif 序号==100026 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取三界悬赏令信息(任务id,玩家id))
  elseif 序号==100027 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取知了王信息(任务id,玩家id))
  elseif 序号==100028 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本芭蕉妖怪信息(任务id,玩家id))
  elseif 序号==100029 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本三妖信息(任务id,玩家id))
  elseif 序号==100030 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本鬼祟小怪信息(任务id,玩家id))
  elseif 序号==100031 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取副本国王信息(任务id,玩家id))
  elseif 序号==100032 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:天庭叛逆(任务id,玩家id))
  elseif 序号==100033 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:捣乱的水果(任务id,玩家id))
  elseif 序号==100034 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取青龙巡逻信息(任务id,玩家id))
  elseif 序号==100035 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取玄武巡逻信息(任务id,玩家id))
  elseif 序号==100037 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取地煞信息(任务id,玩家id))
  elseif 序号==100040 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大力神灵信息(任务id,玩家id))
  elseif 序号==100041 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妖魔亲信信息(任务id,玩家id))
  elseif 序号==100042 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蜃妖元神信息(任务id,玩家id))
  elseif 序号==100043 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取周猎户信息(任务id,玩家id))
  elseif 序号==100044 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取法宝战斗信息(任务id,玩家id))
  elseif 序号==100045 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取法宝内丹战斗信息(任务id,玩家id))
  elseif 序号==100046 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取横行霸道的土匪战斗信息(任务id,玩家id))
  elseif 序号==100047 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升心魔战斗信息(任务id,玩家id))
  elseif 序号==100048 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升小妖战斗信息(任务id,玩家id))
  elseif 序号==100049 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升小宝箱战斗信息(任务id,玩家id))
  elseif 序号==100050 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法1战斗信息(任务id,玩家id,假人属性))
  elseif 序号==100051 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法2战斗信息(任务id,玩家id,假人属性))
  elseif 序号==100052 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法3战斗信息(任务id,玩家id,假人属性))
  elseif 序号==100053 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法4战斗信息(任务id,玩家id,假人属性))
  elseif 序号==100054 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取飞升阵法5战斗信息(任务id,玩家id,假人属性))
  elseif 序号==100055 then
    if 生死劫数据[玩家id]==1 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息1(任务id,玩家id))
    elseif 生死劫数据[玩家id]==2 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息2(任务id,玩家id))
    elseif 生死劫数据[玩家id]==3 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息3(任务id,玩家id))
    elseif 生死劫数据[玩家id]==4 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息4(任务id,玩家id))
    elseif 生死劫数据[玩家id]==5 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息5(任务id,玩家id))
    elseif 生死劫数据[玩家id]==6 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息6(任务id,玩家id))
    elseif 生死劫数据[玩家id]==7 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息7(任务id,玩家id))
    elseif 生死劫数据[玩家id]==8 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息8(任务id,玩家id))
    elseif 生死劫数据[玩家id]==9 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取生死劫信息9(任务id,玩家id))
    end
  elseif 序号==100056 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取天罡星信息(任务id,玩家id))
  elseif 序号==100060 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取新服福利BOSS信息(任务id,玩家id))
  elseif 序号==100066 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法贡品信息(任务id,玩家id))
  elseif 序号==100067 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法三清信息(任务id,玩家id))
  elseif 序号==100068 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法求雨信息(任务id,玩家id))
  elseif 序号==100069 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法不动信息(任务id,玩家id))
  elseif 序号==100070 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取车迟斗法妖怪信息(任务id,玩家id))
  elseif 序号==100084 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取散财童子信息(任务id,玩家id))
  elseif 序号==100085 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取神秘妖怪信息(任务id,玩家id))
  elseif 序号==100086 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息(任务id,玩家id))
  elseif 序号==100087 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息2(任务id,玩家id))
  elseif 序号==100088 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取渡劫师傅信息(任务id,玩家id))
  elseif 序号==100089 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取妄空曰天冷信息2(任务id,玩家id))
  elseif 序号==100090 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取蚩尤幻影信息(任务id,玩家id))
  elseif 序号==100097 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取马超信息(任务id,玩家id))
  elseif 序号==100098 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取黄忠信息(任务id,玩家id))
  elseif 序号==100099 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取张飞信息(任务id,玩家id))
  elseif 序号==100100 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取关羽信息(任务id,玩家id))
  elseif 序号==100101 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取赵云信息(任务id,玩家id))
  elseif 序号==100105 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取福利宝箱怪(任务id,玩家id))
  elseif 序号==100106 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取倾国倾城信息(任务id,玩家id))
  elseif 序号==100107 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取美食专家信息(任务id,玩家id))
  elseif 序号==100108 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天塔信息(任务id,玩家id,假人属性))
  elseif 序号==100109 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取贼王的线索信息(任务id,玩家id))
  elseif 序号==100110 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取貔貅的羁绊信息(任务id,玩家id))
  elseif 序号==100112 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆桃木虫信息(任务id,玩家id))
  elseif 序号==100113 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆泼猴信息(任务id,玩家id))
  elseif 序号==100114 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆翼虎必死信息(任务id,玩家id))
  elseif 序号==100115 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆蝰蛇必死信息(任务id,玩家id))
  elseif 序号==100116 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆翼虎信息(任务id,玩家id))
  elseif 序号==100117 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆蝰蛇信息(任务id,玩家id))
  elseif 序号==100118 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆魑魅魍魉信息(任务id,玩家id))
  elseif 序号==100119 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取水陆毒虫信息(任务id,玩家id))
  elseif 序号==100120 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取宝图强盗信息(任务id,玩家id))
  elseif 序号==100122 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取捣乱的年兽信息(任务id,玩家id))
  elseif 序号==100123 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取年兽王信息(任务id,玩家id))
  elseif 序号==100124 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取怨灵幻影信息(任务id,玩家id))
  elseif 序号==100125 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取灵感分身信息(任务id,玩家id))
  elseif 序号==100126 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天河妖信息(任务id,玩家id))
  elseif 序号==100127 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天散财童子信息(任务id,玩家id))
  elseif 序号==100128 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天黑熊精信息(任务id,玩家id))
  elseif 序号==100129 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天五色竹条信息(任务id,玩家id))
  elseif 序号==100130 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军1信息(任务id,玩家id))
  elseif 序号==100131 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军2信息(任务id,玩家id))
  elseif 序号==100132 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军3信息(任务id,玩家id))
  elseif 序号==100133 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军4信息(任务id,玩家id))
  elseif 序号==100134 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天金鱼将军5信息(任务id,玩家id))
  elseif 序号==100135 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取通天灵感大王信息(任务id,玩家id))
  elseif 序号==110000 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:木桩伤害测试(任务id,玩家id,假人属性))
  elseif 序号==110000.1 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:木桩伤害测试2(任务id,玩家id,假人属性))
  elseif 序号==110001 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取剑会天下属性(假人属性))
  elseif 序号==110002 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:桃园蚩尤(任务id,玩家id))
  elseif 序号==110003 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:桃园野猪(任务id,玩家id))
  elseif 序号==110004 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:商人的鬼魂(任务id,玩家id))
  elseif 序号==110005 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:妖风战斗(任务id,玩家id))
  elseif 序号==110006 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:白鹿精(任务id,玩家id))
  elseif 序号==110007 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:酒肉和尚假(任务id,玩家id))
  elseif 序号==110008 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:执法天兵(任务id,玩家id))
  elseif 序号==110009 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:白琉璃(任务id,玩家id))
  elseif 序号==110010 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:酒肉和尚真(任务id,玩家id))
  elseif 序号==110011 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:幽冥鬼(任务id,玩家id))
  elseif 序号==110012 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:蟹将军(任务id,玩家id))
  elseif 序号==110013 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:假刘洪(任务id,玩家id))
  elseif 序号==110014 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:真刘洪(任务id,玩家id))
  elseif 序号==110015 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:天兵飞剑(任务id,玩家id))
  elseif 序号==110016 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:日常商人鬼魂(任务id,玩家id))
  elseif 序号==110034 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:蚩尤大战(任务id,玩家id))
  elseif 序号==110035 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:妖风战斗日常(任务id,玩家id))
  elseif 序号==110135 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:刻晴全服奖励(任务id,玩家id))
  elseif 序号==110036 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:白鹿精日常(任务id,玩家id))
  elseif 序号==110038 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:押镖遇怪(任务id,玩家id))
  elseif 序号==100147 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹抢水信息(任务id,玩家id))
  elseif 序号==100148 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹除虫信息(任务id,玩家id))
  elseif 序号==100149 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹仙女信息(任务id,玩家id))
  elseif 序号==100150 then --造酒仙官
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹造酒信息(任务id,玩家id))
  elseif 序号==100151 then --造酒运水
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹运水信息(任务id,玩家id))
  elseif 序号==100152 then --造酒烧火
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹烧火信息(任务id,玩家id))
  elseif 序号==100153 then --造酒盘槽
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹盘槽信息(任务id,玩家id))
  elseif 序号==100154 then --造酒盘槽
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹天兵信息(任务id,玩家id))
  elseif 序号==100155 then --造酒盘槽
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹天将信息(任务id,玩家id))
  elseif 序号==100156 then --造酒盘槽
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹二郎神信息(任务id,玩家id))
  elseif 序号==100157 then --造酒盘槽
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取大闹上古雷神信息(任务id,玩家id))
  elseif 序号==100214 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹黑白无常(任务id,玩家id))  --齐天大圣
  elseif 序号==100215 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹阎王(任务id,玩家id)) --齐天大圣
  elseif 序号==100216 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹天王(任务id,玩家id)) --齐天大圣
  elseif 序号==100217 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹盗马贼(任务id,玩家id)) --齐天大圣
  elseif 序号==100218 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹百万天兵(任务id,玩家id)) --齐天大圣
  elseif 序号==100219 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹巨灵神(任务id,玩家id)) --齐天大圣
  elseif 序号==100220 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大闹镇塔之神(任务id,玩家id)) --齐天大圣
  elseif 序号==100221 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取幼儿园信息1(任务id,玩家id))
  elseif 序号==100222 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:首席争霸(任务id,玩家id,假人属性))
  elseif 序号==100223 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:酒肉日常(任务id,玩家id))
  elseif 序号==100224 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:执法天兵日常(任务id,玩家id))
  elseif 序号==100225 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:随机神兽(任务id,玩家id))
  elseif 序号==100226 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:桃园狸猫(任务id,玩家id))
  elseif 序号==100227 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:虎子战斗(任务id,玩家id))
  elseif 序号==100228 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战灵鹤(任务id,玩家id))
  elseif 序号==100229 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战灵鹤2(任务id,玩家id))
  elseif 序号==100230 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战江南小盗(任务id,玩家id))
  elseif 序号==100231 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战大大龟(任务id,玩家id))
  elseif 序号==100232 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战绿皮蛙(任务id,玩家id))
  elseif 序号==100233 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战屈原(任务id,玩家id))
  elseif 序号==100234 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战狂盗(任务id,玩家id))
  elseif 序号==100235 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战黄狮王(任务id,玩家id))
  elseif 序号==100236 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战马全有(任务id,玩家id))
  elseif 序号==100237 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战海盗头子(任务id,玩家id))
  elseif 序号==100238 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:梦战浪鬼(任务id,玩家id))
  elseif 序号==100239 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:自动抓鬼(任务id,玩家id))
  elseif 序号==100240 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:自动门派(任务id,玩家id))
  elseif 序号==100241 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:自动官职(任务id,玩家id))
  elseif 序号==100243 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:洛树妖(任务id,玩家id))
  elseif 序号==100244 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:赌徒喽啰(任务id,玩家id))
  elseif 序号==100245 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:江州县令(任务id,玩家id))
  elseif 序号==100246 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:江洋大盗(任务id,玩家id))
  elseif 序号==100247 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:洛川鬼(任务id,玩家id))
  elseif 序号==100248 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:妩媚狐仙(任务id,玩家id))
  elseif 序号==100249 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:赌霸城(任务id,玩家id))
  elseif 序号==100250 then
   self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:半阁守将(任务id,玩家id))
  elseif 序号==100251 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:流氓兔(任务id,玩家id))
  elseif 序号==100252 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大雁塔塔主(任务id,玩家id))
  elseif 序号==100253 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大雁塔塔主2(任务id,玩家id))
  elseif 序号==100254 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:大雁塔塔主3(任务id,玩家id))
  elseif 序号==100255 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:卷帘大将1(任务id,玩家id))
  elseif 序号==100256 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:卷帘大将2(任务id,玩家id))
  elseif 序号==100257 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:路人甲(任务id,玩家id))
  elseif 序号==100258 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:杨戬(任务id,玩家id))
  elseif 序号==100259 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:龙孙(任务id,玩家id))
  elseif 序号==100260 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:卷帘大将3(任务id,玩家id))
  elseif 序号==100261 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:玄奘分身(任务id,玩家id))
  elseif 序号==100262 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:空慈方丈(任务id,玩家id))
  elseif 序号==100263 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:王福来(任务id,玩家id))
  elseif 序号==100264 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:蓝火兽(任务id,玩家id))
  elseif 序号==100265 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:吸血蝙蝠(任务id,玩家id))
  elseif 序号==100266 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:肾宝狼(任务id,玩家id))
  elseif 序号==100242 then
  if 任务数据[任务id].分类==1 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取巧智魔信息(任务id,玩家id))
  elseif 任务数据[任务id].分类==2 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取怯弱妖信息(任务id,玩家id))
  elseif 任务数据[任务id].分类==3 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取迷幻妖信息(任务id,玩家id))
  elseif 任务数据[任务id].分类==4 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取梦魇魔信息(任务id,玩家id))
  elseif 任务数据[任务id].分类==5 then
  self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:万年魔灵(任务id,玩家id))
  end
  elseif 序号==100301 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠鸾儿(任务id,玩家id))
  elseif 序号==100302 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠叶夫人(任务id,玩家id))
  elseif 序号==100303 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠官差(任务id,玩家id))
  elseif 序号==100304 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠沈唐一(任务id,玩家id))
  elseif 序号==100305 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠夜影迷踪(任务id,玩家id))
  elseif 序号==100306 then
    self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:一斛珠沈唐二(任务id,玩家id))

  elseif 序号==199406 then
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取征战神州信息(任务id,玩家id))
  elseif 序号==199407 then--文韵李世民
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取文韵李世民(任务id,玩家id))
  elseif 序号==199408 then--文韵砍木头
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取文韵砍木头(任务id,玩家id))
  elseif 序号==199409 then--文韵巡逻
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取文韵巡逻(任务id,玩家id))
  elseif 序号==199410 then--文韵护送西域使者
      self.战斗盒子[临时id]:进入战斗(玩家id,序号,任务id,self:取文韵护送西域使者(任务id,玩家id))


  end
end

function 战斗准备类:取巧智魔信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称="巧智魔",模型="蜃气妖",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*1.5,防御=等级*3,法防=等级*3.7,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)), 法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="巧智魔",模型="蜃气妖",伤害=等级*8,气血=等级*等级*0.85,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级必杀","高级连击"},主动技能={}}
  战斗单位[3]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[5]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[6]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="巧智魔",模型="蜃气妖",伤害=等级*6,气血=等级*等级*0.65,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取怯弱妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称="怯弱妖",模型="雾中仙",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200000,等级=等级,    攻击修炼=math.floor(取人物修炼等级上限(等级)),防御修炼=math.floor(取人物修炼等级上限(等级)),
  法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="怯弱妖",模型="雾中仙",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[3]={名称="怯弱妖",模型="雾中仙",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="怯弱妖",模型="雾中仙",伤害=等级*5,气血=等级*等级,灵力=等级*6,速度=等级*2.5,防御=等级*1,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={"水攻","烈火","落岩","雷击"}}
  战斗单位[5]={名称="怯弱妖",模型="雾中仙",变异=true,伤害=等级*10,气血=等级*等级,灵力=等级*4,速度=等级*2.5,防御=等级*3,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级连击","高级必杀"},主动技能={}}
  战斗单位[6]={名称="怯弱妖",模型="雾中仙",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="怯弱妖",模型="雾中仙",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="怯弱妖",模型="雾中仙",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取迷幻妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*10,气血=等级*等级*2,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*10,变异=true,气血=等级*等级*1.8,灵力=等级*6,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[4]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[6]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="迷幻妖",模型="曼珠沙华",伤害=等级*8,气血=等级*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取梦魇魔信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称="梦魇魔",模型="炎魔神",伤害=等级*11,气血=等级*等级*3,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*1,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[4]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="梦魇魔",模型="炎魔神",伤害=等级*11,气血=等级*等级*2.5,灵力=等级*6,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[6]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="梦魇魔",模型="炎魔神",伤害=等级*9,气血=等级*等级*1.5,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:万年魔灵(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称="万年魔灵",模型="九头精怪",伤害=等级*18,气血=(等级-5+等级*0.2)*145,灵力=等级*25,速度=等级*4.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知","高级驱鬼"},主动技能={"变身","狮搏","连环击","鹰击"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="魔灵护法",模型="大力金刚",伤害=等级*14,气血=等级*等级*1.5,灵力=等级*15,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能={"横扫千军","后发制人"}}
  战斗单位[3]={名称="魔灵护法",模型="大力金刚",伤害=等级*14,气血=等级*等级*1.5,灵力=等级*15,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能={"横扫千军","后发制人"}}
  战斗单位[4]={名称="魔灵护法",模型="大力金刚",伤害=等级*14,气血=等级*等级*1.5,灵力=等级*15,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能={"裂石","浪涌"}}
  战斗单位[5]={名称="魔灵护法",模型="大力金刚",伤害=等级*14,气血=等级*等级*1.5,灵力=等级*15,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能={"裂石","浪涌"}}
  战斗单位[6]={名称="小妖",模型="黑山老妖",伤害=等级*10,气血=等级*等级,灵力=等级*10,速度=等级*3,防御=等级*4,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="小妖",模型="黑山老妖",伤害=等级*10,气血=等级*等级,灵力=等级*10,速度=等级*3,防御=等级*4,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="小妖",模型="黑山老妖",伤害=等级*10,气血=等级*等级,灵力=等级*10,速度=等级*3,防御=等级*4,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="小妖",模型="黑山老妖",伤害=等级*10,气血=等级*等级,灵力=等级*10,速度=等级*3,防御=等级*4,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="不死魔灵",模型="芙蓉仙子",伤害=等级*5,气血=等级*等级*2,灵力=等级*25,速度=等级*5,防御=等级*6,法防=等级*5,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼","高级神佑复生"},主动技能={"催眠符","失心符","定身符"}}
  return 战斗单位
end

function 战斗准备类:一斛珠鸾儿(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 武器造型={武器="吹雪",级别=90}
  战斗单位[1]={名称="鸾儿姑娘",模型="狐美人",角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),伤害=等级*15,气血=(等级-5+等级*0.2)*235+等级*6.5*6,灵力=等级*15,速度=等级*4,防御=等级*8,法防=等级*5,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)/2),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)/2),技能={"高级感知","高级驱鬼"},主动技能={"变身","连环击","鹰击"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="清醒意识",模型="画魂",伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[3]={名称="清醒意识",模型="画魂",伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[4]={名称="清醒意识",模型="雾中仙",伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"龙卷雨击","龙吟","龙腾"}}
  战斗单位[5]={名称="清醒意识",模型="雾中仙",伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"龙卷雨击","龙吟","龙腾"}}
  战斗单位[6]={名称="泪光盈盈",模型="进阶蝴蝶仙子",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[7]={名称="泪光盈盈",模型="进阶蝴蝶仙子",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[8]={名称="泪光盈盈",模型="进阶蝴蝶仙子",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[9]={名称="缠绵幽怨",模型="芙蓉仙子",伤害=等级*15,气血=(等级-5+等级*0.2)*130,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"裂石","浪涌"}}
  战斗单位[10]={名称="缠绵幽怨",模型="芙蓉仙子",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"似玉生香"}}
  return 战斗单位
end

function 战斗准备类:一斛珠叶夫人(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 武器造型={武器="月光双剑",级别=90}
  战斗单位[1]={名称="叶夫人",模型="飞燕女",角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),伤害=等级*10,气血=(等级-5+等级*0.2)*235+等级*6.5*6,灵力=等级*13,速度=等级*4,防御=等级*8,法防=等级*5,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)/2),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)/2),技能={"高级感知","高级驱鬼"},主动技能={"龙卷雨击","龙吟","龙腾"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="疯狂意识",模型="画魂",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"百爪狂杀"}}
  战斗单位[3]={名称="疯狂意识",模型="画魂",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"百爪狂杀"}}
  战斗单位[4]={名称="疯狂意识",模型="阴阳伞",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"催眠符","失心符","落雷符"}}
  战斗单位[5]={名称="疯狂意识",模型="阴阳伞",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"催眠符","失心符","落雷符"}}
  战斗单位[6]={名称="切肤之痛",模型="蔓藤妖花",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[7]={名称="切肤之痛",模型="蔓藤妖花",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[8]={名称="切肤之痛",模型="蔓藤妖花",伤害=等级*10,气血=(等级-5+等级*0.2)*130,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[9]={名称="黯然神伤",模型="夜罗刹",伤害=等级*15,气血=(等级-5+等级*0.2)*130,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级连击","高级必杀"},主动技能={}}
  战斗单位[10]={名称="黯然神伤",模型="夜罗刹",伤害=等级*15,气血=(等级-5+等级*0.2)*130,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级连击","高级必杀"},主动技能={}}
  return 战斗单位
end

function 战斗准备类:一斛珠官差(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称="官差",模型="天兵",伤害=等级*15,气血=(等级-5+等级*0.2)*235+等级*6.5*6+ 等级*6.5*6,灵力=等级*12,速度=等级*4,防御=等级*8,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)/2),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)/2),技能={"高级感知","高级驱鬼"},主动技能={"三昧真火","飞砂走石"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="官差帮手",模型="天兵",变异=true,伤害=等级*15,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*4,防御=等级*3,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"横扫千军","后发制人"}}
  战斗单位[3]={名称="官差帮手",模型="天兵",变异=true,伤害=等级*15,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*4,防御=等级*3,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"横扫千军","后发制人"}}
  战斗单位[4]={名称="官差帮手",模型="巡游天神",伤害=等级*14,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*4,防御=等级*3,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"后发制人","杀气诀"}}
  战斗单位[5]={名称="官差帮手",模型="巡游天神",伤害=等级*14,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*4,防御=等级*3,法防=等级*2,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"后发制人","反间之计"}}
  return 战斗单位
end

function 战斗准备类:一斛珠沈唐一(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 武器造型={武器="星瀚",级别=160}
  战斗单位[1]={名称="沈唐",模型="逍遥生",角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),伤害=等级*16,气血=(等级-5+等级*0.2)*235+等级*6.5*6,灵力=等级*12.5,速度=等级*4,防御=等级*6,法防=等级*6,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=0,法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知","高级驱鬼"},主动技能={"横扫千军","后发制人","破血狂攻"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="玉鳞蛟",模型="蛟龙",伤害=等级*14,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"百爪狂杀","阎罗令","尸腐毒"}}
  战斗单位[3]={名称="玉鳞蛟",模型="蛟龙",伤害=等级*14,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"百爪狂杀","阎罗令","尸腐毒"}}
  战斗单位[4]={名称="锦云蛟",模型="蛟龙",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[5]={名称="锦云蛟",模型="蛟龙",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[6]={名称="珊瑚灵妖",模型="曼珠沙华",伤害=等级*10,气血=(等级-5+等级*0.2)*145,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[7]={名称="珊瑚灵妖",模型="曼珠沙华",伤害=等级*10,气血=(等级-5+等级*0.2)*145,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[8]={名称="珊瑚灵妖",模型="曼珠沙华",伤害=等级*10,气血=(等级-5+等级*0.2)*145,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"水漫金山"}}
  战斗单位[9]={名称="金藻傀儡",模型="修罗傀儡鬼",伤害=等级*15,气血=(等级-5+等级*0.2)*145,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"破血狂攻","浪涌"}}
  战斗单位[10]={名称="金藻傀儡",模型="修罗傀儡鬼",伤害=等级*15,气血=(等级-5+等级*0.2)*145,灵力=等级*8,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"破血狂攻","浪涌"}}
  return 战斗单位
end

function 战斗准备类:一斛珠夜影迷踪(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称="夜影迷踪",模型="蛟龙",变异=true,伤害=等级*12,气血=(等级-5+等级*0.2)*170+等级*6.5*6+ 等级*6.5*6,灵力=等级*10,速度=等级*4,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","高级驱鬼"},主动技能={"龙卷雨击","龙腾"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="孤苦蚌精",模型="蚌精",伤害=等级*10,气血=(等级-5+等级*0.2)*110,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","法术连击"},主动技能={"水漫金山"}}
  战斗单位[3]={名称="孤苦蚌精",模型="蚌精",伤害=等级*10,气血=(等级-5+等级*0.2)*110,灵力=等级*10,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","法术连击"},主动技能={"水漫金山"}}
  战斗单位[4]={名称="潦倒鲛人",模型="鲛人",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*110,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级必杀"},主动技能={"壁垒击破"}}
  战斗单位[5]={名称="潦倒鲛人",模型="鲛人",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*110,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级必杀"},主动技能={"壁垒击破"}}
  return 战斗单位
end

function 战斗准备类:一斛珠沈唐二(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称="沈唐真身",模型="鲛人",伤害=等级*16,气血=(等级-5+等级*0.2)*235+ 等级*6.5*6,灵力=等级*10,速度=等级*4,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)/2),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)/2),技能={"高级感知","高级驱鬼","高级夜战"},主动技能={"浪涌","破血狂攻"}}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="悲歌",模型="噬天虎",变异=true,伤害=等级*14.5,气血=(等级-5+等级*0.2)*190,灵力=等级*7,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"变身","鹰击"}}
  战斗单位[3]={名称="悲歌",模型="噬天虎",变异=true,伤害=等级*14.5,气血=(等级-5+等级*0.2)*190,灵力=等级*7,速度=等级*3.5,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"变身","鹰击"}}
  战斗单位[4]={名称="欢喜",模型="蚌精",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*190,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[5]={名称="欢喜",模型="蚌精",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*190,灵力=等级*8,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知"},主动技能={"推气过宫","金刚护体","金刚护法"}}
  战斗单位[6]={名称="沧浪之涛",模型="混沌兽",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10.5,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级驱鬼"},主动技能={"上古灵符"}}
  战斗单位[7]={名称="沧浪之涛",模型="混沌兽",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10.5,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级驱鬼"},主动技能={"上古灵符"}}
  战斗单位[8]={名称="沧浪之涛",模型="混沌兽",变异=true,伤害=等级*10,气血=(等级-5+等级*0.2)*170,灵力=等级*10.5,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级驱鬼"},主动技能={"上古灵符"}}
  战斗单位[9]={名称="荒墟之悲",模型="碧水夜叉",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","夜战"},主动技能={"壁垒击破"}}
  战斗单位[10]={名称="荒墟之悲",模型="碧水夜叉",变异=true,伤害=等级*13,气血=(等级-5+等级*0.2)*170,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*3,躲闪=等级*2,魔法=200000,愤怒=9999,等级=等级,技能={"高级感知","夜战"},主动技能={"壁垒击破"}}
  return 战斗单位
end

function 战斗准备类:大闹盗马贼(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=等级*8*1
    ,变异=true
    ,气血=(等级*等级*20+5000)*1
    ,灵力=(等级*5+200)*1
    ,速度=等级*7*1
    ,防御=等级*5*1
    ,法防=等级*5*1
    ,躲闪=等级*5*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  return 战斗单位
end

function 战斗准备类:大闹黑白无常(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="鬼差"
    ,模型=任务数据[任务id].模型
    ,伤害=等级*20*1
    ,变异=true
    ,气血=(等级*200)*1
    ,灵力=(等级*5+200)*1
    ,速度=等级*5*1
    ,防御=等级*5*1
    ,法防=等级*5*1
    ,躲闪=等级*5*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="斩妖"
    ,模型="巡游天神"
    ,伤害=等级*15*1
    ,变异=true
    ,气血=(等级*100+1000)*1
    ,灵力=等级*4*1
    ,速度=等级*3*1
    ,防御=等级*8*1
    ,法防=500
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="斩妖"
    ,模型="巡游天神"
    ,伤害=等级*15*1
    ,变异=true
    ,气血=(等级*100+1000)*1
    ,灵力=等级*4*1
    ,速度=等级*3*1
    ,防御=等级*8*1
    ,法防=500
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="灾"
    ,模型="夜罗刹"
    ,伤害=等级*10*1
    ,变异=true
    ,气血=(等级*100+1000)*1
    ,灵力=(等级*20+200)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="难"
    ,模型="夜罗刹"
    ,变异=true
    ,伤害=等级*10*1
    ,气血=(等级*100+1000)*1
    ,灵力=(等级*20+200)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="鬼兵"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=等级*10*1
    ,气血=(等级*100+1000)*1
    ,灵力=(等级*20+200)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="鬼兵"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=等级*10*1
    ,气血=(等级*108+1000)*1
    ,灵力=等级*5*1
    ,速度=等级*7*1
    ,防御=等级*3*1
    ,法防=等级*3.8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,等级=等级
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="天罚"
    ,模型="混沌兽"
    ,变异=true
    ,伤害=等级*10*1
    ,气血=(等级*108+1000)*1
    ,灵力=等级*5*1
    ,速度=等级*7*1
    ,防御=等级*3*1
    ,法防=等级*3.8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  return 战斗单位
end

function 战斗准备类:大闹阎王(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="冥府鬼将"
    ,模型="鬼将"
    ,伤害=等级*23*1
    ,变异=true
    ,气血=(等级*等级*10+10000)*1
    ,灵力=(等级*15+200)*1
    ,速度=等级*7*1
    ,防御=等级*5*1
    ,法防=等级*5*1
    ,躲闪=等级*5*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="鬼差"
    ,模型="野鬼"
    ,伤害=等级*15*1
    ,变异=true
    ,气血=(等级*等级*5+1000)*1
    ,灵力=等级*4*1
    ,速度=等级*3*1
    ,防御=等级*8*1
    ,法防=500
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="鬼差"
    ,模型="野鬼"
    ,伤害=等级*15*1
    ,变异=true
    ,气血=(等级*等级*5+1000)*1
    ,灵力=等级*4*1
    ,速度=等级*3*1
    ,防御=等级*8*1
    ,法防=500
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="灾"
    ,模型="夜罗刹"
    ,伤害=等级*11*1
    ,变异=true
    ,气血=(等级*等级*5+1000)*1
    ,灵力=(等级*20+400)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[5]={
    名称="难"
    ,模型="夜罗刹"
    ,变异=true
    ,伤害=等级*11*1
    ,气血=(等级*等级*5+1000)*1
    ,灵力=(等级*20+400)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[6]={
    名称="鬼兵"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=等级*11*1
    ,气血=(等级*等级*5+1000)*1
    ,灵力=(等级*20+400)*1
    ,速度=等级*2*1
    ,防御=等级*3*1
    ,法防=等级*8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[7]={
    名称="鬼兵"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=等级*11*1
    ,气血=(等级*等级*8+1000)*1
    ,灵力=等级*6*1
    ,速度=等级*7*1
    ,防御=等级*3*1
    ,法防=等级*3.8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="天罚"
    ,模型="混沌兽"
    ,变异=true
    ,伤害=等级*11*1
    ,气血=(等级*等级*8+1000)*1
    ,灵力=等级*6*1
    ,速度=等级*7*1
    ,防御=等级*3*1
    ,法防=等级*3.8*1
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","日月乾坤"}
  }
  return 战斗单位
end

function 战斗准备类:大闹天王(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="大力神王"
    ,模型="大力金刚"
    ,伤害=等级*25*1.2
    ,变异=true
    ,气血=(等级*等级*20+10000)*1.2
    ,灵力=(等级*15+200)*1.2
    ,速度=等级*7*1
    ,防御=等级*5*1
    ,法防=等级*5*1
    ,躲闪=等级*5*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="斩妖"
    ,模型="巡游天神"
    ,伤害=等级*15*1.2
    ,变异=true
    ,气血=(等级*等级+50000)*1.2
    ,灵力=等级*4*1
    ,速度=等级*3*1
    ,防御=等级*8*1
    ,法防=500
    ,躲闪=等级*4*1
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","弱点击破"}}
  战斗单位[3]={
    名称="斩妖"
    ,模型="地狱战神"
    ,伤害=等级*15*1.2
    ,变异=true
    ,气血=(等级*等级+50000)*1.2
    ,灵力=等级*4*1.2
    ,速度=等级*3*1.2
    ,防御=等级*8*1.2
    ,法防=500
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="天灾"
    ,模型="夜罗刹"
    ,伤害=等级*10*1.2
    ,变异=true
    ,气血=(等级*等级+50000)*1.2
    ,灵力=(等级*20+200)*1.2
    ,速度=等级*2*1.2
    ,防御=等级*3*1.2
    ,法防=等级*8*1.2
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="苦难"
    ,模型="夜罗刹"
    ,变异=true
    ,伤害=等级*10*1.2
    ,气血=(等级*等级*15+2000)*1.2
    ,灵力=(等级*20+200)*1.2
    ,速度=等级*2*1.2
    ,防御=等级*3*1.2
    ,法防=等级*8*1.2
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[6]={
    名称="天兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=等级*15*1.2
    ,气血=(等级*等级*15+2000)*1.2
    ,灵力=(等级*20+200)*1.2
    ,速度=等级*2*1.2
    ,防御=等级*3*1.2
    ,法防=等级*8*1.2
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[7]={
    名称="天兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=等级*15*1.2
    ,气血=(等级*等级*18+2000)*1.2
    ,灵力=等级*4*1.2
    ,速度=等级*7*1.2
    ,防御=等级*3*1.2
    ,法防=等级*3.8*1.2
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="天罚"
    ,模型="混沌兽"
    ,变异=true
    ,伤害=等级*11*1.2
    ,气血=(等级*等级*18+2000)*1.2
    ,灵力=等级*4*1.2
    ,速度=等级*7*1.2
    ,防御=等级*3*1.2
    ,法防=等级*3.8*1.2
    ,躲闪=等级*4*1.2
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","日月乾坤"}
  }
  return 战斗单位
end

function 战斗准备类:大闹百万天兵(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="百万天兵"
    ,模型="风伯"
    ,伤害=等级*25*1.3
    ,变异=true
    ,气血=(等级*等级*20+20000)*1.3
    ,灵力=(等级*15+200)*1.3
    ,速度=等级*7*1.3
    ,防御=等级*5*1.3
    ,法防=等级*5*1.3
    ,躲闪=等级*5*1.3
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="天兵"
    ,模型="天兵"
    ,伤害=等级*15*1.3
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*8*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","弱点击破"}}
  战斗单位[3]={
    名称="天兵"
    ,模型="天兵"
    ,伤害=等级*15*1.3
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*8*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","弱点击破"}}
  战斗单位[4]={
    名称="天兵"
    ,模型="天兵"
    ,伤害=等级*15*1.3
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*3*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}}
  战斗单位[5]={
    名称="天兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=等级*15*1.3
    ,气血=(等级*等级*15+5000)*1.3
    ,灵力=(等级*20+200)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*3*1.3
    ,法防=等级*8*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石"}
  }
  for i=6,10 do
    战斗单位[i]={
      名称="天兵"
      ,模型="天兵"
      ,变异=true
      ,伤害=等级*15*1.3
      ,气血=(等级*等级*15+5000)*1.3
      ,灵力=(等级*20+200)*1.3
      ,速度=等级*2*1.3
      ,防御=等级*3*1.3
      ,法防=等级*8*1.3
      ,躲闪=等级*4*1.3
      ,魔法=200
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级感知"}
      ,主动技能=取随机法术(3)
    }
  end
  return 战斗单位
end

function 战斗准备类:大闹巨灵神(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=等级*25*1.4
    ,变异=true
    ,气血=(等级*等级*20+50000)*1.4
    ,灵力=(等级*15+200)*1.4
    ,速度=等级*7*1.4
    ,防御=等级*5*1.4
    ,法防=等级*5*1.4
    ,躲闪=等级*5*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="斩妖"
    ,模型="巡游天神"
    ,伤害=等级*15*1.4
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.4
    ,灵力=等级*4*1.4
    ,速度=等级*3*1.4
    ,防御=等级*8*1.4
    ,法防=500
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","力劈华山","嗜血追击"}}
  战斗单位[3]={
    名称="斩妖"
    ,模型="地狱战神"
    ,伤害=等级*15*1.4
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.4
    ,灵力=等级*4*1.4
    ,速度=等级*3*1.4
    ,防御=等级*8*1.4
    ,法防=500
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","力劈华山","嗜血追击"}}
  战斗单位[4]={
    名称="天灾"
    ,模型="夜罗刹"
    ,伤害=等级*10*1.4
    ,变异=true
    ,气血=(等级*等级*15+5000)*1.4
    ,灵力=(等级*20+200)*1.4
    ,速度=等级*2*1.4
    ,防御=等级*3*1.4
    ,法防=等级*8*1.4
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石","三昧真火"}}
  战斗单位[5]={
    名称="苦难"
    ,模型="夜罗刹"
    ,变异=true
    ,伤害=等级*10*1.4
    ,气血=(等级*等级*15+5000)*1.4
    ,灵力=(等级*20+200)*1.4
    ,速度=等级*2*1.4
    ,防御=等级*3*1.4
    ,法防=等级*8*1.4
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石","三昧真火"}}
  战斗单位[6]={
    名称="天兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=等级*15*1.4
    ,气血=(等级*等级*15+5000)*1.4
    ,灵力=(等级*20+200)*1.4
    ,速度=等级*2*1.4
    ,防御=等级*3*1.4
    ,法防=等级*8*1.4
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","飞沙走石","三昧真火"}}
  战斗单位[7]={
    名称="天兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=等级*15*1.4
    ,气血=(等级*等级*18+5000)*1.4
    ,灵力=等级*4*1.4
    ,速度=等级*7*1.4
    ,防御=等级*3*1.4
    ,法防=等级*3.8*1.4
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平","天罗地网","似玉生香"}}
  战斗单位[8]={
    名称="天罚"
    ,模型="混沌兽"
    ,变异=true
    ,伤害=等级*11*1.4
    ,气血=(等级*等级*18+5000)*1.4
    ,灵力=等级*4*1.4
    ,速度=等级*7*1.4
    ,防御=等级*3*1.4
    ,法防=等级*3.8*1.4
    ,躲闪=等级*4*1.4
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","天罗地网","含情脉脉","似玉生香"}
  }
  return 战斗单位
end

function 战斗准备类:大闹镇塔之神(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="镇塔神灵"
    ,模型="护卫"
    ,伤害=等级*25*2
    ,变异=true
    ,气血=(等级*等级*20+50000)*1.7
    ,灵力=(等级*15+200)*1.7
    ,速度=等级*7*1.7
    ,防御=等级*5*1.7
    ,法防=等级*5*1.7
    ,躲闪=等级*5*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="宝塔玄火"
    ,模型="凤凰"
    ,伤害=等级*15*2
    ,变异=true
    ,气血=(等级*等级*15+10000)*1.7
    ,灵力=等级*4*1.7
    ,速度=等级*3*1.7
    ,防御=等级*8*1.7
    ,法防=500
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","连环击","鹰击","象形"}}
  战斗单位[3]={
    名称="宝塔玄火"
    ,模型="凤凰"
    ,伤害=等级*15*2
    ,变异=true
    ,气血=(等级*等级*15+10000)*1.7
    ,灵力=等级*4*1.7
    ,速度=等级*3*1.7
    ,防御=等级*8*1.7
    ,法防=500
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双","连环击","鹰击","象形"}}
  战斗单位[4]={
    名称="宝塔玄火"
    ,模型="凤凰"
    ,伤害=等级*15*2
    ,变异=true
    ,气血=(等级*等级*15+10000)*1.7
    ,灵力=(等级*20+200)*1.7
    ,速度=等级*2*1.7
    ,防御=等级*3*1.7
    ,法防=等级*8*1.7
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","靛沧海","日光华","地裂火","苍茫树"}}
  战斗单位[5]={
    名称="宝塔玄火"
    ,模型="凤凰"
    ,变异=true
    ,伤害=等级*15*2
    ,气血=(等级*等级*15+10000)*1.7
    ,灵力=(等级*20+200)*1.7
    ,速度=等级*2*1.7
    ,防御=等级*3*1.7
    ,法防=等级*8*1.7
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","裂石","断岳势","浪涌","惊涛怒","天崩地裂","翻江搅海","碎星诀"}}
  战斗单位[6]={
    名称="助火风神"
    ,模型="风伯"
    ,变异=true
    ,伤害=等级*15*2
    ,气血=(等级*等级*15+10000)*1.7
    ,灵力=(等级*20+200)*1.7
    ,速度=等级*2*1.7
    ,防御=等级*3*1.7
    ,法防=等级*8*1.7
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟","龙腾","催眠符","唧唧歪歪"}}
  战斗单位[7]={
    名称="助火风神"
    ,模型="风伯"
    ,变异=true
    ,伤害=等级*15*2
    ,气血=(等级*等级*18+10000)*1.7
    ,灵力=等级*4*1.7
    ,速度=等级*7*1.7
    ,防御=等级*3*1.7
    ,法防=等级*3.8*1.7
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平","催眠符","百万神兵","尸腐毒"}}
  战斗单位[8]={
    名称="草木神灵"
    ,模型="树怪"
    ,变异=true
    ,伤害=等级*5*2
    ,气血=(等级*等级*18+10000)*1.7
    ,灵力=等级*4*1.7
    ,速度=等级*7*1.7
    ,防御=等级*3*1.7
    ,法防=等级*3.8*1.7
    ,躲闪=等级*4*1.7
    ,魔法=200
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","日月乾坤","似玉生香","催眠符","含情脉脉"}
  }
  return 战斗单位
end

function 战斗准备类:更新(dt)
  for n, v in pairs(self.战斗盒子) do
    if self.战斗盒子[n]~=nil then self.战斗盒子[n]:更新(n) end
    if self.战斗盒子[n].结束条件 then self.战斗盒子[n]=nil end
  end
end
function 战斗准备类:数据处理(玩家id,序号,内容,参数)
  if 玩家数据[玩家id].战斗==0 or self.战斗盒子[玩家数据[玩家id].战斗]==nil then
   return 0
  else
    self.战斗盒子[玩家数据[玩家id].战斗]:数据处理(玩家id,序号,内容,参数)
  end
end

function 战斗准备类:取剑会天下随机属性1(门派,等级)
  local 随机门派 = 取随机数()
  local 返回数据 = {}
  --人物中可以添加 技能,门派,模型,附加状态,法术追加,奇经八脉.
  -- 经脉格式为 {神焰=3,XXX=3}
  -- 追加法术 附加状态格式为 {[1]={等级=等级,名称="变身"}}
  -- 法宝格式为 法宝={[1]={名称="五火神焰印",境界=16},[2]={名称="金甲仙衣",境界=9},[3]={名称="拭剑石",境界=9}}
  if 门派=="狮驼岭" or 门派=="大唐官府" or 门派=="凌波城" or 门派=="天宫" or 门派=="花果山" or 门派=="天机城" then
    if 随机门派<=15 then
      --狮驼岭门派模型
      local 角色模型 = {"杀破狼","虎头怪","巨魔王"}
      返回数据.门派="狮驼岭"
      返回数据.技能={"鹰击"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={[1]={等级=等级,名称="变身"}}
    elseif 随机门派<=30 then
      --大唐官府门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="大唐官府"
      返回数据.技能={"横扫千军","后发制人"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    --花果山门派模型
    elseif 随机门派<=45 then
      local 角色模型 = {"龙太子","神天兵","羽灵神"}
      返回数据.门派="大唐官府"
      返回数据.技能={"横扫千军"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=60 then
      --凌波城门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="凌波城"
      返回数据.技能={"浪涌"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=60 then
      --凌波城门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="大唐官府"
      返回数据.技能={"横扫千军"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    else
      --天宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="天宫"
      返回数据.技能={"天雷斩"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  elseif 门派=="龙宫" or 门派=="神木林" or 门派=="魔王寨" then
    if 随机门派<=33 then
      --龙宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="龙宫"
      返回数据.技能={"龙卷雨击","龙腾"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=66 then
      --神木林门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="神木林"
      返回数据.技能={"落叶萧萧"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    else
      --魔王寨门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="魔王寨"
      返回数据.技能={"飞砂走石"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  elseif 门派=="化生寺" or 门派=="普陀山" or 门派=="无底洞" or 门派=="阴曹地府" then
    if 随机门派<=25 then
      --化生寺门派模型
      local 角色模型 = {"偃无师","逍遥生","剑侠客"}
      返回数据.门派="化生寺"
      返回数据.技能={"推气过宫"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=50 then
      --普陀山门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭"}
      返回数据.门派="普陀山"
      返回数据.技能={"普渡众生"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=75 then
      --普陀山门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="阴曹地府"
      返回数据.技能={"阎罗令"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    else
      --无底洞门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="无底洞"
      返回数据.技能={"地涌金莲"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  elseif 门派=="盘丝洞" or 门派=="方寸山" or 门派=="五庄观" or 门派=="女儿村" then
    if 随机门派<=25 then
      --盘丝洞门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇"}
      返回数据.门派="无底洞"
      返回数据.技能={"含情脉脉"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=50 then
      --方寸山门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="方寸山"
      返回数据.技能={"定身符","失心符"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=75 then
      --五庄观门派模型
      local 角色模型 = {"龙太子","神天兵","羽灵神"}
      返回数据.门派="五庄观"
      返回数据.技能={"日月乾坤"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    else
      --女儿村门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿"}
      返回数据.门派="女儿村"
      返回数据.技能={"似玉生香","满天花雨"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  end
  return 返回数据
end

function 战斗准备类:取剑会天下随机属性(门派,等级)
  local 随机门派 = 取随机数(1,225)
  local 返回数据 = {}
  --人物中可以添加 技能,门派,模型,附加状态,法术追加,奇经八脉.
  -- 经脉格式为 {神焰=3,XXX=3}
  -- 追加法术 附加状态格式为 {[1]={等级=等级,名称="变身"}}
  -- 法宝格式为 法宝={[1]={名称="五火神焰印",境界=16},[2]={名称="金甲仙衣",境界=9},[3]={名称="拭剑石",境界=9}}
    if 随机门派<=15 then
      --狮驼岭门派模型
      local 角色模型 = {"杀破狼","虎头怪","巨魔王"}
      返回数据.门派="狮驼岭"
      返回数据.技能={"鹰击","狮搏","象形","连环击"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={化血=1,宁息=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={[1]={等级=等级,名称="变身"}}
    elseif 随机门派<=30 then
      --大唐官府门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="大唐官府"
      返回数据.技能={"横扫千军","后发制人","破釜沉舟","杀气诀"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={风刃=1,杀意=1,干将=1,破军=1,无敌=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    --凌波城门派模型
    elseif 随机门派<=45 then
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="凌波城"
      返回数据.技能={"天崩地裂","翻江搅海","碎星诀","浪涌"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={战诀=1,暴气=1,天神怒斩=1,真君显灵=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=60 then
      --天宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="天宫"
      返回数据.技能={"天雷斩","雷霆万钧","雷霆万钧","天神护体","天神护法"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={威赫=1,月桂=1,怒气=1,神律=1,画地为牢=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=75 then
      --龙宫门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭","龙太子","神天兵","羽灵神"}
      返回数据.门派="龙宫"
      返回数据.技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=90 then
      --神木林门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="神木林"
      返回数据.技能={"落叶萧萧","密润","风卷残云"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={滋养=1,风灵=1,法身=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
      elseif 随机门派<=105 then
      --魔王寨门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="魔王寨"
      返回数据.技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
      elseif 随机门派<=120 then
      --化生寺门派模型
      local 角色模型 = {"偃无师","逍遥生","剑侠客"}
      返回数据.门派="化生寺"
      返回数据.技能={"推气过宫","活血","金刚护体","金刚护法","唧唧歪歪"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={佛誉=1,佛显=1,心韧=1,舍利=1,映法=1,诸天看护=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=135 then
      --普陀山门派模型
      local 角色模型 = {"舞天姬","玄彩娥","桃夭夭"}
      返回数据.门派="普陀山"
      返回数据.技能={"普渡众生","波澜不惊","晶清诀","五行制化","灵动九天"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={普渡=1,雨润=1,法咒=1,道衍=1,秘术=1,借灵=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=150 then
      --普陀山门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="阴曹地府"
      返回数据.技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=165 then
      --无底洞门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇","杀破狼","虎头怪","巨魔王"}
      返回数据.门派="无底洞"
      返回数据.技能={"地涌金莲","夺命咒","金身舍利","摧心术","明光宝烛","同舟共济"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={金莲=1,自愈=1,化莲=1,精进=1,灵身=1,反先=1,同舟共济=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=180 then
      --盘丝洞门派模型
      local 角色模型 = {"骨精灵","狐美人","鬼潇潇"}
      返回数据.门派="盘丝洞"
      返回数据.技能={"含情脉脉","瘴气","魔音摄魂","盘丝阵","幻镜术","天罗地网"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={鼓乐=1,妖气=1,粘附=1,迷梦=1,情劫=1,脱壳=1,迷意=1,结阵=1,媚态=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=195 then
      --方寸山门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿","偃无师","逍遥生","剑侠客"}
      返回数据.门派="方寸山"
      返回数据.技能={"碎甲符","定身符","失心符","五雷咒","落雷符","分身术"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={苦缠=1,雷动=1,奔雷=1,鬼惧=1,不倦=1,化身=1,批亢=1,鬼念=1,碎甲=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=210 then
      --五庄观门派模型
      local 角色模型 = {"龙太子","神天兵","羽灵神"}
      返回数据.门派="五庄观"
      返回数据.技能={"日月乾坤","飘渺式","烟雨剑法","生命之泉"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={体恤=1,锤炼=1,神附=1,养生=1,归本=1,修心=1,混元=1,同辉=1,雨杀=1,乾坤=1,意境=1,傲视=1,陌宝=1,心随意动=1,致命=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    elseif 随机门派<=225 then
      --女儿村门派模型
      local 角色模型 = {"飞燕女","英女侠","巫蛮儿"}
      返回数据.门派="女儿村"
      返回数据.技能={"一笑倾城","满天花雨","红袖添香","雨落寒沙"}
      返回数据.模型=角色模型[取随机数(1,#角色模型)]
      返回数据.奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
      返回数据.法宝={[1]={名称="金甲仙衣",境界=9}}
      返回数据.追加法术={}
      返回数据.附加状态={}
    end
  return 返回数据
end

function 战斗准备类:取剑会天下BB技能1(属性,技能)
  local 最高属性 = {"力量",0}
  --结算出最高宠物属性
  --BB身上可以添加 主动技能 和 技能
  for n,v in pairs(属性) do
    if v>最高属性[2] then
      最高属性[1]=n
      最高属性[2]=v
    end
  end

  --如果最高属性与力量相等则为力量
  if 最高属性[2]== 属性["力量"] then
    最高属性[1]="力量"
  end
  --判断最高属性决定BB技能
  if 最高属性[1] == "力量" then
    local 高级技能 = {"高级必杀","高级再生","高级幸运","高级吸血","高级反击","高级吸血","高级反击","嗜血追击","从天而降","高级驱怪","苍鸾怒击","高级连击","高级飞行","高级感知","高级再生","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级神佑复生","高级否定信仰","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"奔雷咒","泰山压顶","水漫金山","地狱烈火","善恶有报","力劈华山","惊心一剑","剑荡四方","壁垒击破","力劈华山","死亡召唤","夜舞倾城","理直气壮","烈火","雷击","水攻","落岩","上古灵符"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(12,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end


    for n=1,#主动技能 do
      for i=1,#主动技能 do
        if 主动技能[n] == 主动技能[i] then
          数量 = 数量 + 1
          返回.主动技能[#返回.主动技能+1] = 主动技能[n]
          table.remove(主动技能,i)
          break
        end
      end
    end
    if #主动技能 - 数量 > 0 then
      for n=1,#主动技能 - 数量 do
        local jns = 取随机数(5,#主动技能)
        返回.主动技能[#返回.主动技能+1] = 主动技能[jns]
        table.remove(主动技能,jns)
      end
    end
    return 返回
  elseif 最高属性[1] == "魔力" then
    local 高级技能 = {"高级反击","高级飞行","须弥真言","高级感知","高级冥思","高级慧根","高级再生","高级幸运","高级神迹","高级永恒","高级敏捷","高级防御","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","龙魂","高级精神集中","高级否定信仰","高级雷属性吸收","高级土属性吸收","高级法术连击","高级法术暴击","高级法术波动","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"奔雷咒","泰山压顶","水漫金山","地狱烈火","善恶有报","力劈华山","惊心一剑","剑荡四方","壁垒击破","力劈华山","死亡召唤","夜舞倾城","理直气壮","烈火","雷击","水攻","落岩","上古灵符"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(12,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end


    for n=1,#主动技能 do
      for i=1,#主动技能 do
        if 主动技能[n] == 主动技能[i] then
          数量 = 数量 + 1
          返回.主动技能[#返回.主动技能+1] = 主动技能[n]
          table.remove(主动技能,i)
          break
        end
      end
    end
    if #主动技能 - 数量 > 0 then
      for n=1,#主动技能 - 数量 do
        local jns = 取随机数(5,#主动技能)
        返回.主动技能[#返回.主动技能+1] = 主动技能[jns]
        table.remove(主动技能,jns)
      end
    end
    return 返回
  else
    local 高级技能 = {"高级毒","高级反击","高级飞行","高级感知","高级冥思","高级慧根","高级再生","高级幸运","高级神迹","高级永恒","高级敏捷","高级防御","高级驱鬼","高级鬼魂术","高级神佑复生","高级精神集中","高级否定信仰","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"奔雷咒","泰山压顶","水漫金山","地狱烈火","善恶有报","力劈华山","惊心一剑","剑荡四方","壁垒击破","力劈华山","死亡召唤","夜舞倾城","理直气壮","烈火","雷击","水攻","落岩","上古灵符"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(12,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end


    for n=1,#主动技能 do
      for i=1,#主动技能 do
        if 主动技能[n] == 主动技能[i] then
          数量 = 数量 + 1
          返回.主动技能[#返回.主动技能+1] = 主动技能[n]
          table.remove(主动技能,i)
          break
        end
      end
    end
    if #主动技能 - 数量 > 0 then
      for n=1,#主动技能 - 数量 do
        local jns = 取随机数(5,#主动技能)
        返回.主动技能[#返回.主动技能+1] = 主动技能[jns]
        table.remove(主动技能,jns)
      end
    end

    return 返回
  end
end

function 战斗准备类:取剑会天下BB技能(属性,技能)
  local 最高属性 = {"力量",0}
  --结算出最高宠物属性
  --BB身上可以添加 主动技能 和 技能
  for n,v in pairs(属性) do
    if v>最高属性[2] then
      最高属性[1]=n
      最高属性[2]=v
    end
  end

  --如果最高属性与力量相等则为力量
  if 最高属性[2]== 属性["力量"] then
    最高属性[1]="力量"
  end
  --判断最高属性决定BB技能
  if 最高属性[1] == "力量" then
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反击","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  elseif 最高属性[1] == "魔力" then
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反击","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  else
    local 高级技能 = {"从天而降","嗜血追击","须弥真言","灵能激发","高级反击","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
    local 主动技能 = {"壁垒击破","法术防御","奔雷咒","泰山压顶","水漫金山","地狱烈火","八凶法阵","月光","天降灵葫","上古灵符","叱咤风云","力劈华山","剑荡四方","死亡召唤","善恶有报","壁垒击破","惊心一剑"}
    local 数量 = 0
    local 返回 = {技能={},主动技能={}}
    for n=1,#技能 do
      for i=1,#高级技能 do
        if 技能[n] == 高级技能[i] then
          数量 = 数量 + 1
          返回.技能[#返回.技能+1] = 技能[n]
          table.remove(高级技能,i)
          break
        end
      end
    end
    if #技能 - 数量 > 0 then
      for n=1,#技能 - 数量 do
        local jns = 取随机数(1,#高级技能)
        返回.技能[#返回.技能+1] = 高级技能[jns]
        table.remove(高级技能,jns)
      end
    end
    返回.主动技能 = {主动技能[取随机数(1,#主动技能)]}
    return 返回
  end
end

function 战斗准备类:取剑会天下属性(假人属性)
  local 假人随机阵法 = {"普通","天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.1)
        ,气血=math.floor(假人属性[i].气血*1.1)
        ,灵力=math.floor(假人属性[i].灵力*1.1)
        ,速度=math.floor(假人属性[i].速度*1.1)
        ,防御=math.floor(假人属性[i].防御*1.1)
        ,法防=math.floor(假人属性[i].法防*1.1)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能={}
        ,愤怒=150
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(175,假人属性[i].参战等级)[2]
      战斗单位[i]={
        名称=模型名称
        ,模型=模型名称
        ,伤害=math.floor(假人属性[i].伤害*0.9)
        ,气血=math.floor(假人属性[i].气血*0.9)
        ,灵力=math.floor(假人属性[i].灵力*0.9)
        ,速度=math.floor(假人属性[i].速度*0.9)
        ,防御=math.floor(假人属性[i].防御*0.9)
        ,法防=math.floor(假人属性[i].法防*0.9)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:蚩尤大战(任务id,玩家id)
    local 等级=玩家数据[玩家id].角色.数据.等级
    local 战斗单位={}
    战斗单位.阵法="虎翼阵"  --阵法添加方式
        战斗单位[1]={
            名称="蚩尤",
            模型="进阶蚩尤",
            伤害=6000,
            气血=500000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级必杀","高级法术连击","高级法术暴击","高级感知","高级驱鬼"},
            主动技能={"武神怒击","刀光剑影","毁灭之光"}
        }
        战斗单位[2]={
            名称="厚土",
            模型="进阶持国巡守",
            伤害=6000,
            气血=300000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级感知","高级再生","高级驱鬼"},
            主动技能={"金刚护体","金刚护法","晶清诀","罗汉金钟","圣灵之甲","河东狮吼","唧唧歪歪"}
        }
        战斗单位[3]={
            名称="搻兹",
            模型="进阶毗舍童子",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级敏捷","高级吸血","高级必杀","高级感知","高级驱鬼"},
            主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
        }
        战斗单位[4]={
            名称="奢比尸",
            模型="进阶蜃气妖",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级敏捷","高级吸血","高级必杀","高级感知","高级驱鬼"},
            主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
        }
         战斗单位[5]={
            名称="玄冥",
            模型="进阶真陀护法",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级法术连击","高级法术暴击","高级感知","高级驱鬼"},
            主动技能={"三昧真火","地狱烈火","飞砂走石","龙卷雨击","泰山压顶","奔雷咒","水漫金山"}
        }
          战斗单位[6]={
            名称="强良",
            模型="进阶巨力神猿",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级敏捷","高级吸血","高级必杀","高级感知","高级驱鬼"},
            主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
        }
         战斗单位[7]={
            名称="祝融",
            模型="进阶凤凰",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级法术连击","高级法术暴击","高级感知","高级驱鬼"},
            主动技能={"三昧真火","地狱烈火","飞砂走石","龙卷雨击","泰山压顶","奔雷咒","水漫金山"}
        }
        战斗单位[8]={
            名称="共工",
            模型="进阶蛟龙",
            伤害=6000,
            气血=100000,
            灵力=8000,
            速度=2000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级法术连击","高级法术暴击","高级感知","高级驱鬼"},
            主动技能={"三昧真火","地狱烈火","飞砂走石","龙卷雨击","泰山压顶","奔雷咒","水漫金山"}
        }
        战斗单位[9]={
            名称="蓐收",
            模型="进阶律法女娲",
            伤害=6000,
            气血=300000,
            灵力=8000,
            速度=3000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=25,  --怪物修炼添加方式
            防御修炼=25,  --怪物修炼添加方式
            法术修炼=25,  --怪物修炼添加方式
            抗法修炼=25,  --怪物修炼添加方式
            不可封印=true,
            技能={"高级敏捷","高级吸血","高级必杀","高级感知","高级驱鬼"},
            主动技能={"阎罗令","天罗地网","夺命咒","五行制化","雨落寒沙"}
        }
        战斗单位[10]={
            名称="天昊",
            模型="进阶吸血鬼",
            伤害=6000,
            气血=300000,
            灵力=8000,
            速度=3000,
            防御=2000,
            愤怒=9999,
            法防=2000,
            躲闪=2000,
            魔法=9999999999,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级敏捷","高级吸血","高级必杀","高级感知","高级驱鬼"},
            主动技能={"碎甲符","瘴气","一笑倾城","飞花摘叶","碎玉弄影"}
        }
    return 战斗单位
end

function 战斗准备类:桃园蚩尤(任务id,玩家id)
    local 等级=玩家数据[玩家id].角色.数据.等级
    local 战斗单位={}
    战斗单位.阵法="虎翼阵"  --阵法添加方式
        战斗单位[1]={
            名称="蚩尤",
            模型="进阶蚩尤",
            伤害=1000,
            气血=100000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击","鬼魂术"},
            主动技能={"武神怒击","刀光剑影","毁灭之光"}
        }
        战斗单位[2]={
            名称="厚土",
            模型="进阶持国巡守",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机法术新(18)
        }
        战斗单位[3]={
            名称="搻兹",
            模型="进阶毗舍童子",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机物理法术(13)
        }
        战斗单位[4]={
            名称="奢比尸",
            模型="进阶蜃气妖",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机法术新(18)
        }
         战斗单位[5]={
            名称="玄冥",
            模型="进阶真陀护法",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机物理法术(13)
        }
          战斗单位[6]={
            名称="强良",
            模型="进阶巨力神猿",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机物理法术(13)
        }
         战斗单位[7]={
            名称="祝融",
            模型="进阶凤凰",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机法术新(18)
        }
        战斗单位[8]={
            名称="共工",
            模型="进阶蛟龙",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机法术新(18)
        }
        战斗单位[9]={
            名称="蓐收",
            模型="进阶律法女娲",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机物理法术(13)
        }
        战斗单位[10]={
            名称="天昊",
            模型="进阶吸血鬼",
            伤害=1000,
            气血=80000,
            灵力=5000,
            速度=100,
            防御=100,
            愤怒=999,
            法防=100,
            躲闪=100,
            魔法=100000,
            等级=175,
            饰品=true,
            攻击修炼=20,  --怪物修炼添加方式
            防御修炼=20,  --怪物修炼添加方式
            法术修炼=20,  --怪物修炼添加方式
            抗法修炼=20,  --怪物修炼添加方式
            技能={"高级必杀","高级法术连击","高级法术暴击"},
            主动技能=取随机物理法术(13)
        }
    return 战斗单位
end

function 战斗准备类:桃园野猪(任务id,玩家id)
    local 战斗单位={}
    --战斗单位.阵法="天覆阵"  --阵法添加方式
        战斗单位[1]={
            名称="大野猪",
            模型="野猪",
            伤害=50,
            气血=600,
            灵力=50,
            速度=50,
            防御=1,
            愤怒=999,
            法防=1,
            躲闪=999,
            魔法=999,
            等级=5,
            技能={"高级必杀","高级法术暴击"},
            主动技能={"横扫千军","烈火"}
        }
          for n=2,3 do
          战斗单位[n]={
          名称="野猪"
          ,模型="野猪"
          ,伤害=50
          ,气血=500
          ,灵力=50
          ,速度=1
          ,防御=1
          ,法防=1
          ,愤怒=999
          ,躲闪=999
          ,魔法=999
          ,等级=5
          ,技能={"高级必杀","高级法术暴击"}
          ,主动技能={"烈火"}
          }
          end
    return 战斗单位
end

function 战斗准备类:商人的鬼魂(任务id,玩家id)
    local 战斗单位={}
    local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
    战斗单位.阵法="天覆阵"  --阵法添加方式
        战斗单位[1]={
            名称="商人的鬼魂",
            模型="野鬼",
            伤害=等级*15,
            气血=等级*100,
            灵力=等级*8,
            速度=等级*5,
            防御=10,
            愤怒=99999,
            法防=10,
            躲闪=等级*5,
            魔法=99999,
            等级=等级,
            技能={"高级毒","必杀","连击","高级鬼魂术","理直气壮"},
            主动技能={}
        }
        战斗单位[2]={
            名称="虾兵喽罗",
            模型="虾兵",
            伤害=等级*10,
            气血=等级*50,
            灵力=等级*8,
            速度=等级*5,
            防御=5,
            愤怒=99999,
            法防=5,
            躲闪=等级*5,
            魔法=99999,
            等级=等级,
            技能={"高级必杀"},
            主动技能={"壁垒击破","惊心一剑"}
        }
        战斗单位[3]={
            名称="蟹将喽罗",
            模型="蟹将",
            伤害=等级*15,
            气血=等级*50,
            灵力=等级*5,
            速度=等级,
            防御=5,
            愤怒=99999,
            法防=5,
            躲闪=等级*5,
            魔法=99999,
            等级=等级,
            技能={"感知"},
            主动技能={"水攻","靛沧海"}
        }
        战斗单位[4]={
            名称="巨蛙喽罗",
            模型="巨蛙",
            伤害=等级*15,
            气血=等级*25,
            灵力=等级*5,
            速度=等级,
            防御=5,
            愤怒=99999,
            法防=5,
            躲闪=等级*5,
            魔法=99999,
            等级=等级,
            技能={"法术暴击"},
            主动技能={"水攻","推气过宫"}
        }
       战斗单位[5]={
            名称="大海龟喽罗",
            模型="大海龟",
            伤害=等级*8,
            气血=等级*25,
            灵力=等级*8,
            速度=等级,
            防御=5,
            愤怒=99999,
            法防=5,
            躲闪=等级*5,
            魔法=99999,
            等级=等级,
            技能={"高级再生"},
            主动技能={"金刚护体","金刚护法","牛刀小试"}
        }
    return 战斗单位
end

function 战斗准备类:妖风战斗(任务id,玩家id)
 local 战斗单位={}
  战斗单位[1]={
  名称="妖风",
  模型="吸血鬼",
  伤害=600,
  气血=10000,
  灵力=10,
  速度=999,
  防御=200,
  愤怒=999,
  法防=10,
  躲闪=999,
  魔法=999,
  变异=true,
  等级=25,
  技能={"高级毒","高级必杀","高级连击","理直气壮","苍鸾怒击","嗜血追击","高级吸血"},
  主动技能={}
  }
 return 战斗单位
 end

function 战斗准备类:酒肉和尚真(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="酒肉和尚",
  模型="雨师",
  伤害=450,
  气血=20000,
  灵力=400,
  速度=250,
  防御=150,
  愤怒=999,
  法防=100,
  躲闪=999,
  魔法=9999,
  变异=true,
  等级=40,
  技能={"高级感知"},
  主动技能={"龙卷雨击","龙腾","二龙戏珠"}
  }
   for n=2,5 do
战斗单位[n]={
名称="酒肉和尚帮凶"
,模型="雨师"
,伤害=450
,气血=10000
,灵力=350
,速度=200
,防御=150
,法防=50
,躲闪=999
,魔法=9999
,等级=30
,技能={"高级感知"}
,主动技能=取随机法术1(26)
}
end
 return 战斗单位
 end


function 战斗准备类:真刘洪(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="刘洪",
  模型="护卫",
  伤害=800,
  气血=50000,
  灵力=650,
  速度=400,
  防御=500,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  变异=false,
  等级=65,
  门派="大唐官府",
  技能={"高级必杀","高级感知"},
  主动技能={"横扫千军","后发制人","破釜沉舟","斩龙诀"}
  }
  战斗单位[2]={
  名称="李彪",
  模型="强盗",
  伤害=1000,
  气血=100000,
  灵力=650,
  速度=500,
  防御=500,
  愤怒=999,
  法防=500,
  躲闪=999,
  魔法=9999,
  变异=false,
  不可封印=true,
  等级=65,
  门派="阴曹地府",
  技能={"高级必杀","高级感知","高级驱鬼"},
  主动技能={"阎罗令","判官令","百爪狂杀"}
  }
 return 战斗单位
 end

   function 战斗准备类:日常商人鬼魂(任务id,玩家id,假人属性)
local 战斗单位={}
    战斗单位.阵法="天覆阵"  --阵法添加方式
        战斗单位[1]={
      名称="商人的鬼魂",
      模型="野鬼",
      伤害=4000,
      气血=100000,
      灵力=1000,
      速度=800,
      防御=800,
      愤怒=9999,
      法防=100,
      躲闪=999,
      魔法=9999,
      等级=120,
      不可封印=true,
      技能={"高级毒","高级必杀","高级连击","理直气壮","高级感知","高级鬼魂术"},
      主动技能={}
        }
        战斗单位[2]={
            名称="虾兵喽罗",
            模型="虾兵",
      伤害=4000,
      气血=100000,
      灵力=1000,
      速度=800,
      防御=800,
      愤怒=9999,
      法防=100,
      躲闪=999,
      魔法=9999,
      等级=120,
            技能={"高级必杀","高级感知"},
            主动技能={"壁垒击破","惊心一剑","破釜沉舟","横扫千军","高级鬼魂术"}
        }
        战斗单位[3]={
            名称="蟹将喽罗",
            模型="蟹将",
      伤害=1000,
      气血=100000,
      灵力=3000,
      速度=800,
      防御=800,
      愤怒=9999,
      法防=100,
      躲闪=999,
      魔法=9999,
      等级=120,
            技能={"高级法术连击","高级法术暴击","高级感知","高级鬼魂术"},
            主动技能={"水漫金山","靛沧海"}
        }
        战斗单位[4]={
            名称="巨蛙喽罗",
            模型="巨蛙",
      伤害=1000,
      气血=100000,
      灵力=3000,
      速度=1000,
      防御=800,
      愤怒=9999,
      法防=100,
      躲闪=999,
      魔法=9999,
      等级=120,
            不可封印=true,
            技能={"高级法术连击","高级感知"},
            主动技能={"水攻","雷击","落岩","罗汉金钟","推气过宫","高级鬼魂术"}
        }
       战斗单位[5]={
            名称="大海龟喽罗",
            模型="大海龟",
      伤害=1000,
      气血=100000,
      灵力=3000,
      速度=1000,
      防御=800,
      愤怒=9999,
      法防=100,
      躲闪=999,
      魔法=9999,
      等级=120,
            技能={"高级再生","高级感知"},
            主动技能={"金刚护体","金刚护法","唧唧歪歪","高级鬼魂术"}
        }
    return 战斗单位
end

function 战斗准备类:刻晴全服奖励(任务id,玩家id)
 local 战斗单位={}
 战斗单位.阵法="云垂阵"
  战斗单位[1]={
  名称="刻晴",
  模型="进阶蚩尤",
  伤害=300,
  气血=500000,
  灵力=300,
  速度=9999,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=109,
  不可封印=true,
  技能={},
  主动技能={"武神怒击","刀光剑影","毁灭之光"}
  }

    战斗单位[2]={
  名称="程咬金",
  模型="程咬金",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级毒","高级必杀","高级连击","理直气壮","苍鸾怒击","嗜血追击","高级吸血"},
  主动技能={"横扫千军","后发制人"}
  }

    战斗单位[3]={
  名称="空度禅师",
  模型="空度禅师",
  伤害=500,
  气血=100000,
  灵力=3000,
  速度=500,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级法术连击","高级法术暴击"},
  主动技能={"唧唧歪歪"}
  }

    战斗单位[4]={
  名称="东海龙王",
  模型="东海龙王",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级法术连击","高级法术暴击"},
  主动技能={"龙卷雨击","龙腾","二龙戏珠"},
  动技能={}
  }

    战斗单位[5]={
  名称="二郎神",
  模型="二郎神",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级法术连击","高级法术暴击"},
  主动技能={"天崩地裂","翻江搅海","浪涌"},
  动技能={}
  }

    战斗单位[6]={
  名称="镇元大仙",
  模型="镇元大仙",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级必杀","高级连击","理直气壮","苍鸾怒击","嗜血追击","高级吸血"},
  主动技能={"烟雨剑法","飘渺式"}
  }

      战斗单位[7]={
  名称="牛魔王",
  模型="牛魔王",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级法术连击","高级法术暴击"},
  主动技能={"剑荡四方","摇头摆尾"}
  }

      战斗单位[8]={
  名称="大大王",
  模型="大大王",
  伤害=500,
  气血=100000,
  灵力=500,
  速度=700,
  防御=2000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=89,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃妖风=1},
  技能={"高级感知","高级必杀","高级连击","理直气壮","苍鸾怒击","嗜血追击","高级吸血"},
  主动技能={"鹰击","狮搏","连环击"}
  }

 return 战斗单位
 end

function 战斗准备类:妖风战斗日常(任务id,玩家id)
 local 战斗单位={}
 local 等级=109
  战斗单位[1]={
  名称="妖风",
  模型="吸血鬼",
  伤害=4000,
  气血=100000,
  灵力=1000,
  速度=5000,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=999,
  魔法=999999,
  变异=true,
  等级=109,
  不可封印=true,
  饰品=true,
  奇经八脉={风刃=1,杀意=1,干将=1,破军=1,无敌=1,目空=1,勇念=1},
  技能={"高级强力","高级必杀","高级防御","高级感知","高级招架","高级反击","高级吸血","高级驱鬼"},
  主动技能={"杀气诀","横扫千军","破釜沉舟","破血狂攻","壁垒击破","命归术"}
  }
 return 战斗单位
 end

 function 战斗准备类:白鹿精日常(任务id,玩家id)
 local 战斗单位={}
  战斗单位[1]={
  名称="白鹿精",
  模型="赌徒",
  伤害=3000,
  气血=100000,
  灵力=3000,
  速度=3000,
  防御=3000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  变异=true,
  不可封印=true,
  等级=119,
  奇经八脉={威赫=1,电芒=1,月桂=1,怒气=1,神律=1,雷波=1,画地为牢=1},
  技能={"高级强力","高级必杀","高级防御","高级感知","高级招架","高级反击","高级吸血","高级驱鬼"},
  主动技能={"天神护体","天雷斩","雷霆万钧","弱点击破","金刚镯"}
  }
    战斗单位[2]={
  名称="玉面狐狸",
  模型="狐狸精",
  伤害=3000,
  气血=50000,
  灵力=3000,
  速度=700,
  防御=3000,
  愤怒=999,
  法防=3000,
  躲闪=999,
  魔法=999999,
  不可封印=true,
  等级=119,
  奇经八脉={鼓乐=1,粘附=1,迷梦=1,情劫=1,脱壳=1,迷意=1,结阵=1,媚态=1},
  技能={"高级法术连击","高级法术暴击","高级驱鬼","高级感知"},
  主动技能={"命归术","含情脉脉","瘴气","魔音摄魂","盘丝阵","幻镜术","天罗地网"}
  }
 for n=3,10 do
战斗单位[n]={
名称="花妖喽罗"
,模型="花妖"
,伤害=3000
,气血=30000
,灵力=2000
,速度=1000
,防御=3000
,法防=2000
,躲闪=9999
,魔法=9999
,愤怒=9999
,等级=119
,技能={"高级法术连击","高级法术暴击","高级驱鬼","高级感知"}
,主动技能={"落叶萧萧","碎甲符","定身符","失心符"}
 }
   end
 return 战斗单位
 end

  function 战斗准备类:酒肉日常(任务id,玩家id)
 local 战斗单位={}
 local 等级=120
  战斗单位[1]={
  名称="酒肉和尚",
  模型="雨师",
  伤害=5000,
  气血=100000,
  灵力=3000,
  速度=1000,
  防御=5000,
  愤怒=999,
  法防=5000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  不可封印=true,
  等级=120,
  奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1},
  技能={"高级法术暴击","高级法术连击","高级感知","高级驱鬼"},
  主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }
   for n=2,5 do
战斗单位[n]={
名称="酒肉和尚帮凶 "
,模型="雨师"
,伤害=5000
,气血=100000
,灵力=2500
,速度=1000
,防御=5000
,法防=5000
,躲闪=5000
,魔法=99999
,等级=120
,奇经八脉={佛誉=1,佛显=1,心韧=1,舍利=1,映法=1,诸天看护=1}
,技能={"高级法术暴击","高级法术连击","高级感知","高级驱鬼"}
,主动技能={"推气过宫","金刚护体","金刚护法","唧唧歪歪"}
}
end
 return 战斗单位
 end

  function 战斗准备类:执法天兵日常(任务id,玩家id)
 local 战斗单位={}
  战斗单位[1]={
  名称="执法天兵",
  模型="天兵",
  伤害=5000,
  气血=150000,
  灵力=5000,
  速度=1500,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  不可封印=true,
  等级=120,
  奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1},
  技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"},
  主动技能={"天雷斩","雷霆万钧"}
  }
    战斗单位[2]={
  名称="守门天兵",
  模型="天兵",
  伤害=5000,
  气血=150000,
  灵力=3000,
  速度=1500,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  不可封印=true,
  等级=120,
  奇经八脉={风刃=1,杀意=1,念心=1,干将=1,勇念=1,破空=1,无敌=1,破军=1},
  技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"},
  主动技能={"破釜沉舟","横扫千军"}
  }
    战斗单位[3]={
  名称=" 守门天兵 ",
  模型="天兵",
  伤害=5000,
  气血=150000,
  灵力=3000,
  速度=1500,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  不可封印=true,
  等级=120,
  奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1},
  技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"},
  主动技能={"鹰击","狮搏"}
  }
      战斗单位[4]={
  名称="守门天将",
  模型="天将",
  伤害=5000,
  气血=150000,
  灵力=3000,
  速度=2000,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  等级=120,
  技能={},
  主动技能={"天神护体","天神护法","碎玉弄影","飞符炼魂","一笑倾城"}
  }
      战斗单位[5]={
  名称="守门天将 ",
  模型="天将",
  伤害=5000,
  气血=150000,
  灵力=5000,
  速度=2000,
  防御=1000,
  愤怒=999,
  法防=1000,
  躲闪=5000,
  魔法=99999,
  变异=true,
  等级=120,
  技能={},
  主动技能={"推气过宫","罗汉金钟","圣灵之甲","诸天看护"}
  }
 return 战斗单位
 end

function 战斗准备类:天兵飞剑(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="天兵飞剑",
  模型="天兵",
  伤害=1600,
  气血=100000,
  灵力=100,
  速度=800,
  防御=800,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="凌波城",
  技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"},
  主动技能={"翻江搅海","天崩地裂","真君显灵"}
  }
  战斗单位[2]={
  名称="蛟龙喽啰",
  模型="蛟龙",
  伤害=1500,
  气血=50000,
  灵力=1300,
  速度=500,
  防御=100,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="龙宫",
  技能={"高级法术连击","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"水漫金山","龙卷雨击","龙腾"}
  }

for n=3,5 do
战斗单位[n]={
名称="天兵喽罗"
,模型="天兵"
,伤害=1500
,气血=50000
,灵力=100
,速度=500
,防御=500
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="天宫"
,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
,主动技能={"天雷斩"}
}
end
 return 战斗单位
 end


function 战斗准备类:假刘洪(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="假刘洪",
  模型="护卫",
  伤害=1000,
  气血=50000,
  灵力=650,
  速度=500,
  防御=50,
  愤怒=999,
  法防=500,
  躲闪=999,
  魔法=9999,
  变异=true,
  等级=55,
  门派="大唐官府",
  技能={"高级必杀","高级感知"},
  主动技能={"横扫千军","后发制人"}
  }
   for n=2,10 do
战斗单位[n]={
名称="衙役"
,模型="护卫"
,伤害=800
,气血=30000
,灵力=500
,速度=500
,防御=50
,法防=500
,躲闪=999
,愤怒=999
,魔法=9999
,等级=55
,门派="大唐官府"
,技能={"高级必杀","高级感知"}
,主动技能={"横扫千军","后发制人"}
}
end
 return 战斗单位
 end


  function 战斗准备类:蟹将军(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="蟹将军",
  模型="蟹将",
  伤害=1000,
  气血=50000,
  灵力=1000,
  速度=500,
  防御=500,
  愤怒=999,
  法防=1,
  躲闪=999,
  魔法=9999,
  变异=true,
  等级=65,
  不可封印=true,
  门派="龙宫",
  技能={"高级法术连击","高级法术暴击","高级法术波动","高级感知"},
  主动技能={"龙卷雨击","水漫金山","罗汉金钟","剑荡四方"}
  }
for n=2,3 do
战斗单位[n]={
名称="虾兵喽罗"
,模型="虾兵"
,伤害=800
,气血=30000
,灵力=100
,速度=500
,防御=500
,法防=100
,躲闪=999
,愤怒=999
,魔法=9999
,等级=55
,不可封印=true
,门派="龙宫"
,技能={"高级必杀","高级反击","嗜血追击","高级连击","苍鸾怒击"}
,追加法术={[1]={等级=175,名称="横扫千军"}}
,主动技能={}
}
end
for n=4,5 do
战斗单位[n]={
名称="蟹将喽罗"
,模型="蟹将"
,伤害=500
,气血=30000
,灵力=600
,速度=500
,防御=100
,法防=100
,躲闪=999
,愤怒=9999
,魔法=9999
,等级=55
,门派="方寸山"
,技能={}
,主动技能={"失心符","落雷符","落魄符"}
}
end
 return 战斗单位
 end

  function 战斗准备类:幽冥鬼(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="幽冥鬼",
  模型="巡游天神",
  伤害=1000,
  气血=100000,
  灵力=800,
  速度=400,
  防御=500,
  愤怒=999,
  法防=100,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=55,
  不可封印=true,
  门派="阴曹地府",
  技能={"高级鬼魂术","高级吸血","高级感知"},
  主动技能={"判官令","阎罗令","尸腐毒","百爪狂杀"}
  }
   for n=2,5 do
战斗单位[n]={
名称="僵尸喽罗"
,模型="僵尸"
,伤害=1000
,气血=50000
,灵力=1
,速度=300
,防御=1
,法防=1
,躲闪=999
,愤怒=9999
,魔法=9999
,等级=50
,技能={"鬼魂术","高级反击","高级反击","高级吸血"}
,主动技能={"弱点击破","破血狂攻","尸腐毒"}
}
end
 return 战斗单位
 end

function 战斗准备类:白琉璃(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="白琉璃",
  模型="星灵仙子",
  伤害=300,
  气血=50000,
  灵力=300,
  速度=200,
  防御=999,
  愤怒=999,
  法防=999,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=35,
  技能={},
  主动技能={"地涌金莲","推气过宫","生命之泉","普渡众生"}
  }
   for n=2,5 do
      战斗单位[n]={
名称="狐狸精喽罗"
,模型="狐狸精"
,伤害=500
,气血=5000
,灵力=250
,速度=100
,防御=100
,法防=100
,躲闪=999
,魔法=9999
,等级=35
,技能={}
,主动技能=取随机法术1(26)
}
end
 return 战斗单位
 end

function 战斗准备类:执法天兵(任务id,玩家id)
 local 战斗单位={}
  战斗单位[1]={
  名称="执法天兵",
  模型="天兵",
  伤害=500,
  气血=10000,
  灵力=500,
  速度=200,
  防御=150,
  愤怒=9999,
  法防=1,
  躲闪=999,
  门派="天宫",
  魔法=9999,
  等级=35,
  技能={},
  主动技能={"天雷斩","天诛地灭","镇妖"}
  }
    战斗单位[2]={
  名称="守门天兵",
  模型="天兵",
  伤害=300,
  气血=5000,
  灵力=100,
  速度=150,
  防御=150,
  愤怒=999,
  门派="大唐官府",
  法防=100,
  躲闪=999,
  魔法=9999,
  愤怒=9999,
  等级=35,
  技能={},
  主动技能={"破血狂攻","破碎无双","横扫千军","后发制人"}
  }
    战斗单位[3]={
  名称=" 守门天兵 ",
  模型="天兵",
  伤害=300,
  气血=5000,
  灵力=100,
  速度=150,
  防御=150,
  愤怒=999,
  门派="狮驼岭",
  法防=100,
  躲闪=999,
  魔法=9999,
  等级=35,
  技能={},
  主动技能={"鹰击","连环击"}
  }
      战斗单位[4]={
  名称="守门天将",
  模型="天将",
  伤害=300,
  气血=3000,
  灵力=300,
  速度=150,
  防御=100,
  愤怒=999,
  门派="龙宫",
  法防=100,
  躲闪=999,
  魔法=9999,
  等级=35,
  技能={},
  主动技能={"龙腾","龙卷雨击"}
  }
      战斗单位[5]={
  名称="守门天将",
  模型="天将",
  伤害=300,
  气血=8000,
  灵力=250,
  速度=150,
  防御=100,
  愤怒=999,
  门派="化生寺",
  法防=100,
  躲闪=999,
  魔法=9999,
  等级=35,
  技能={},
  主动技能={"唧唧歪歪","推气过宫","达摩护体"}
  }
 return 战斗单位
 end


 function 战斗准备类:酒肉和尚假(任务id,玩家id)
 local 战斗单位={}
  战斗单位[1]={
  名称="酒肉和尚",
  模型="雨师",
  伤害=500,
  气血=5000,
  灵力=400,
  速度=100,
  防御=100,
  愤怒=999,
  法防=100,
  躲闪=999,
  门派="龙宫",
  魔法=999,
  等级=35,
  技能={"高级魔之心","高级法术波动","高级法术暴击","高级法术连击"},
  主动技能={"龙卷雨击","龙腾","神龙摆尾"}
  }
    战斗单位[2]={
  名称="赌徒喽罗",
  模型="赌徒",
  伤害=700,
  气血=3000,
  灵力=100,
  速度=999,
  防御=100,
  愤怒=999,
  门派="大唐官府",
  法防=50,
  躲闪=999,
  魔法=999,
  等级=35,
  技能={"高级毒","高级必杀","高级连击","理直气壮","苍鸾怒击","嗜血追击","高级吸血"},
  主动技能={"后发制人","反间之计","横扫千军"}
  }
    战斗单位[3]={
  名称="赌徒喽罗",
  模型="赌徒",
  伤害=500,
  气血=3000,
  灵力=300,
  速度=999,
  防御=100,
  愤怒=999,
  门派="化生寺",
  法防=50,
  躲闪=999,
  魔法=999,
  等级=35,
  技能={"高级法术连击","高级法术暴击"},
  主动技能={"唧唧歪歪","推气过宫","金刚护体","金刚护法"}
  }
 return 战斗单位
 end


function 战斗准备类:白鹿精(任务id,玩家id)
 local 战斗单位={}
  战斗单位.阵法="龙飞阵"  --阵法添加方式
  战斗单位[1]={
  名称="白鹿精",
  模型="赌徒",
  伤害=600,
  气血=5000,
  灵力=100,
  速度=100,
  防御=100,
  愤怒=99999,
  法防=50,
  躲闪=100,
  魔法=99999,
  变异=true,
  等级=30,
  技能={"高级必杀","高级吸血"},
  主动技能={"反间之计","横扫千军","后发制人"}
  }
    战斗单位[2]={
  名称="玉面狐狸",
  模型="狐狸精",
  伤害=100,
  气血=2000,
  灵力=200,
  速度=50,
  防御=200,
  愤怒=99999,
  法防=1,
  躲闪=100,
  魔法=99999,
  等级=30,
  技能={"高级法术连击","高级法术暴击"},
  主动技能={"天罗地网","含情脉脉","勾魂"}
  }
 for n=3,10 do
战斗单位[n]={
名称="花妖喽罗",
模型="花妖",
伤害=100,
气血=1000,
灵力=150,
速度=999,
防御=10,
愤怒=99999,
法防=10,
躲闪=100,
魔法=99999,
等级=30,
技能={},
主动技能={"落岩","推气过宫"}
}
   end
 return 战斗单位
 end


 function 战斗准备类:木桩伤害测试(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*0.5)
        ,气血=math.floor(假人属性[i].气血*0.5)
        ,灵力=math.floor(假人属性[i].灵力*0.5)
        ,速度=math.floor(假人属性[i].速度*0.5)
        ,防御=math.floor(假人属性[i].防御*0.5)
        ,法防=math.floor(假人属性[i].法防*0.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="刻晴的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*0.5)
        ,气血=math.floor(假人属性[i].气血*0.5)
        ,灵力=math.floor(假人属性[i].灵力*0.5)
        ,速度=math.floor(假人属性[i].速度*0.5)
        ,防御=math.floor(假人属性[i].防御*0.5)
        ,法防=math.floor(假人属性[i].法防*0.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end


function 战斗准备类:木桩伤害测试2(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
 for n=1,1 do
 战斗单位[n]={
名称="剑侠客"..n
,模型="剑侠客"
,伤害=800
,气血=(等级-5+等级*0.2)*235+等级*6.5*6
,灵力=600
,速度=1
,防御=等级*6
,法防=100
,躲闪=1
,魔法=10101
,等级=1
,愤怒=99999999
,技能={"神佑复生"}
,主动技能={"明光宝烛"}
}
end
 return 战斗单位
 end

function 战斗准备类:押镖遇怪(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
 for n=1,2 do
      战斗单位[n]={
名称="强盗"
,模型="强盗"
,伤害=等级*5
,气血=等级*10
,灵力=等级*5
,速度=100
,防御=50
,法防=200
,躲闪=200
,魔法=1
,等级=等级
,技能={"高级连击","高级必杀"}
,主动技能={}
}
   end
 return 战斗单位
 end

function 战斗准备类:取赵云信息(任务id,玩家id)
  local 等级=120
  local 模型="龙太子"
  local 武器造型={武器="弑皇",级别=160}
  local 战斗单位={}
  local 难度系数 = 1
  战斗单位[1]={
    名称="赵云",
    模型=模型,
    角色=true,
    染色方案=3,
    染色组={[1]=3,[2]=6,[3]=6,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*20+1000*难度系数,
    气血=等级*1000*难度系数,
    灵力=等级*20+500*难度系数,
    速度=50.3*难度系数,
    防御=等级*30*难度系数,
    法防=等级*30*难度系数,
    躲闪=等级*50*难度系数,
    魔法=200000,
    等级=等级,
    不可封印=true,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),
    法术修炼=math.floor(取人物修炼等级上限(等级)),
    抗法修炼=math.floor(取人物修炼等级上限(等级)),
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*16+500*难度系数,
      气血=等级*1000*难度系数,
      灵力=等级*16+300*难度系数,
      速度=等级*20.3*难度系数,
      防御=等级*30*难度系数,
      法防=等级*30*难度系数,
      躲闪=等级*50*难度系数,
      魔法=200000,
      等级=等级,
      攻击修炼=math.floor(取人物修炼等级上限(等级)),
      防御修炼=math.floor(取人物修炼等级上限(等级)),
      法术修炼=math.floor(取人物修炼等级上限(等级)),
      抗法修炼=math.floor(取人物修炼等级上限(等级)),
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取关羽信息(任务id,玩家id)
  local 等级=120
  local 模型="巨魔王"
  local 武器造型={武器="裂天",级别=160}
  local 战斗单位={}
  local 难度系数 = 1
  战斗单位[1]={
    名称="关羽",
    模型=模型,
    角色=true,
    染色方案=5,
    染色组={[1]=5,[2]=5,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*20+1000*难度系数,
    气血=等级*1000*难度系数,
    灵力=等级*20+500*难度系数,
    速度=50.3*难度系数,
    防御=等级*30*难度系数,
    法防=等级*30*难度系数,
    躲闪=等级*50*难度系数,
    魔法=200000,
    等级=等级,
    不可封印=true,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),
    法术修炼=math.floor(取人物修炼等级上限(等级)),
    抗法修炼=math.floor(取人物修炼等级上限(等级)),
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*16+500*难度系数,
      气血=等级*1000*难度系数,
      灵力=等级*16+300*难度系数,
      速度=等级*20.3*难度系数,
      防御=等级*30*难度系数,
      法防=等级*30*难度系数,
      躲闪=等级*50*难度系数,
      魔法=200000,
      等级=等级,
      攻击修炼=math.floor(取人物修炼等级上限(等级)),
      防御修炼=math.floor(取人物修炼等级上限(等级)),
      法术修炼=math.floor(取人物修炼等级上限(等级)),
      抗法修炼=math.floor(取人物修炼等级上限(等级)),
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取张飞信息(任务id,玩家id)
  local 等级=120
  local 模型="龙太子"
  local 武器造型={武器="飞龙在天",级别=120}
  local 战斗单位={}
  local 难度系数 = 1
  战斗单位[1]={
    名称="张飞",
    模型=模型,
    角色=true,
    染色方案=3,
    染色组={[1]=3,[2]=6,[3]=6,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*20+1000*难度系数,
    气血=等级*1000*难度系数,
    灵力=等级*20+500*难度系数,
    速度=50.3*难度系数,
    防御=等级*30*难度系数,
    法防=等级*30*难度系数,
    躲闪=等级*50*难度系数,
    魔法=200000,
    等级=等级,
    不可封印=true,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),
    法术修炼=math.floor(取人物修炼等级上限(等级)),
    抗法修炼=math.floor(取人物修炼等级上限(等级)),
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*16+500*难度系数,
      气血=等级*1000*难度系数,
      灵力=等级*16+300*难度系数,
      速度=等级*20.3*难度系数,
      防御=等级*30*难度系数,
      法防=等级*30*难度系数,
      躲闪=等级*50*难度系数,
      魔法=200000,
      等级=等级,
      攻击修炼=math.floor(取人物修炼等级上限(等级)),
      防御修炼=math.floor(取人物修炼等级上限(等级)),
      法术修炼=math.floor(取人物修炼等级上限(等级)),
      抗法修炼=math.floor(取人物修炼等级上限(等级)),
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取黄忠信息(任务id,玩家id)
  local 等级=120
  local 模型="羽灵神"
  local 武器造型={武器="若木",级别=160}
  local 战斗单位={}
  local 难度系数 = 1
  战斗单位[1]={
    名称="黄忠",
    模型=模型,
    角色=true,
    染色方案=1,
    染色组={[1]=2,[2]=5,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*20+1000*难度系数,
    气血=等级*1000*难度系数,
    灵力=等级*20+500*难度系数,
    速度=50.3*难度系数,
    防御=等级*30*难度系数,
    法防=等级*30*难度系数,
    躲闪=等级*50*难度系数,
    魔法=200000,
    等级=等级,
    不可封印=true,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),
    法术修炼=math.floor(取人物修炼等级上限(等级)),
    抗法修炼=math.floor(取人物修炼等级上限(等级)),
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*16+500*难度系数,
      气血=等级*1000*难度系数,
      灵力=等级*16+300*难度系数,
      速度=等级*20.3*难度系数,
      防御=等级*30*难度系数,
      法防=等级*30*难度系数,
      躲闪=等级*5*难度系数,
      魔法=200000,
      等级=等级,
      攻击修炼=math.floor(取人物修炼等级上限(等级)),
      防御修炼=math.floor(取人物修炼等级上限(等级)),
      法术修炼=math.floor(取人物修炼等级上限(等级)),
      抗法修炼=math.floor(取人物修炼等级上限(等级)),
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取马超信息(任务id,玩家id)
  local 等级=120
  local 模型="逍遥生"
  local 武器造型={武器="擒龙",级别=160}
  local 战斗单位={}
  local 难度系数 = 1
  战斗单位[1]={
    名称="马超",
    模型=模型,
    角色=true,
    染色方案=1,
    染色组={[1]=5,[2]=3,[3]=5,序号=3710},
    武器=取武器数据(武器造型.武器,武器造型.级别),
    武器染色组={[1]=1,[2]=0},
    武器染色方案=20113,
    变异=false,
    显示饰品=false,
    伤害=等级*10+1000*难度系数,
    气血=等级*400*难度系数,
    灵力=等级*10+500*难度系数,
    速度=5.3*难度系数,
    防御=等级*6*难度系数,
    法防=等级*6*难度系数,
    躲闪=等级*5*难度系数,
    魔法=200000,
    等级=等级,
    不可封印=true,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),
    法术修炼=math.floor(取人物修炼等级上限(等级)),
    抗法修炼=math.floor(取人物修炼等级上限(等级)),
    技能={"魔之心","法术连击"},
    主动技能=取随机法术(5)
  }
  local 模型名称范围={"亲兵"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,10)]
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={
      名称="上将亲兵",
      模型=模型,
      角色=true,
      武器=取武器数据(武器造型.武器,武器造型.级别),
      伤害=等级*8+500*难度系数,
      气血=等级*300*难度系数,
      灵力=等级*8+300*难度系数,
      速度=等级*2.3*难度系数,
      防御=等级*6*难度系数,
      法防=等级*6*难度系数,
      躲闪=等级*5*难度系数,
      魔法=200000,
      等级=等级,
      攻击修炼=math.floor(取人物修炼等级上限(等级)),
      防御修炼=math.floor(取人物修炼等级上限(等级)),
      法术修炼=math.floor(取人物修炼等级上限(等级)),
      抗法修炼=math.floor(取人物修炼等级上限(等级)),
      技能={},
      主动技能=技能随机
    }
  end
  return 战斗单位
end

function 战斗准备类:取毛贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="毛贼",模型="强盗",伤害=等级*8,气血=等级*50,灵力=等级*4,速度=等级*1.5,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)), 法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 模型=取随机怪(1,65)
  战斗单位[2]={名称="凶兽",模型="老虎",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级必杀","高级连击"},主动技能={}}
  战斗单位[3]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[5]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[6]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="打手",模型="赌徒",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取销赃贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="销赃贼",模型="吸血鬼",伤害=等级*9,气血=等级*50,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,    攻击修炼=math.floor(取人物修炼等级上限(等级)),防御修炼=math.floor(取人物修炼等级上限(等级)),
  法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼喽罗",模型="山贼",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[3]={名称="飞贼喽罗",模型="山贼",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="凶鬼",模型="牛头",伤害=等级*5,气血=等级*20,灵力=等级*6,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={"水攻","烈火","落岩","雷击"}}
  战斗单位[5]={名称="凶兽",模型="老虎",变异=true,伤害=等级*10,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*0.5,法防=等级*3.2,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级连击","高级必杀"},主动技能={}}
  战斗单位[6]={名称="飞贼喽罗",模型="山贼",伤害=等级*8,气血=20*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[7]={名称="飞贼喽罗",模型="山贼",伤害=等级*8,气血=20*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[8]={名称="飞贼喽罗",模型="山贼",伤害=等级*8,气血=20*等级,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end
function 战斗准备类:取宝贼信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="宝贼",模型="夜罗刹",伤害=等级*10,气血=等级*50,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼部将",模型="吸血鬼",伤害=等级*9,气血=等级*50,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="凶兽",模型="噬天虎",伤害=等级*10,变异=true,气血=等级*20,灵力=等级*6,速度=等级*2,防御=等级*0.5,法防=等级*3.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[4]={名称="飞贼部将",模型="地狱战神",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="飞贼部将",模型="吸血鬼",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[6]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="飞贼护卫",模型="天将",伤害=等级*8,气血=等级*20,灵力=等级*4,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取盗贼首领信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="盗贼首领",模型="雨师",伤害=等级*11,气血=等级*50,灵力=等级*5,速度=等级*2,防御=等级*4,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[4]={名称="飞贼骨干",模型="夜罗刹",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[5]={名称="神秘刺客",模型="夜罗刹",伤害=等级*11,气血=等级*20,灵力=等级*6,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  战斗单位[6]={名称="异兽",模型="兔子怪",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="异兽",模型="蛟龙",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="异兽",模型="古代瑞兽",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="异兽",模型="凤凰",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="异兽",模型="古代瑞兽",伤害=等级*9,气血=等级*20,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取皇宫贼王信息(任务id,玩家id)
  local 战斗单位={}
  local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称="贼王",模型="狂豹人形",伤害=等级*12,气血=等级*等级*2,灵力=等级*7,速度=等级*3,防御=等级*6,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)), 法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),主动技能=取随机法术(5)}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[2]={名称="盗贼头领",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*6,速度=等级*2,防御=等级*4,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[3]={名称="盗贼头领",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*6,速度=等级*2,防御=等级*4,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[4]={名称="幽灵护卫",模型="幽灵",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={"阎罗令","尸腐毒","判官令"}}
  战斗单位[5]={名称="幽灵护卫",模型="幽灵",伤害=等级*9,气血=等级*等级,灵力=等级*5,速度=等级*2,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={"阎罗令","尸腐毒","判官令"}}
  战斗单位[6]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[7]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[8]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[9]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  战斗单位[10]={名称="死士",模型="夜罗刹",伤害=等级*10,气血=等级*等级,灵力=等级*5,速度=等级*3,防御=等级*3,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end
function 战斗准备类:取江湖大盗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称="江湖骗子",模型="护卫",伤害=等级*6,气血=等级*30,灵力=等级*4,角色=true,速度=等级*1.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[2]={名称="恍然",模型="狂豹人形",伤害=等级*5,气血=等级*20,灵力=等级*4,速度=等级*1,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[3]={名称="蛊惑",模型="幽灵",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  战斗单位[4]={名称="色诱",模型="夜罗刹",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={"水攻","落岩","雷击","烈火"}}
  战斗单位[5]={名称="难辨",模型="龙龟",伤害=等级*6,气血=等级*20,灵力=等级*4,速度=等级*2.5,防御=等级*1,法防=等级*0.5,躲闪=等级*2,魔法=200000,等级=等级,技能={"高级感知"},主动技能={}}
  return 战斗单位
end

function 战斗准备类:取门派乾坤袋信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,伤害=等级*12,气血=qz(等级*等级),灵力=等级*5,速度=等级*3,防御=等级*6,法防=等级*1.2,躲闪=100,魔法=200000,等级=等级,技能={"高级感知"},主动技能=取随机法术(3)}
  return 战斗单位
end

function 战斗准备类:取60级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
    名称="万年老妖"
    ,模型=任务数据[任务id].模型
    ,伤害=1200
    ,气血=等级*等级*8
    ,灵力=等级*15
    ,变异=true
    ,速度=等级*5
    ,防御=等级*10
    ,法防=等级*4
    ,躲闪=等级*5
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,技能={"神佑复生"}
    ,主动技能=取随机法术(5)
  }
  战斗单位[2]={
    名称="千年老妖"
    ,模型="进阶黑山老妖"
    ,伤害=1200
    ,气血=等级*等级*5
    ,灵力=等级*4
    ,变异=true
    ,速度=等级*2.5
    ,防御=等级*6
    ,法防=等级*3
    ,躲闪=等级*4
    ,魔法=200000
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,等级=等级
    ,不可封印=true
    ,技能={"神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  战斗单位[3]={
    名称="千年老妖"
    ,模型="进阶黑山老妖"
    ,伤害=500
    ,变异=true
    ,气血=等级*等级*5
    ,灵力=等级*12
    ,速度=等级*2.5
    ,防御=等级*3
    ,法防=等级*4
    ,躲闪=等级*4
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,技能={"神佑复生"}
    ,主动技能={"三昧真火","龙卷雨击","飞砂走石"}
  }
  战斗单位[4]={
    名称="老妖亲卫"
    ,模型="黑山老妖"
    ,伤害=等级*5
    ,变异=true
    ,气血=等级*等级*5
    ,灵力=等级*4
    ,速度=等级*8
    ,防御=等级*3
    ,法防=等级*3
    ,躲闪=等级*4
    ,魔法=200000
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,等级=等级
    ,不可封印=true
    ,技能={"神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[5]={
    名称="老妖亲卫"
    ,模型="黑山老妖"
    ,伤害=等级*5
    ,变异=true
    ,气血=等级*等级*5
    ,灵力=等级*4
    ,速度=等级*8
    ,防御=等级*3
    ,法防=等级*3
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,躲闪=等级*4
    ,魔法=200000
    ,等级=等级
    ,技能={"神佑复生"}
    ,主动技能={"失心符","定身符","反间之计"}
  }
  战斗单位[6]={
    名称="老妖亲兵"
    ,模型="进阶锦毛貂精"
    ,伤害=等级*5
    ,变异=true
    ,气血=等级*等级*5
    ,灵力=等级*12
    ,速度=300
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,防御=等级*3
    ,法防=等级*4
    ,躲闪=等级*4
    ,魔法=200000
    ,等级=等级
    ,技能={"神佑复生"}
    ,主动技能={"龙卷雨击","飞砂走石"}
  }
  战斗单位[7]={
    名称="老妖亲兵"
    ,模型="进阶千年蛇魅"
    ,伤害=600
    ,变异=true
    ,气血=等级*等级*10
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*15
    ,法防=等级*4
    ,躲闪=等级*4
    ,魔法=200000
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,等级=等级
    ,愤怒=99999
    ,技能={"神佑复生"}
    ,主动技能={"推气过宫","晶清诀","罗汉金钟","圣灵之甲","四海升平"}
  }
  战斗单位[8]={
    名称="老妖亲兵"
    ,模型="进阶碧水夜叉"
    ,伤害=1000
    ,变异=true
    ,气血=等级*等级*5
    ,灵力=等级*4
    ,速度=等级*4
    ,防御=等级*8
    ,法防=等级*3
    ,躲闪=等级*4
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,魔法=200000
    ,等级=等级
    ,技能={"神佑复生"}
    ,主动技能={"横扫千军","天雷斩","浪涌"}
  }
  return 战斗单位
end

function 战斗准备类:取100级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
   local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
    名称="万年鬼王"
    ,模型=任务数据[任务id].模型
    ,伤害=2500
    ,变异=true
    ,气血=等级*等级*20+100000
    ,灵力=等级*15+200
    ,速度=等级*7
    ,防御=等级*5
    ,法防=等级*8
    ,躲闪=等级*5
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="千年妖王"
    ,模型="鬼将"
    ,伤害=2200
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*8
    ,法防=等级*5
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="千年妖王"
    ,模型="鬼将"
    ,伤害=2200
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*8
    ,法防=等级*5
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,不可封印=true
    ,技能={"高级感知"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="鬼王侍女"
    ,模型="进阶幽萤娃娃"
    ,伤害=等级*5
    ,变异=true
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="鬼王侍女"
    ,模型="进阶幽萤娃娃"
    ,变异=true
    ,伤害=等级*5
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="鬼族先锋"
    ,模型="进阶画魂"
    ,变异=true
    ,伤害=等级*5
    ,气血=等级*等级*15+50000
    ,灵力=等级*20+200
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="鬼族先锋"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*18+50000
    ,灵力=等级*4
    ,速度=等级*7
    ,防御=等级*3
    ,法防=等级*3.8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计","晶清诀","四海升平"}}
  战斗单位[8]={
    名称="鬼族先锋"
    ,模型="进阶阴阳伞"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*18+50000
    ,灵力=等级*4
    ,速度=等级*7
    ,防御=等级*3
    ,法防=等级*3.8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="鬼族圣贤"
    ,模型="进阶幽灵"
    ,变异=true
    ,伤害=600
    ,气血=等级*等级*25+100000
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*8
    ,法防=等级*8
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"推气过宫","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="鬼族先锋"
    ,模型="进阶吸血鬼"
    ,变异=true
    ,伤害=2200
    ,气血=等级*等级*15+50000
    ,灵力=等级*4
    ,速度=等级*4
    ,防御=等级*5
    ,法防=等级*3.5
    ,躲闪=等级*4
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,愤怒=99999
    ,技能={"高级感知"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取150级世界BOSS信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称="罗刹王"
    ,模型=任务数据[任务id].模型
    ,变异=true
    ,伤害=3500
    ,气血=300000
    ,灵力=等级*8
    ,速度=等级*6
    ,防御=等级*6
    ,法防=等级*10
    ,躲闪=等级*8
    ,魔法=等级*500*10
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,技能={"高级感知","高级驱鬼"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="大力神王"
    ,模型="进阶大力金刚"
    ,变异=true
    ,伤害=3300
    ,气血=300000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=等级*3
    ,躲闪=等级*4
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知","高级驱鬼","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="大力神王"
    ,模型="进阶大力金刚"
    ,变异=true
    ,伤害=3300
    ,气血=300000
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=等级*3
    ,躲闪=等级*4
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级感知","高级驱鬼","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="狂暴法神"
    ,模型="进阶炎魔神"
    ,变异=true
    ,伤害=等级*5
    ,气血=300000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="狂暴法神"
    ,模型="进阶炎魔神"
    ,变异=true
    ,伤害=等级*5
    ,气血=300000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="玄法无边"
    ,模型="进阶混沌兽"
    ,变异=true
    ,伤害=等级*5
    ,气血=300000
    ,灵力=等级*15+300
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*6
    ,躲闪=等级*4
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="神封无量"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600
    ,气血=100000
    ,灵力=等级*4
    ,速度=800
    ,防御=等级*3
    ,不可封印=true
    ,法防=等级*3.8
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[8]={
    名称="神封无量"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600
    ,气血=100000
    ,灵力=等级*4
    ,速度=800
    ,不可封印=true
    ,防御=等级*3
    ,法防=等级*3.8
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="长生无界"
    ,模型="进阶龙龟"
    ,变异=true
    ,伤害=600
    ,气血=100000
    ,灵力=等级*4
    ,速度=等级*2.5
    ,防御=等级*6
    ,法防=等级*6
    ,躲闪=等级*4
    ,愤怒=99999
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"推气过宫","金刚护法","罗汉金钟","唧唧歪歪"}}
  战斗单位[10]={
    名称="力破乾坤"
    ,模型="进阶蜃气妖"
    ,变异=true
    ,伤害=2300
    ,气血=300000
    ,灵力=等级*4
    ,速度=等级*4
    ,防御=等级*5
    ,法防=等级*3.5
    ,躲闪=等级*4
    ,不可封印=true
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,愤怒=99999
    ,技能={"高级驱鬼","高级感知","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取门派示威信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
    ,伤害=等级*10
    ,角色=true
    ,气血=qz(等级*50)
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*6
    ,法防=等级*1.2
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术[任务数据[任务id].门派]
  }
  local 模型=取随机怪(30,等级)
  战斗单位[2]={
    名称="帮凶"
    ,模型=模型[2]
    ,伤害=等级*8
    ,角色=true
    ,气血=等级*30
    ,灵力=等级*4
    ,速度=等级*3
    ,防御=等级*5
    ,法防=等级*3.8
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
  return 战斗单位
end
function 战斗准备类:取门派支援信息(任务id,玩家id)
  --local 任务id1=玩家数据[玩家id].角色:取任务(111)
  local 战斗单位={}
  local 模型范围={"人","魔","仙"}
  if 玩家数据[玩家id].角色.数据.种族=="人" then
    模型范围={"魔","仙"}
  elseif 玩家数据[玩家id].角色.数据.种族=="魔" then
    模型范围={"人","仙"}
  elseif 玩家数据[玩家id].角色.数据.种族=="仙" then
    模型范围={"魔","人"}
  end
  模型范围=模型范围[取随机数(1,2)]
  local 模型=""
  if 模型范围=="人" then
    模型=Q_随机模型[取随机数(1,5)]
  elseif 模型范围=="仙" then
    模型=Q_随机模型[取随机数(6,10)]
  elseif 模型范围=="魔" then
    模型=Q_随机模型[取随机数(11,15)]
  end
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
    名称="敌人"
    ,模型=模型
    ,伤害=0
    ,角色=true
    ,气血=qz(等级*60)
    ,灵力=等级*4
    ,速度=0
    ,防御=等级*4
    ,法防=等级*1.5
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,技能={"高级感知"}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,不可封印=true
    ,主动技能={}
  }
  return 战斗单位
end
function 战斗准备类:取门派闯关信息(任务id,玩家id)
  local 任务id1=玩家数据[玩家id].角色:取任务(107)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,武器=取武器数据(Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].武器.名称,120)
    ,伤害=等级*5
    ,角色=true
    ,气血=等级*等级
    ,灵力=等级*4
    ,速度=等级*2
    ,防御=等级*3
    ,法防=等级*0.5
    ,躲闪=100
    ,魔法=20000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术1[Q_门派编号[任务数据[任务id].序列]]
  }
  local 数量=6+(15-#任务数据[任务id1].闯关序列)
  if 数量>10 then 数量=10 end
  for n=2,数量 do
    战斗单位[n]={
      名称=Q_门派编号[任务数据[任务id].序列].."弟子"
      ,模型=Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].弟子[取随机数(1,#Q_闯关数据[Q_门派编号[任务数据[任务id].序列]].弟子)]
      ,伤害=等级*4
      ,气血=等级*30
      ,灵力=等级*3
      ,速度=等级*1
      ,防御=等级*1
      ,法防=等级*0.3
      ,躲闪=100
      ,魔法=20000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级感知"}
      ,主动技能=Q_门派法术1[Q_门派编号[任务数据[任务id].序列]]
    }
  end
  return 战斗单位
end

function 战斗准备类:取幼儿园信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=0
  local 模型=取随机怪(135,145)
  模型=模型[2]
  for n=1,1 do
  战斗单位[n]={
    名称=模型.."宝宝"
    ,模型=模型
    ,伤害=100
    ,气血=5000
    ,灵力=等级*4
    ,速度=0
    ,防御=等级*3
    ,法防=等级*3
    ,躲闪=0
    ,变异=true
    ,魔法=200000
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={}
  }
  end
  return 战斗单位
end

function 战斗准备类:取幼儿园信息1(任务id,玩家id)
  local 战斗单位={}
  local 等级=0
  local 模型=取随机怪(155,175)
  模型=模型[2]
  for n=1,1 do
  战斗单位[n]={
    名称=模型.."宝宝"
    ,模型=模型
    ,伤害=100
    ,气血=5000
    ,灵力=等级*4
    ,速度=0
    ,防御=等级*3
    ,法防=等级*3
    ,躲闪=0
    ,变异=true
    ,魔法=200000
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={}
  }
  end
  return 战斗单位
end

function 战斗准备类:随机神兽(任务id,玩家id)
  local 战斗单位={}
  local 等级=0
  local 模型范围={"超级神龙","超级孔雀","超级灵狐","超级麒麟","超级大鹏","超级赤焰兽","超级白泽","超级灵鹿","超级大象","超级金猴","超级大熊猫","超级泡泡","超级神兔","超级神虎","超级神牛","超级海豚","超级人参娃娃","超级青鸾","超级腾蛇"}--"宠物口粮",
  local 模型=模型范围[取随机数(1,#模型范围)]
  for n=1,1 do
  战斗单位[n]={
     名称=模型
    ,模型=模型
    ,伤害=100
    ,气血=10000
    ,灵力=等级*4
    ,速度=10000
    ,防御=等级*3
    ,法防=等级*3
    ,躲闪=0
    ,门派="神兽"
    ,变异=false
    ,魔法=200000
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={}
  }
  end
  return 战斗单位
end

function 战斗准备类:取封妖任务信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=任务数据[任务id].等级-5
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    ,伤害=等级*10
    ,气血=等级*等级*1.5
    ,灵力=等级*4
    ,速度=等级*2
    ,防御=等级*2
    ,法防=等级*0.5
    ,躲闪=等级*4
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
 local 数量=取队伍人数(玩家id)
 数量=数量+3
 local 等级=任务数据[任务id].等级-10
  for n=1,数量 do
    local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
    战斗单位[n+1]={
      名称=模型[2].."喽罗"
      ,模型=模型[2]
      ,伤害=等级*7
      ,气血=等级*等级
      ,灵力=等级*4
      ,速度=等级*1.5
      ,防御=等级*1.5
      ,法防=等级*0.5
      ,躲闪=等级*2
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级感知"}
      ,主动技能=取随机法术(2)
    }
  end
  战斗单位[#战斗单位].变异=true
  战斗单位[#战斗单位].名称="变异"..战斗单位[#战斗单位].模型
  战斗单位[#战斗单位].主动技能={"失心符"}
  战斗单位[#战斗单位].伤害=1
  战斗单位[#战斗单位].法防=等级*0.5
  战斗单位[#战斗单位].速度=等级
  战斗单位[#战斗单位].气血=战斗单位[#战斗单位].气血*10
  return 战斗单位
end
function 战斗准备类:取官职巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
      战斗单位[n]={
名称="突厥奸细"
,模型="强盗"
,伤害=等级*6
,气血=等级*15
,灵力=等级*4
,速度=等级*1
,防御=等级*0.5
,法防=10
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 return 战斗单位
 end
function 战斗准备类:取门派巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取青龙巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取玄武巡逻信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取官职流氓信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
      战斗单位[n]={
名称="流氓"
,模型="赌徒"
,伤害=等级*6
,气血=等级*30
,灵力=等级*4
,速度=等级*1.5
,防御=等级*0.5
,法防=10
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称="流氓同伙"
 return 战斗单位
 end
function 战斗准备类:取三界悬赏令信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 local 数量=2+取队伍人数(玩家id)
 for n=1,8 do
 local 模型=取随机怪(1,120)
战斗单位[n]={
名称="帮凶"
,模型=模型[2]
,伤害=等级*20
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*4
,防御=等级*6
,法防=等级*0.5
,躲闪=等级*8
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(4)
}
end
 战斗单位[1]={
名称="通缉犯"
,模型="强盗"
,伤害=等级*20
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*4
,防御=等级*6
,法防=等级*0.5
,躲闪=等级*8
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 return 战斗单位
 end

function 战斗准备类:取游泳水妖信息(任务id,玩家id)
 local 战斗单位={}
 local 模型范围={"蟹将","虾兵","大海龟","海毛虫","巨蛙","海星","章鱼","小龙女","蛟龙","龟丞相"}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 local 数量=2+取队伍人数(玩家id)
 for n=1,数量 do
      local 模型=模型范围[取随机数(1,#模型范围)]
      战斗单位[n]={
名称="捣乱的水妖"
,模型=模型
,伤害=等级*10
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*0.8
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息1(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
      local 随机技能="高级必杀"
      local 模型="鬼将"
      if 取随机数()<=50 then
         随机技能="高级连击"
         模型="幽灵"
         end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*7*伤害加成
,气血=等级*20*血量加成
,灵力=等级*4*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={随机技能}
,主动技能={}
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息2(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
      local 随机技能={"三昧真火","烈火"}
      local 模型="炎魔神"
      local 被动技能={"高级法术暴击"}
      if 取随机数()<=20 then
        随机技能={"龙卷雨击","龙吟"}
        模型="混沌兽"
        被动技能={"高级法术连击"}
      elseif 取随机数()<=50 then
        随机技能={"唧唧歪歪","落雷符"}
        模型="灵符女娲"
        被动技能={"高级法术波动"}
      elseif 取随机数()<=70 then
       随机技能={"水攻","落岩","雷击","烈火"}
       被动技能={"高级法术波动"}
        end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*7*伤害加成
,气血=等级*20*血量加成
,灵力=等级*4*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能=被动技能
,主动技能=随机技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息3(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=8
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
      战斗单位[n]={
名称="劫匪"
,模型="雾中仙"
,伤害=等级*8*伤害加成
,气血=等级*20*血量加成
,灵力=等级*4*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级隐身"}
,主动技能={}
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息4(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=8
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
   local 模型="曼珠沙华"
   local 主动技能=取随机法术(3)
   if 数量>4 then
      模型="修罗傀儡妖"
      主动技能={"烟雨剑法"}
     end
      战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*8*伤害加成
,气血=等级*20*血量加成
,灵力=等级*4*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级鬼魂术"}
,主动技能=主动技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息5(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=3
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
   local 模型="蜃气妖"
   local 主动技能={"横扫千军"}
   if n==2 then
      模型="长眉灵猴"
      主动技能={"龙卷雨击"}
   elseif  n==3 then
      模型="狂豹人形"
      主动技能={"烟雨剑法"}
     end
   战斗单位[n]={
名称="劫匪"
,模型=模型
,伤害=等级*12*伤害加成
,气血=等级*20*血量加成
,灵力=等级*7*灵力加成
,速度=等级*2.5*速度加成
,防御=等级*12.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=主动技能
}
   end
 return 战斗单位
 end
function 战斗准备类:取镖王信息6(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=10
 local 难度=任务数据[任务id].难度
 local 血量加成=1
 local 伤害加成=1
 local 灵力加成=1
 local 防御加成=1
 local 速度加成=1
 local 法防加成=1
 if 难度=="高级" then
     血量加成=1.1
     伤害加成=1.1
     灵力加成=1.1
     防御加成=1.1
     速度加成=1.1
     法防加成=1.1
  elseif 难度=="珍贵" then
    血量加成=1.2
    伤害加成=1.2
    灵力加成=1.2
    防御加成=1.2
    速度加成=1.2
    法防加成=1.2
  end
 for n=1,数量 do
   local 模型=取随机怪(40,120)
      战斗单位[n]={
名称="劫匪"
,模型=模型[2]
,伤害=等级*8*伤害加成
,气血=等级*20*血量加成
,灵力=等级*4*灵力加成
,速度=等级*1.5*速度加成
,防御=等级*0.8*防御加成
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 return 战斗单位
 end
function 战斗准备类:取妖魔鬼怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 技能={"鬼魂术"}
 if 任务数据[任务id].名称=="妖魔" then
     技能={"神佑复生"}
 	 end
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*8
,气血=等级*30
,灵力=等级*4
,速度=等级*3
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,技能=技能
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,主动技能=取随机法术(5)
}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
 for n=1,7 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称=模型[2].."喽罗"
,模型=模型[2]
,伤害=等级*7
,气血=等级*等级*0.65+(等级*20)
,灵力=等级*4.5
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*2
,魔法=200000
,等级=等级
,技能=技能
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,主动技能=取随机法术(5)
}
 	 end
 return 战斗单位
 end

function 战斗准备类:取副本三妖信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型="地狱战神"
,伤害=等级*9
,气血=等级*50
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3.7
,躲闪=100
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 等级=等级-5
  战斗单位[2]={
 名称="妖怪守卫"
,模型="兔子怪"
,伤害=等级*10
,气血=等级*10
,灵力=等级*4
,速度=等级*2.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级连击"}
,主动技能={}
}
 战斗单位[3]={
 名称="妖怪守卫"
,模型="兔子怪"
,伤害=等级*10
,气血=等级*10
,灵力=等级*4
,速度=等级*2.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级连击"}
,主动技能={}
}
  战斗单位[4]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
  战斗单位[5]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
战斗单位[6]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 战斗单位[7]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 战斗单位[8]={
 名称="妖怪士兵"
,模型="牛头"
,伤害=等级*7
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
  return 战斗单位
 end

function 战斗准备类:取副本国王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称="乌鸡国王"
,模型="大力金刚"
,伤害=等级*15
,气血=等级*100
,灵力=等级*10
,速度=等级*4
,防御=等级*3
,法防=等级*0.5
,躲闪=100
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
 等级=等级
  战斗单位[2]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   战斗单位[3]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   战斗单位[4]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[5]={
 名称="侍从"
,模型="蛤蟆精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[6]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[7]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[8]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[10]={
 名称="侍女"
,模型="狐狸精"
,伤害=等级*10
,气血=等级*50
,灵力=等级*10
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

function 战斗准备类:取副本芭蕉妖怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 for n=1,8 do
      战斗单位[n]={
名称="伙伴木妖"
,模型="树怪"
,伤害=等级*5
,气血=等级*10
,灵力=等级*4
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
   end
战斗单位[1].名称="芭蕉木妖"
战斗单位[1].变异=true
 return 战斗单位
 end
function 战斗准备类:取迷宫小怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 技能={}
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*6
,气血=等级*10
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,技能=技能
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,主动技能=取随机法术(3)
}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=取队伍人数(玩家id)*2+1
 if 数量>10 then 数量=10 end
 for n=1,数量 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称="迷宫小怪"
,模型=模型[2]
,伤害=等级*5
,气血=等级*10
,灵力=等级*4
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,技能=技能
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,主动技能=取随机法术(2)
}
   end
 return 战斗单位
 end
function 战斗准备类:取副本鬼祟小怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 for n=1,5 do
      local 模型=取随机怪(10,20)
      战斗单位[n]={
名称="鬼祟小怪"
,模型=模型[2]
,伤害=等级*5
,气血=等级*50
,灵力=等级*4
,速度=等级*1
,防御=等级*0.8
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={}
}
   end
 战斗单位[1].模型=任务数据[任务id].模型
 return 战斗单位
 end

function 战斗准备类:自动抓鬼(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+10
 local 血量加成=2
 local 法伤减少=1
 local 物伤减少=1
 local 躲避减少=0
  战斗单位[1]={
名称="僵尸色鬼"
,模型="僵尸"
,伤害=等级*8
,气血=(等级*等级)*血量加成
,灵力=等级*5
,速度=等级*2
,防御=等级*1
,法防=等级*0.5
,躲闪=等级*4
,躲避减少=躲避减少
,物伤减少=物伤减少
,法伤减少=法伤减少
,魔法=200000
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 local 数量=取随机数(5,8)
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+2
 for n=1,数量 do
      local 模型=取随机怪(0,95)
      战斗单位[n+1]={
名称=模型[2].."恶鬼"
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.25--等级*等级*0.65+(等级*20)
,灵力=等级*4
,速度=等级*1
,防御=等级*1.5
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
   end
 return 战斗单位
 end

 function 战斗准备类:自动官职(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
      战斗单位[n]={
名称="突厥奸细"
,模型="强盗"
,伤害=等级*6
,气血=等级*15
,灵力=等级*4
,速度=等级*1
,防御=等级*0.5
,法防=10
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 return 战斗单位
 end
function 战斗准备类:自动门派(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
 for n=1,2 do
    local 模型=取随机怪(1,等级)
      战斗单位[n]={
名称="捣乱的"..模型[2]
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.65
,灵力=等级*1
,速度=等级*1.5
,防御=等级*4
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
   end
 战斗单位[2].名称=战斗单位[2].模型.."帮凶"
 return 战斗单位
end

function 战斗准备类:取捉鬼任务信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家id)+10
 local 血量加成=1
 local 法伤减少=1
 local 物伤减少=1
 local 躲避减少=0
 if 任务数据[任务id].模型=="马面" then
      法伤减少=0.35
    elseif 任务数据[任务id].模型=="牛头" then
      物伤减少=0.35
    elseif 任务数据[任务id].模型=="野鬼" then
      物伤减少=0.2
      法伤减少=0.2
      血量加成=0.5
    elseif 任务数据[任务id].模型=="骷髅怪" then
      躲避减少=50
      血量加成=0.7
    elseif 任务数据[任务id].模型=="僵尸" then
 	    血量加成=2
 	 end
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*8
,气血=(等级*等级)*血量加成
,灵力=等级*5
,速度=等级*2
,防御=等级*2
,法防=等级*0.5
,躲闪=等级*4
,躲避减少=躲避减少
,物伤减少=物伤减少
,法伤减少=法伤减少
,魔法=200000
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 local 数量=取随机数(5,8)
 local 等级=取队伍平均等级(玩家id)+2
 for n=1,数量 do
      local 模型=取随机怪(任务数据[任务id].等级,任务数据[任务id].等级)
      战斗单位[n+1]={
名称=模型[2].."恶鬼"
,模型=模型[2]
,伤害=等级*5
,气血=等级*等级*0.25--等级*等级*0.65+(等级*20)
,灵力=等级*4
,速度=等级*1
,防御=等级*1.5
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,技能={"高级感知"}
,主动技能=取随机法术(2)
}
 	 end
 if 取随机数()<=2 then
      战斗单位[#战斗单位]={
名称="善良的"..任务数据[任务id].模型
,模型=任务数据[任务id].模型
,伤害=1
,气血=等级*等级*0.25--等级*等级*0.65+(等级*20)
,灵力=等级*4
,速度=等级*3
,防御=等级
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,变异=true
,捉鬼变异=true
,技能={"高级感知"}
,主动技能={}
}
   end
 return 战斗单位
 end

function 战斗准备类:取宝图强盗信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+5
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*5
,气血=等级*30
,灵力=等级*5
,速度=等级*3
,防御=等级*1.5
,法防=等级*0.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,技能={"高级感知"}
,主动技能={}
}
  return 战斗单位
 end


 function 战斗准备类:取征战神州信息(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=1
  local 等级=任务数据[任务id].等级
  if 任务数据[任务id].名称 == "初出茅庐征战神州" then
      伤害系数 = 1
  elseif 任务数据[任务id].名称 == "小有所成征战神州" then
      伤害系数 = 1.4
  elseif 任务数据[任务id].名称 == "伏虎斩妖征战神州" then
      伤害系数 = 1.6
  elseif 任务数据[任务id].名称 == "御风神行征战神州" then
      伤害系数 = 1.8
  elseif 任务数据[任务id].名称 == "履水吐焰征战神州" then
      伤害系数 = 2
  end
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*8*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="铁血无双"
,模型="律法女娲"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="铁血无双"
,模型="幽灵"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="玄法无边"
,模型="灵符女娲"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="玄法无边"
,模型="灵鹤"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="玄法无边"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="神封无量"
,模型="鼠先锋"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符"}
}
 战斗单位[8]={
 名称="神封无量"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="长生无界"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*6
,躲闪=等级*8*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="乾坤无行"
,模型="吸血鬼"
,伤害=等级*18*伤害系数+1000
,气血=等级*200*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级隐身"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取地煞信息(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=1
  local 等级=任务数据[任务id].等级
  if 任务数据[任务id].名称 == "初出茅庐地煞星" then
      伤害系数 = 1
  elseif 任务数据[任务id].名称 == "小有所成地煞星" then
      伤害系数 = 1.4
  elseif 任务数据[任务id].名称 == "伏虎斩妖地煞星" then
      伤害系数 = 1.6
  elseif 任务数据[任务id].名称 == "御风神行地煞星" then
      伤害系数 = 1.8
  elseif 任务数据[任务id].名称 == "履水吐焰地煞星" then
      伤害系数 = 2
  end
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*8*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="铁血无双"
,模型="律法女娲"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="铁血无双"
,模型="幽灵"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="玄法无边"
,模型="灵符女娲"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="玄法无边"
,模型="灵鹤"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="玄法无边"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="神封无量"
,模型="鼠先锋"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符"}
}
 战斗单位[8]={
 名称="神封无量"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="长生无界"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*6
,躲闪=等级*8*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="乾坤无行"
,模型="吸血鬼"
,伤害=等级*18*伤害系数+1000
,气血=等级*200*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级隐身"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end



function 战斗准备类:取天罡星信息(任务id,玩家id)
  local 战斗单位={}
  local 伤害系数=3
  local 等级=任务数据[任务id].等级
  --[[if 任务数据[任务id].名称 == "初出茅庐地煞星" then
      伤害系数 = 1
  elseif 任务数据[任务id].名称 == "小有所成地煞星" then
      伤害系数 = 1.4
  elseif 任务数据[任务id].名称 == "伏虎斩妖地煞星" then
      伤害系数 = 1.6
  elseif 任务数据[任务id].名称 == "御风神行地煞星" then
      伤害系数 = 1.8
  elseif 任务数据[任务id].名称 == "履水吐焰地煞星" then
      伤害系数 = 2
  end--]]
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
,角色=true
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*8*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*5*伤害系数
,法防=等级
,躲闪=等级*6*伤害系数
,魔法=等级*6*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="铁血无双"
,模型="律法女娲"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="铁血无双"
,模型="幽灵"
,伤害=等级*18*伤害系数+800
,气血=等级*200*伤害系数
,灵力=等级*3*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级感知","高级幸运","高级必杀","高级法术暴击","高级法术连击"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="玄法无边"
,模型="灵符女娲"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="玄法无边"
,模型="灵鹤"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="玄法无边"
,模型="炎魔神"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*1.5*伤害系数
,防御=等级*2*伤害系数
,法防=等级
,躲闪=等级*4*伤害系数
,魔法=等级*4*伤害系数
,等级=等级
,技能={"高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="神封无量"
,模型="鼠先锋"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符"}
}
 战斗单位[8]={
 名称="神封无量"
,模型="雾中仙"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*5*伤害系数
,防御=等级*3*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="长生无界"
,模型="龙龟"
,伤害=等级*5*伤害系数
,气血=等级*200*伤害系数
,灵力=等级*16*伤害系数
,速度=等级*2.5*伤害系数
,防御=等级*8*伤害系数
,法防=等级*6
,躲闪=等级*8*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级神佑复生"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="乾坤无行"
,模型="吸血鬼"
,伤害=等级*18*伤害系数+1000
,气血=等级*200*伤害系数
,灵力=等级*4*伤害系数
,速度=等级*3.5*伤害系数
,防御=等级*4*伤害系数
,法防=等级
,躲闪=等级*5*伤害系数
,魔法=等级*5*伤害系数
,等级=等级
,技能={"高级隐身"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end


function 战斗准备类:取知了王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*18+700
,愤怒=99999999
,气血=等级*200
,灵力=等级*18
,速度=等级*4
,防御=等级*15
,法防=等级
,躲闪=等级*6
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级偷袭","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"飞砂走石","龙卷雨击","破碎无双"}
}
  战斗单位[2]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*15+700
,气血=等级*100
,灵力=等级*10
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*5
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,变异=true
,伤害=等级*15+700
,气血=等级*100
,灵力=等级*8
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","神迹","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*10
,气血=等级*100
,灵力=等级*16
,速度=等级*2
,防御=等级*15
,法防=等级
,法术修炼=5
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,伤害=等级*10
,气血=等级*100
,灵力=等级*16
,速度=等级*2
,法术修炼=5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击","神迹"}
,主动技能=Q_门派法术["龙宫"]
}
 战斗单位[6]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*16+800
,气血=等级*100
,灵力=等级*16
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*12+800
,气血=等级*100
,灵力=等级*16
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="神封无量"
,模型="琴仙"
,伤害=等级*12+800
,气血=等级*200
,灵力=等级*20
,速度=等级*30
,防御=等级*10
,法防=等级*30
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}

  战斗单位[9]={
 名称="长生不死"
,模型="进阶龙龟"
,伤害=等级*16+800
,气血=等级*200
,灵力=等级*20
,速度=等级*3
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知"}
,主动技能={"金刚护体","金刚护法","普度众生"}
}
  战斗单位[10]={
 名称="长生不老"
,模型="进阶龙龟"
,伤害=等级*16+800
,气血=等级*等级*5
,灵力=等级*200
,速度=等级*3
,不可封印=true
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知","高级神迹"}
,主动技能={"推气过宫","罗汉金钟","圣灵之甲"}
}
  return 战斗单位
 end

function 战斗准备类:取妖王鬼将(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*20
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*4
,防御=等级*6
,法防=等级*0.5
,躲闪=等级*8
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[2]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[3]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[4]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[5]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
  战斗单位[6]={
 名称="幽冥鬼卒"
,模型="吸血鬼"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[7]={
 名称="幽冥鬼卒"
,模型="幽灵"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(11,15)]]
}
 战斗单位[8]={
 名称="狸"
,模型="花妖"
,变异=true
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"含情脉脉"}
}
  return 战斗单位
end

function 战斗准备类:取妖王炎魔神(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*20
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*4
,防御=等级*6
,法防=等级*0.5
,躲闪=等级*8
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级反击","高级反击"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[2]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[3]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[4]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[5]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
  战斗单位[6]={
 名称="上古魔灵"
,模型="黑山老妖"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[7]={
 名称="上古魔灵"
,模型="地狱战神"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(1,5)]]
}
 战斗单位[8]={
 名称="狐"
,模型="狐狸精"
,变异=true
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}
  return 战斗单位
 end
function 战斗准备类:取妖王净瓶女娲(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*20
,气血=等级*等级*3
,灵力=等级*8
,速度=等级*4
,防御=等级*6
,法防=等级*0.5
,躲闪=等级*8
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[2]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
战斗单位[3]={
 名称="九天妖兵"
,模型="噬天虎"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[4]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
战斗单位[5]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
  战斗单位[6]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
 战斗单位[7]={
 名称="九天妖兵"
,模型="灵符女娲"
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=Q_门派法术[Q_门派编号[取随机数(6,10)]]
}
 战斗单位[8]={
 名称="狸"
,模型="花妖"
,变异=true
,伤害=等级*14
,气血=等级*等级*1.5
,灵力=等级*6
,速度=等级*3
,防御=等级*3
,法防=等级*0.5
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"日月乾坤","反间之计"}
}
  return 战斗单位
end

function 战斗准备类:取星宿任务信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+20
  战斗单位[1]={
名称=任务数据[任务id].名称
,模型="天兵"
,伤害=等级*12+500
,气血=等级*400
,灵力=等级*7+500
,速度=等级*4.5
,防御=等级*4
,法防=等级*3.8
,躲闪=等级*4
,魔法=20000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  return 战斗单位
end

function 战斗准备类:取科举闯关信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+5
 for n=1,5 do
  战斗单位[n]={
名称="护卫"
,模型="护卫"
,伤害=等级*6
,气血=等级*30
,灵力=等级*4.5
,速度=等级*3
,防御=等级*3
,法防=等级*3.5
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={}
}
 end
  return 战斗单位
 end
function 战斗准备类:取宝图遇怪信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级+10
  战斗单位[1]={
名称="远古魔王"
,模型="黑山老妖"
,伤害=等级*6
,气血=等级*30
,灵力=等级*4
,速度=等级*3
,防御=等级*4
,法防=等级*1
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={}
}
if 取随机数()<=50 then
     战斗单位[1].模型="地狱战神"
	 end
 local 等级=玩家数据[玩家id].角色.数据.等级-5
 local 临时信息=取等级怪(取随机数(1,80))
 local 临时模型=取敌人信息(临时信息[取随机数(1,#临时信息)])
  战斗单位[2]={
名称="喽罗"
,模型=临时模型[2]
,伤害=等级*4
,气血=等级*20
,灵力=等级*4
,速度=等级*1.5
,防御=等级*3
,法防=等级*3.3
,躲闪=等级*2
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={}
}
  return 战斗单位
 end
function 战斗准备类:显示(x,y)
end

function 战斗准备类:天庭叛逆(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*5+200,气血=等级*50,灵力=等级*7+300,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"持国巡守","毗舍童子","灵灯侍者","般若天女","真陀护法","增长巡守","金身罗汉","曼珠沙华","红萼仙子","琴仙","金铙僧","灵鹤","雾中仙","大力金刚","净瓶女娲","律法女娲","灵符女娲","如意仙子","巡游天神","星灵仙子","蛟龙","凤凰","雨师","天兵","风伯","龟丞相","小龙女"}--"宠物口粮",
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="叛逆的"..模型,模型=模型,显示饰品=true,伤害=等级*5+200,气血=等级*30,灵力=等级*5+300,速度=等级*2.3,防御=等级*8,法防=等级*0.5,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:捣乱的水果(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*5+200,气血=等级*50,灵力=等级*2+300,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=2000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"泡泡","超级泡泡","超级泡泡"}
  local 模型名称范围={"腐烂的水果","火红的水果","金色的水果","发霉的水果","恶心的水果"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,取随机数(3,8) do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*2+300,气血=等级*30,灵力=等级*2+100,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=2000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取大力神灵信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="大力神灵",模型="天将",显示饰品=true,变异=true,伤害=等级*13+300,气血=等级*300,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(15)}
  等级=等级-4
  local 模型范围={"天兵"}
  local 模型名称范围={"天兵"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妖魔亲信信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="妖魔亲信",模型="蝴蝶仙子",显示饰品=true,变异=true,伤害=等级*13+300,气血=等级*300,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(15)}
  等级=等级-4
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  战斗单位[2]={名称="小喽罗",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[3]={名称="小喽罗",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[4]={名称="小喽罗",模型="黑熊精",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[5]={名称="小喽罗",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[6]={名称="小喽罗",模型="黑山老妖",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[7]={名称="小喽罗",模型="黑山老妖",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  return 战斗单位
end

function 战斗准备类:取蜃妖元神信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="蜃妖元神",模型="炎魔神",显示饰品=true,变异=true,伤害=等级*13+300,气血=等级*300,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(15)}
  等级=等级-2
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  战斗单位[2]={名称="小妖",模型="地狱战神",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[3]={名称="小妖",模型="地狱战神",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[4]={名称="小妖",模型="蝴蝶仙子",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  战斗单位[5]={名称="小妖",模型="黑熊精",显示饰品=true,伤害=等级*13+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  return 战斗单位
end

function 战斗准备类:取周猎户信息(任务id,玩家id)
  local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="周猎户",模型="山贼",显示饰品=true,变异=true,伤害=等级*10+700,气血=等级*500,灵力=等级*5+300,速度=等级*5,防御=等级*5,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(15)}
  等级=等级
  local 模型范围={"山贼","强盗","赌徒"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*10+300,气血=等级*150,灵力=等级*4+300,速度=等级*5,防御=等级*3,法防=1,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取法宝战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].人物,模型="山贼",显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"山贼","强盗","赌徒"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取法宝内丹战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"吸血鬼","鬼将","噬天虎","灵鹤","幽灵","百足将军","犀牛将军人形","犀牛将军兽形"}
  local 模型名称范围={"帮手"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取横行霸道的土匪战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=true,变异=true,伤害=等级*13+500,气血=等级*300,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"强盗","山贼"}
  local 模型名称范围={"土匪喽罗"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*13+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升心魔战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,染色方案=任务数据[任务id].染色方案,染色组=任务数据[任务id].染色组,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色方案=任务数据[任务id].武器染色方案,武器染色组=任务数据[任务id].武器染色组,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={任务数据[任务id].模型}
  local 模型名称范围={任务数据[任务id].名称}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,染色方案=任务数据[任务id].染色方案,染色组=任务数据[任务id].染色组,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色方案=任务数据[任务id].武器染色方案,武器染色组=任务数据[任务id].武器染色组,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升小妖战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称="牛魔王小弟",模型="牛妖",伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"牛妖"}
  local 模型名称范围={"牛魔王小弟"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升小宝箱战斗信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={名称="不死壤守卫",模型="鬼将",变异=true,伤害=等级*13+500,气血=等级*400,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-5
  local 模型范围={"鬼将","吸血鬼","幽灵","画魂","幽萤娃娃"}
  local 模型名称范围={"不死壤护卫"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*13+500,气血=等级*200,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法1战斗信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="守护者的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法2战斗信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*5)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="守护者的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*5)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法3战斗信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="守护者的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法4战斗信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="守护者的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取飞升阵法5战斗信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性1(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能={}
        ,愤怒=99999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(55,175)[2]
      战斗单位[i]={
        名称="守护者的"..模型名称
        ,模型="进阶"..模型名称
        ,饰品=true
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1.5)
        ,防御=math.floor(假人属性[i].防御*1.5)
        ,法防=math.floor(假人属性[i].法防*1.5)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+999999
        ,等级=假人属性[i].等级+10
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息1(任务id,玩家id)
  local 战斗单位={}
  local 等级=120
  战斗单位[1]={
     名称="罗成"
    ,模型="剑侠客"
    ,武器=取武器数据("霜冷九州",150)
    ,伤害=999999
    ,角色=true
    ,气血=150000
    ,灵力=999999
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={风刃=1,杀意=1,念心=1,干将=1,勇念=1,破空=1,无敌=1,破军=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"破釜沉舟","横扫千军","后发制人"}
  }

  战斗单位[2]={
     名称="张副将"
    ,模型="巨魔王"
    ,武器=取武器数据("碧血干戚",150)
    ,伤害=999999
    ,角色=true
    ,气血=150000
    ,灵力=999999
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  战斗单位[3]={
     名称="李副将"
    ,模型="虎头怪"
    ,武器=取武器数据("狂澜碎岳",150)
    ,伤害=999999
    ,角色=true
    ,气血=150000
    ,灵力=999999
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  战斗单位[4]={
     名称="护驾亲兵 "
    ,模型="逍遥生"
    ,武器=取武器数据("浩气长舒",150)
    ,伤害=999999
    ,角色=true
    ,气血=300000
    ,灵力=999999
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={佛显=1,佛屠=1,佛誉=1,仁心=1,心韧=1,舍利=1,映法=1,诸天看护=1}
    ,技能={"高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"唧唧歪歪","推气过宫","活血","金刚护体","金刚护法"}
  }

  战斗单位[5]={
     名称="护驾亲兵 "
    ,模型="逍遥生"
    ,武器=取武器数据("浩气长舒",150)
    ,伤害=999999
    ,角色=true
    ,气血=300000
    ,灵力=999999
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={佛显=1,佛屠=1,佛誉=1,仁心=1,心韧=1,舍利=1,映法=1,诸天看护=1}
    ,技能={"高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"唧唧歪歪","推气过宫","活血","金刚护体","金刚护法"}
  }

  for n=6,10 do
    战斗单位[n]={
       名称="大唐骁勇"
      ,模型="护卫"
      ,变异=true
      ,伤害=999999
      ,气血=100000
      ,灵力=999999
      ,速度=1000
      ,防御=1000
      ,法防=1000
      ,躲闪=5000
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级感知"}
      ,主动技能={"横扫千军","破釜沉舟","杀气诀"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息2(任务id,玩家id)
  local 战斗单位={}
  local 等级=120
  战斗单位[1]={
     名称="红孩儿"
    ,模型="小魔头"
    ,伤害=10000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
  }

  战斗单位[2]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=5000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  战斗单位[3]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=5000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  战斗单位[4]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
  }

  战斗单位[5]={
     名称="护殿牛将"
    ,模型="牛妖"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
  }

  for n=6,10 do
    战斗单位[n]={
     名称="火云妖兵"
    ,模型="炎魔神"
    ,变异=true
    ,伤害=10000
    ,气血=100000
    ,灵力=1000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息3(任务id,玩家id)
  local 战斗单位={}
  local 等级=120
  战斗单位[1]={
     名称="雷祖"
    ,模型="雨师"
    ,变异=true
    ,伤害=10000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[2]={
     名称="邓天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  战斗单位[3]={
     名称="辛天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  战斗单位[4]={
     名称="张天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  战斗单位[5]={
     名称="陶天君"
    ,模型="天兵"
    ,变异=true
    ,伤害=3000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="火云妖兵"
    ,模型="天兵"
    ,变异=true
    ,伤害=2000
    ,气血=100000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1,傲翔=1,飞龙=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧","龙卷雨击","二龙戏珠","神龙摆尾","逆鳞"}
    }
    if n==6 then
      战斗单位[n].名称="庞天君"
    elseif n==7 then
      战斗单位[n].名称="刘天君"
    elseif n==8 then
      战斗单位[n].名称="荀天君"
    elseif n==9 then
      战斗单位[n].名称="毕天君"
    elseif n==10 then
      战斗单位[n].名称="秦天君"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息4(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="麻姑"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级隐身","高级反击","高级夜战","高级反击"}
    ,主动技能={"满天花雨","雨落寒沙"}
  }

  战斗单位[2]={
     名称="玫瑰护法"
    ,模型="律法女娲"
    ,变异=true
    ,伤害=10000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[3]={
     名称="海棠护法"
    ,模型="灵符女娲"
    ,变异=true
    ,伤害=10000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
  }

  战斗单位[4]={
     名称="荷花仙子"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=5000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
    ,主动技能={"满天花雨","雨落寒沙"}
  }

  战斗单位[5]={
     名称="梅花仙子"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=5000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
    ,主动技能={"满天花雨","雨落寒沙"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="火云妖兵"
    ,模型="雾中仙"
    ,变异=true
    ,伤害=5000
    ,气血=100000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
    ,主动技能={"碎玉弄影","飞符炼魂","一笑倾城"}
    }
    if n==6 then
      战斗单位[n].名称="桃花仙子"
    elseif n==7 then
      战斗单位[n].名称="兰花仙子"
    elseif n==8 then
      战斗单位[n].名称="梨花仙子"
    elseif n==9 then
      战斗单位[n].名称="昙花仙子"
    elseif n==10 then
      战斗单位[n].名称="菊花仙子"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息5(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="云霄仙子 "
    ,模型="进阶如意仙子"
    ,变异=true
    ,伤害=10000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={普渡=1,雨润=1,法咒=1,道衍=1,秘术=1,借灵=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级隐身","高级反击","高级夜战","高级反击"}
    ,主动技能={"普渡众生","波澜不惊","五行制化","灵动九天"}
  }

  战斗单位[2]={
     名称="紫霞仙子"
    ,模型="星灵仙子"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[3]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=5000
    ,气血=150000
    ,灵力=5000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={风刃=1,杀意=1,念心=1,干将=1,勇念=1,破空=1,无敌=1,破军=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"破釜沉舟","横扫千军","后发制人"}
  }

  战斗单位[4]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=5000
    ,气血=150000
    ,灵力=5000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={战诀=1,暴气=1,天神怒斩=1,真君显灵=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天崩地裂","翻江搅海","碎星诀","浪涌"}
  }

  战斗单位[5]={
     名称="忘情护法"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=5000
    ,气血=150000
    ,灵力=5000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=100
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="盘丝小仙"
    ,模型="幽灵"
    ,变异=true
    ,伤害=5000
    ,气血=100000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,奇经八脉={鼓乐=1,妖气=1,粘附=1,迷梦=1,情劫=1,脱壳=1,迷意=1,结阵=1,媚态=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
    ,主动技能={"含情脉脉","瘴气","魔音摄魂","盘丝阵","幻镜术","天罗地网"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息6(任务id,玩家id)
  local 战斗单位={}
  local 等级=130
  战斗单位[1]={
     名称="龙王"
    ,模型="蛟龙"
    ,变异=true
    ,伤害=10000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[2]={
     名称="九头驸马"
    ,模型="九头精怪"
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={震怒=1,赤暖=1,神炎=1,返火=1,魔心=1,烈焰真诀=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"火甲术","摇头摆尾","三昧真火","飞砂走石","牛劲"}
  }

  战斗单位[3]={
     名称="万圣公主"
    ,模型="小龙女"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,奇经八脉={普渡=1,雨润=1,法咒=1,道衍=1,秘术=1,借灵=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
    ,主动技能={"普渡众生","波澜不惊","五行制化","灵动九天"}
  }

  战斗单位[4]={
     名称="碧波水勇"
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[5]={
     名称="碧波水勇"
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="碧波水勇"
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=10000
    ,气血=100000
    ,灵力=2000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={滋养=1,风灵=1,法身=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"落叶萧萧","密润","风卷残云"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息7(任务id,玩家id)
  local 战斗单位={}
  local 等级=140
  战斗单位[1]={
     名称="张天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=10000
    ,气血=500000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={苦缠=1,雷动=1,奔雷=1,鬼惧=1,不倦=1,化身=1,批亢=1,鬼念=1,碎甲=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"碎甲符","定身符","失心符","五雷咒","落雷符","分身术"}
  }

  战斗单位[2]={
     名称="许天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=3000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  战斗单位[3]={
     名称="萨天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[4]={
     名称="许天师"
    ,模型="雨师"
    ,变异=true
    ,伤害=10000
    ,气血=150000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[5]={
     名称="司命星君"
    ,模型="天将"
    ,变异=true
    ,伤害=5000
    ,气血=200000
    ,灵力=3000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="司命星君"
    ,模型="天将"
    ,变异=true
    ,伤害=4000
    ,气血=150000
    ,灵力=1000
    ,速度=1000
    ,防御=1000
    ,法防=1000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={苦缠=1,雷动=1,奔雷=1,鬼惧=1,不倦=1,化身=1,批亢=1,鬼念=1,碎甲=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"碎甲符","定身符","失心符","五雷咒","落雷符","分身术"}
    }
    if n==6 then
      战斗单位[n].名称="司禄星君"
    elseif n==7 then
      战斗单位[n].名称="延寿星君"
    elseif n==8 then
      战斗单位[n].名称="益算星君"
    elseif n==9 then
      战斗单位[n].名称="度厄星君"
    elseif n==10 then
      战斗单位[n].名称="上生星君"
    end
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息8(任务id,玩家id)
  local 战斗单位={}
  local 等级=140
  战斗单位[1]={
     名称="转轮王"
    ,模型="阎罗王"
    ,伤害=5000
    ,气血=500000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
  }

  战斗单位[2]={
     名称="平方王"
    ,模型="野鬼"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
  }

  战斗单位[3]={
     名称="阴长生"
    ,模型="吸血鬼"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
  }

  战斗单位[4]={
     名称="牛头"
    ,模型="牛头"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
  }

  战斗单位[5]={
     名称="马面"
    ,模型="马面"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,奇经八脉={伤魂=1,毒印=1,击破=1,夜之王者=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"阎罗令","判官令","百爪狂杀","六道无量","尸腐毒"}
  }

  for n=6,10 do
    战斗单位[n]={
    名称="勾魂使者 "
    ,模型="幽灵"
    ,变异=true
    ,伤害=5000
    ,气血=200000
    ,灵力=2000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,等级=等级
    ,奇经八脉={金莲=1,自愈=1,化莲=1,精进=1,灵身=1,反先=1,同舟共济=1}
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"地涌金莲","夺命咒","金身舍利","摧心术","明光宝烛","同舟共济"}
    }
  end
  return 战斗单位
end

function 战斗准备类:取生死劫信息9(任务id,玩家id)
  local 战斗单位={}
  local 等级=150
  战斗单位[1]={
     名称="孔雀明王"
    ,模型="九头精怪"
    ,伤害=5000
    ,气血=500000
    ,灵力=3000
    ,速度=1000
    ,防御=2000
    ,法防=2000
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={威赫=1,雷波=1,怒气=1,神律=1,画地为牢=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"天雷斩","雷霆万钧"}
  }

  战斗单位[2]={
     名称="泼法金刚 "
    ,模型="大力金刚"
    ,变异=true
    ,伤害=3000
    ,气血=500000
    ,灵力=3000
    ,速度=1000
    ,防御=3000
    ,法防=3000
    ,躲闪=5000
    ,魔法=200000
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={佛显=1,佛屠=1,佛誉=1,仁心=1,心韧=1,舍利=1,映法=1,诸天看护=1}
    ,技能={"高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"唧唧歪歪","推气过宫","活血"}
  }

  战斗单位[3]={
     名称="胜至金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=3000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=5000
    ,魔法=200000
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={波涛=1,龙珠=1,戏珠=1,龙魄=1,摧意=1}
    ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"龙卷雨击","龙腾","二龙戏珠","亢龙归海","雷浪穿云"}
  }

  战斗单位[4]={
     名称="大力金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,愤怒=999
    ,不可封印=true
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={风刃=1,杀意=1,念心=1,干将=1,勇念=1,破空=1,无敌=1,破军=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"破釜沉舟","横扫千军","后发制人"}
  }

  战斗单位[5]={
     名称="永住金刚"
    ,模型="大力金刚"
    ,变异=true
    ,伤害=5000
    ,气血=300000
    ,灵力=3000
    ,速度=1000
    ,防御=1500
    ,法防=1500
    ,躲闪=1000
    ,魔法=200000
    ,愤怒=999
    ,等级=等级
    ,不可封印=true
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,奇经八脉={宁息=1,化血=1,狮吼=1,鹰啸=1,威震=1}
    ,技能={"高级感知","高级驱鬼","高级必杀","高级法术暴击","高级反击","高级夜战"}
    ,主动技能={"鹰击","狮搏","连环击"}
  }

  战斗单位[6]={
  名称="护法枷蓝"
  ,模型="大力金刚"
  ,变异=true
  ,伤害=5000
  ,气血=150000
  ,灵力=3000
  ,速度=1000
  ,防御=3000
  ,法防=3000
  ,躲闪=5000
  ,魔法=200000
  ,等级=等级
  ,奇经八脉={自矜=1,暗伤=1,杏花=1,花舞=1,倩影=1,淬芒=1,天香=1,鸿影=1,轻霜=1,毒引=1,毒雾=1,嫣然=1,磐石=1}
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
  ,主动技能={"碎玉弄影","飞符炼魂","一笑倾城"}
    }

      战斗单位[7]={
  名称="护法枷蓝"
  ,模型="大力金刚"
  ,变异=true
  ,伤害=3000
  ,气血=150000
  ,灵力=3000
  ,速度=1000
  ,防御=3000
  ,法防=3000
  ,躲闪=5000
  ,魔法=200000
  ,等级=等级
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,奇经八脉={苦缠=1,雷动=1,奔雷=1,鬼惧=1,不倦=1,化身=1,批亢=1,鬼念=1,碎甲=1}
  ,技能={"高级反击","高级感知","高级驱鬼","高级法术连击","高级法术暴击","高级反击","高级夜战"}
  ,主动技能={"碎甲符","定身符","失心符","五雷咒","落雷符","分身术"}
}
  战斗单位[8]={
  名称="护法枷蓝 "
  ,模型="大力金刚"
  ,变异=true
  ,伤害=3000
  ,气血=150000
  ,灵力=3000
  ,速度=1000
  ,防御=3000
  ,法防=3000
  ,躲闪=5000
  ,魔法=200000
  ,等级=等级
  ,奇经八脉={普渡=1,雨润=1,法咒=1,道衍=1,秘术=1,借灵=1}
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
  ,主动技能={"普渡众生","波澜不惊","五行制化","灵动九天"}
    }

  战斗单位[9]={
  名称="护法枷蓝 "
  ,模型="大力金刚"
  ,变异=true
  ,伤害=5000
  ,气血=150000
  ,灵力=3000
  ,速度=1000
  ,防御=3000
  ,法防=3000
  ,躲闪=5000
  ,魔法=200000
  ,等级=等级
  ,奇经八脉={鼓乐=1,妖气=1,粘附=1,迷梦=1,情劫=1,脱壳=1,迷意=1,结阵=1,媚态=1}
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
  ,主动技能={"含情脉脉","瘴气","魔音摄魂","盘丝阵","幻镜术","天罗地网"}
  }

  战斗单位[10]={
  名称="护法枷蓝 "
  ,模型="大力金刚"
  ,变异=true
  ,伤害=5000
  ,气血=150000
  ,灵力=3000
  ,速度=1000
  ,防御=3000
  ,法防=3000
  ,躲闪=5000
  ,魔法=200000
  ,等级=等级
  ,奇经八脉={体恤=1,锤炼=1,神附=1,养生=1,归本=1,修心=1,混元=1,同辉=1,雨杀=1,乾坤=1,意境=1,傲视=1,陌宝=1,心随意动=1,致命=1}
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知","高级驱鬼","高级必杀","高级反击","高级夜战","高级反击"}
  ,主动技能={"日月乾坤","飘渺式","烟雨剑法","生命之泉","天命剑法"}
  }

  return 战斗单位
end

function 战斗准备类:取新服福利BOSS信息(任务id,玩家id)
  local 战斗单位={}
   local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7,气血=等级*25,灵力=等级*7.5,速度=2.3,防御=30,法防=等级*3,躲闪=4,魔法=200000,等级=0,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"超级玉兔"}
  local 模型名称范围={"新服福利BOSS"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=500,气血=1000,灵力=300,速度=2.3,防御=3,法防=等级*3,躲闪=4,魔法=200000,等级=0,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法贡品信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-20
  if 等级<=10 then
      等级=10
  end
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+200,气血=等级*75,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"泡泡"}
  local 模型名称范围={"贡品"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=任务数据[任务id].名称,模型=模型,显示饰品=true,伤害=等级*5,气血=等级*75,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  for i=4,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*5,气血=等级*50,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法三清信息(任务id,玩家id)
local 战斗单位={}
local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
  名称=任务数据[任务id].名称
  ,模型="大力金刚"
  ,变异=true
  ,伤害=等级*10
  ,气血=等级*等级
  ,灵力=等级*4
  ,速度=等级*3.5
  ,防御=等级*6
  ,法防=等级*0.5
  ,躲闪=100
  ,魔法=200000
  ,等级=等级
  ,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,技能={"高级感知"}
  ,主动技能=取随机法术(3)
  }
 等级=等级-5
 for i=2,10 do
  战斗单位[i]={
   名称="护法"
  ,模型="天兵"
  ,伤害=等级*8
  ,气血=等级*等级
  ,灵力=等级*4
  ,速度=等级*2.5
  ,防御=等级*5
  ,法防=等级*0.5
  ,躲闪=等级*4
  ,魔法=200000
  ,等级=等级
  ,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
  ,技能={"高级感知"}
  ,技能={"高级连击"}
  ,主动技能=取随机法术(2)
  }
 end
 return 战斗单位
end

function 战斗准备类:取车迟斗法求雨信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
   名称=任务数据[任务id].名称
  ,模型=任务数据[任务id].模型
  ,变异=true
  ,伤害=等级*15
  ,气血=等级*等级
  ,灵力=等级*7
  ,速度=等级*3.5
  ,防御=等级*6
  ,法防=等级*0.5
  ,躲闪=100
  ,魔法=200000
  ,等级=等级
  ,攻击修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,防御修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,法术修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,抗法修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,技能={"高级感知"}
  ,主动技能=取随机法术(3)
  }
  for i=2,10 do
  战斗单位[i]={
   名称="天将"
  ,模型="天将"
  ,伤害=等级*12
  ,气血=等级*等级
  ,灵力=等级*5
  ,速度=等级*2.5
  ,防御=等级*5
  ,法防=等级*0.5
  ,躲闪=等级*4
  ,魔法=200000
  ,等级=等级
  ,攻击修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,防御修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,法术修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,抗法修炼=math.floor(取人物修炼等级上限(等级)/1.5)
  ,技能={"高级连击"}
  ,主动技能=取随机法术(2)
  }
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法不动信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  if 任务数据[任务id].名称=="我不动" then
        战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=等级*12
    ,气血=等级*等级
    ,灵力=等级*10
    ,速度=等级*3.5
    ,防御=等级*6
    ,法防=等级*0.5
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级感知"}
    ,主动技能={"龙卷雨击","龙腾"}
    }
      for i=2,5 do
      战斗单位[i]={
       名称="你不动"
      ,模型="净瓶女娲"
      ,变异=true
      ,伤害=等级*8
      ,气血=等级*等级
      ,灵力=等级*8
      ,速度=等级*2.5
      ,防御=等级*4
      ,法防=等级*0.5
      ,躲闪=100
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级夜战"}
      ,主动技能={"泰山压顶"}
      }
     end
     等级=等级-5
     for i=6,10 do
          战斗单位[i]={
       名称="护法"
      ,模型="大力金刚"
      ,伤害=等级*10
      ,气血=等级*等级
      ,灵力=等级*4
      ,速度=等级*2.5
      ,防御=等级*4
      ,法防=等级*0.5
      ,躲闪=等级*4
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级连击"}
      ,主动技能={}
      }
     end
  else
        战斗单位[1]={
     名称=任务数据[任务id].名称
    ,模型="净瓶女娲"
    ,变异=true
    ,伤害=等级*13
    ,气血=等级*等级
    ,灵力=等级*4
    ,速度=等级*3.5
    ,防御=等级*6
    ,法防=等级*0.5
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"变身","鹰击","连环击"}
    }
    for i=2,5 do
      战斗单位[i]={
       名称="护法"
      ,模型="大力金刚"
      ,变异=true
      ,伤害=等级*10
      ,气血=等级*等级
      ,灵力=等级*4
      ,速度=等级*3.5
      ,防御=等级*4
      ,法防=等级*0.5
      ,躲闪=100
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级连击"}
      ,主动技能=取随机法术(2)
      }
     end
     等级=等级-5
     for i=6,10 do
      战斗单位[i]={
       名称="护卫"
      ,模型="夜罗刹"
      ,伤害=等级*5
      ,气血=等级*等级
      ,灵力=等级*4
      ,速度=等级*2.5
      ,防御=等级*4
      ,法防=等级*0.5
      ,躲闪=等级*4
      ,魔法=200000
      ,等级=等级
      ,攻击修炼=math.floor(取人物修炼等级上限(等级))
      ,防御修炼=math.floor(取人物修炼等级上限(等级))
      ,法术修炼=math.floor(取人物修炼等级上限(等级))
      ,抗法修炼=math.floor(取人物修炼等级上限(等级))
      ,技能={"高级连击"}
      ,主动技能={}
      }
     end
  end
  return 战斗单位
end

function 战斗准备类:取车迟斗法妖怪信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 模型范围={"进阶金身罗汉"}
  local 模型名称范围={"三妖精"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,饰品=true,伤害=等级*10,气血=(等级-5+等级*0.2)*145,灵力=等级*10,速度=等级*8,防御=等级*6,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击","高级隐身"},主动技能={"龙卷雨击","龙腾","龙吟"}}
  local 模型范围={"踏云兽","净瓶女娲","炎魔神","雨师","芙蓉仙子"}
  local 模型名称范围={"喽啰"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 攻击技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"天雷斩"}}
  local 辅助技能范围 = {{"失心符","定身符","反间之计"},{"推气过宫"}}
  local 技能随机=攻击技能范围[取随机数(1,#攻击技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=攻击技能范围[取随机数(1,#攻击技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,饰品=true,伤害=等级*12,气血=(等级-5+等级*0.2)*130,灵力=等级*8,速度=等级*2.3,防御=等级*4,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  for i=9,10 do
    模型="灵符女娲"
    技能随机=辅助技能范围[取随机数(1,#辅助技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,饰品=true,伤害=等级*8,气血=(等级-5+等级*0.2)*130,灵力=等级*4,速度=等级*2.3,防御=等级*4,法防=等级*0.5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
    防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取散财童子信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10,气血=等级*等级,灵力=等级*10,速度=2.3,防御=等级*5,法防=等级*3,躲闪=4,魔法=200000,等级=等级,技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"葫芦宝贝"}
  local 模型名称范围={"恭喜发财"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*10+300,气血=等级*100+3000,灵力=等级*10+100,速度=2.3,防御=等级*5,法防=等级*3,躲闪=4,魔法=200000,等级=等级,技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取神秘妖怪信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*5,法防=等级*5,躲闪=等级*5,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"蛟龙","地狱战神","白熊","古代瑞兽"}
  local 模型名称范围={"喽罗"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*6+500,气血=等级*200,灵力=等级*6+300,速度=等级*2.3,防御=等级*5,法防=等级*5,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妄空曰天冷信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+1000,气血=等级*400,灵力=等级*10+500,速度=5.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型范围={"进阶鬼将","进阶蝎子精","进阶吸血鬼","进阶碧水夜叉","进阶龙龟"}
  local 模型名称范围={"喽罗"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,显示饰品=true,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取妄空曰天冷信息2(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 战斗单位={}
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,角色=true,武器=取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,变异=任务数据[任务id].变异,显示饰品=任务数据[任务id].显示饰品,伤害=等级*10+1000,气血=等级*400,灵力=等级*10+500,速度=5.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  local 模型名称范围={"喽罗"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,#Q_随机模型)]
    local 武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,显示饰品=true,伤害=等级*8+500,气血=等级*300,灵力=等级*8+300,速度=等级*2.3,防御=等级*6,法防=等级*6,躲闪=等级*5,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取渡劫师傅信息(任务id,玩家id)
  local 等级=玩家数据[玩家id].角色.数据.等级
  local 模型=玩家数据[玩家id].角色.数据.造型
  local 武器造型=取天罡星武器造型(模型)
  local 战斗单位={}
  战斗单位[1]={名称=玩家数据[玩家id].角色.数据.门派.."大弟子",
  模型=模型,
  角色=true,
  武器=取武器数据(武器造型.武器,武器造型.级别),
  武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,
  变异=任务数据[任务id].变异,
  显示饰品=任务数据[任务id].显示饰品,
  伤害=2500,
  气血=300000,
  灵力=1500,
  速度=800,
  防御=1000,
  法防=1000,
  躲闪=等级*5,
  魔法=200000,
  等级=等级,
  攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),
  法术修炼=math.floor(取人物修炼等级上限(等级)),
  抗法修炼=math.floor(取人物修炼等级上限(等级)),
  技能={"魔之心","法术连击"},
  主动技能=取随机法术(5)}
  local 模型名称范围={"喽罗"}
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","二龙戏珠"},{"落叶萧萧","泰山压顶","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,10 do
    local 模型=Q_随机模型[取随机数(1,5)]
    if 玩家数据[玩家id].角色.数据.种族=="仙" then
      模型=Q_随机模型[取随机数(6,10)]
    elseif 玩家数据[玩家id].角色.数据.种族=="魔" then
      模型=Q_随机模型[取随机数(11,15)]
    end
    武器造型=取天罡星武器造型(模型)
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=玩家数据[玩家id].角色.数据.门派.."弟子",模型=模型,角色=true,武器=取武器数据(武器造型.武器,武器造型.级别),武器染色组=任务数据[任务id].武器染色组,武器染色方案=任务数据[任务id].武器染色方案,显示饰品=true,
    伤害=2000,
    气血=100000,
    灵力=1000,
    速度=800,
    防御=800,
    法防=800,
    躲闪=等级*5,
    魔法=200000,
    等级=等级,
    攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:首席争霸(任务id,玩家id,假人属性)
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)+5
  local 假人随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  战斗单位[1]={
    名称=任务数据[任务id].名称
    ,模型=任务数据[任务id].模型
    --,武器=取武器数据(任务数据[任务id].武器,120)
    ,武器=取武器数据(首席争霸[Q_门派编号[任务数据[任务id].序列]].武器,首席争霸[Q_门派编号[任务数据[任务id].序列]].武器等级)
    ,角色=true
	  ,染色组=首席争霸[Q_门派编号[任务数据[任务id].序列]].染色组
	  ,染色方案=首席争霸[Q_门派编号[任务数据[任务id].序列]].染色方案
    ,伤害=1000
    ,气血=20000
    ,灵力=1000
    ,速度=500
    ,防御=500
    ,法防=500
    ,躲闪=100
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=Q_门派法术[Q_门派编号[任务数据[任务id].序列]]
    }
  for i=2,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称=假人属性[i].名称
        ,模型=临时数据.模型
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*10)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1)
        ,防御=math.floor(假人属性[i].防御*1)
        ,法防=math.floor(假人属性[i].法防*1)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能={}
        ,愤怒=150
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能1(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(65,假人属性[i].参战等级)[2]
      战斗单位[i]={
        名称=模型名称
        ,模型=模型名称
        ,伤害=math.floor(假人属性[i].伤害*1.5)
        ,气血=math.floor(假人属性[i].气血*5)
        ,灵力=math.floor(假人属性[i].灵力*1.5)
        ,速度=math.floor(假人属性[i].速度*1)
        ,防御=math.floor(假人属性[i].防御*1)
        ,法防=math.floor(假人属性[i].法防*1)
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取蚩尤幻影信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
    名称="蚩尤幻影"
    ,模型=任务数据[任务id].模型
    ,变异=true
    ,伤害=3500*1.3
    ,气血=(等级*等级*20+400000)*1.3
    ,灵力=等级*8*1.3
    ,速度=等级*6*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*6*1.3
    ,魔法=等级*500*10*1.3
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)}
  战斗单位[2]={
    名称="魔族护法"
    ,模型="进阶夜罗刹"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,愤怒=99999
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[3]={
    名称="魔族军师"
    ,模型="进阶曼珠沙华"
    ,变异=true
    ,伤害=3300*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*3*1.3
    ,防御=等级*6*1.3
    ,法防=500
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,愤怒=99999
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  战斗单位[4]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*5*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*3*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[5]={
    名称="魔族首领"
    ,模型="进阶蝎子精"
    ,变异=true
    ,伤害=等级*5*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*3*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[6]={
    名称="魔族精英"
    ,模型="进阶混沌兽"
    ,变异=true
    ,伤害=等级*5*1.3
    ,气血=(等级*等级*15+200000)*1.3
    ,灵力=(等级*15+300)*1.3
    ,速度=等级*2*1.3
    ,防御=等级*3*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
    ,主动技能={"落叶萧萧","八凶法阵","上古灵符","龙卷雨击","龙吟"}}
  战斗单位[7]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*3.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[8]={
    名称="魔族精英"
    ,模型="进阶琴仙"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=800*1.3
    ,防御=等级*3*1.3
    ,法防=等级*3.8*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能={"失心符","定身符","反间之计"}}
  战斗单位[9]={
    名称="魔族精英"
    ,模型="进阶龙龟"
    ,变异=true
    ,伤害=600*1.3
    ,气血=(等级*等级*25+400000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*2.5*1.3
    ,防御=等级*6*1.3
    ,法防=等级*6*1.3
    ,躲闪=等级*4*1.3
    ,愤怒=99999
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,魔法=200000
    ,等级=等级
    ,技能={"高级感知"}
    ,主动技能={"推气过宫","四海升平","罗汉金钟","晶清诀"}}
  战斗单位[10]={
    名称="魔族精英"
    ,模型="进阶蜃气妖"
    ,变异=true
    ,伤害=2300*1.3
    ,气血=(等级*等级*15+150000)*1.3
    ,灵力=等级*4*1.3
    ,速度=等级*4*1.3
    ,防御=等级*5*1.3
    ,法防=等级*3.5*1.3
    ,躲闪=等级*4*1.3
    ,魔法=200000
    ,等级=等级
    ,愤怒=99999
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知","高级必杀","高级吸血"}
    ,主动技能={"横扫千军","善恶有报","壁垒击破","剑荡四方","天雷斩","破血狂攻","破碎无双"}}
  return 战斗单位
end

function 战斗准备类:取福利宝箱怪(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  local 模型范围={"虾兵","蟹将"}
  local 名称="秘制麻辣小龙虾"
  模型=模型范围[取随机数(1,#模型范围)]
  if 模型=="蟹将" then
    名称="火爆干锅梭子蟹"
  end
  战斗单位[1]={名称=名称,模型=模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*120,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  模型范围={"海毛虫","大海龟","海星","章鱼"}
  local 模型名称范围={"清蒸","红烧","炭烤","油炸","生吃"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,取随机数(3,5) do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=等级*5+500,气血=等级*100,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取倾国倾城信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=5000,气血=3000,灵力=5000,速度=800,防御=10000,法防=10000,躲闪=2000,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级隐身","嗜血追击","苍鸾怒击","高级连击","高级必杀","高级吸血"},主动技能=取随机法术(5)}
  模型范围={"炎魔神"}
  local 模型名称范围={"抠脚大汉"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,4 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1500,气血=100000,灵力=800,速度=0,防御=等级*3,法防=5000,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  模型范围={"花妖"}
  local 模型名称范围={"侍女"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=5,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1500,气血=50000,灵力=等级*5,速度=0,防御=1000,法防=等级*3,躲闪=等级*4,魔法=200000,愤怒=9999,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能={"四海升平","失魂符"}}
  end
  return 战斗单位
end

function 战斗准备类:取美食专家信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,显示饰品=任务数据[任务id].显示饰品,伤害=1000,气血=5000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  模型范围={"山贼","赌徒","强盗"}
  local 模型名称范围={"贪吃的食客"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=1000,气血=5000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end
function 战斗准备类:取通天塔信息(任务id,玩家id,假人属性)
  local 假人随机阵法 = {"普通","天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
  local 通天塔层数 = 通天塔数据[玩家id].层数
  local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
  if 通天塔层数==nil then
    通天塔层数=0
  end
  if 通天塔层数 >= 0 and 通天塔层数<999 then
    self.难度系数 = 1+通天塔层数/15
  end

  local 战斗单位={}
  战斗单位.阵法=假人随机阵法[取随机数(1,#假人随机阵法)]
  for i=1,#假人属性 do
    if 假人属性[i].门派~=nil then
      local 临时数据 = self:取剑会天下随机属性(假人属性[i].门派,假人属性[i].等级)
      local 武器数据 = 取可佩带武器名称1(临时数据.模型,假人属性[i].等级)
      战斗单位[i]={
        名称 = "通天"..(通天塔层数+1).."层统领"
        ,模型=临时数据.模型
        ,伤害=等级*6*self.难度系数
        ,气血=等级*等级*self.难度系数
        ,灵力=等级*4*self.难度系数
        ,速度=等级*2*self.难度系数
        ,防御=等级*3*self.难度系数
        ,法防=等级*2*self.难度系数
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能={}
        ,愤怒=9999
        ,主动技能=临时数据.技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,武器=取武器数据(武器数据[1],武器数据[2])
        ,五维属性=假人属性[i].五维属性
        ,门派=临时数据.门派
        ,奇经八脉=临时数据.奇经八脉
        ,附加状态=临时数据.附加状态
        ,追加法术=临时数据.追加法术
        ,武器伤害=假人属性[i].武器伤害
        ,法宝=临时数据.法宝
      }
    else
      local 临时数据 = self:取剑会天下BB技能(假人属性[i].五维属性,假人属性[i].技能)
      local 模型名称 = 取随机怪(125,假人属性[i].参战等级)[2]
      战斗单位[i]={
        名称=模型名称
        ,模型=模型名称
        ,伤害=等级*5*self.难度系数
        ,气血=等级*等级*self.难度系数
        ,灵力=等级*3*self.难度系数
        ,速度=等级*2*self.难度系数
        ,防御=等级*2*self.难度系数
        ,法防=等级*self.难度系数
        ,躲闪=假人属性[i].等级*2
        ,魔法=假人属性[i].魔法+2000
        ,等级=假人属性[i].等级
        ,技能=临时数据.技能
        ,主动技能=临时数据.主动技能
        ,位置=假人属性[i].位置
        ,攻击修炼=假人属性[i].攻击修炼
        ,防御修炼=假人属性[i].防御修炼
        ,法术修炼=假人属性[i].法术修炼
        ,抗法修炼=假人属性[i].抗法修炼
        ,角色分类=假人属性[i].角色分类
        ,五维属性=假人属性[i].五维属性
        ,内丹数据=假人属性[i].内丹数据
        ,追加法术=临时数据.追加法术
      }
    end
  end
  return 战斗单位
end

function 战斗准备类:取贼王的线索信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=2+取队伍人数(玩家id)
 for n=1,数量 do
    战斗单位[n]={
  名称="帮凶"
  ,模型="骷髅怪"
  ,伤害=1000
  ,气血=30000
  ,灵力=3500
  ,速度=500
  ,防御=等级*3
  ,法防=等级*3
  ,躲闪=等级*2
  ,魔法=200000
  ,等级=175
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知"}
  ,主动技能=取随机法术(4)
  }
     end
   战斗单位[1]={
  名称="贼王"
  ,模型="吸血鬼"
  ,伤害=1000
  ,气血=30000
  ,灵力=3500
  ,速度=500
  ,防御=等级*3
  ,法防=等级*3
  ,躲闪=等级*2
  ,魔法=200000
  ,等级=175
  ,攻击修炼=math.floor(取人物修炼等级上限(等级))
  ,防御修炼=math.floor(取人物修炼等级上限(等级))
  ,法术修炼=math.floor(取人物修炼等级上限(等级))
  ,抗法修炼=math.floor(取人物修炼等级上限(等级))
  ,技能={"高级感知"}
  ,主动技能=取随机法术(3)
  }
  return 战斗单位
end

function 战斗准备类:取貔貅的羁绊信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
 local 数量=7
 local 造型范围={"老虎","黑熊"}
 local 造型=造型范围[取随机数(1,#造型范围)]
  for n=1,数量 do
      战斗单位[n]={
    名称="帮凶"
    ,模型=造型
    ,伤害=1100
    ,气血=2000
    ,灵力=等级*5
    ,速度=0
    ,防御=等级*3
    ,法防=等级*3
    ,躲闪=等级*2
    ,魔法=200000
    ,等级=175
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级鬼魂术"}
    ,主动技能=取随机法术(4)
    }
  end
  战斗单位[1]={
    名称="貔貅"
    ,模型="帮派妖兽"
    ,伤害=2000
    ,气血=10000
    ,灵力=等级*5
    ,速度=0
    ,防御=3000
    ,法防=等级*3
    ,躲闪=等级*2
    ,魔法=200000
    ,等级=175
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=取随机法术(3)
  }
  return 战斗单位
end

function 战斗准备类:取水陆桃木虫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称="桃木虫",模型="海毛虫",变异=true,伤害=100,气血=1000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"蝴蝶仙子"}
  local 模型名称范围={"桃木虫喽罗"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=80,气血=1000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取水陆泼猴信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=80,气血=1000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"长眉灵猴"}
  local 模型名称范围={"猴虱"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=80,气血=1000,灵力=600,速度=0,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=技能随机}
  end
  return 战斗单位
end

function 战斗准备类:取水陆翼虎必死信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  模型范围={"老虎"}
  local 模型名称范围={"虎军师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆蝰蛇必死信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-5
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  模型范围={"灵符女娲"}
  local 模型名称范围={"蛇军师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=9999999,气血=1000000000000,灵力=99999999,速度=99999999,防御=999999999,法防=99999999,躲闪=99999999,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级魔之心","高级法术连击","高级法术暴击"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆翼虎信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*10,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"老虎"}
  local 模型名称范围={"虎精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*6,灵力=等级*3,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能={"龙卷雨击","飞砂走石","三昧真火"}}
  end
  return 战斗单位
end

function 战斗准备类:取水陆蝰蛇信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*30,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"灵符女娲"}
  local 模型名称范围={"蛇精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*30,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆巡山小妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*30,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"雷鸟人"}
  local 模型名称范围={"巡山喽罗"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*30,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆毒虫信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*30,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"海毛虫"}
  local 模型名称范围={"毒虫"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*30,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆上古妖兽头领信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*等级,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"吸血鬼"}
  local 模型名称范围={"妖巫师"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,2 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级隐身"},主动技能=取随机法术(5)}
  end
  模型范围={"蜘蛛精"}
  local 模型名称范围={"妖兽精兵"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=3,7 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆妖将军信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  -- local 等级=任务数据[任务id].等级
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,变异=true,伤害=等级*5+500,气血=等级*等级,灵力=等级*10,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"蜘蛛精"}
  local 模型名称范围={"护法金刚"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,6 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  模型范围={"幽灵"}
  local 模型名称范围={"妖护法"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=7,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级隐身"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取水陆魑魅魍魉信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  模型范围={"幽灵"}
  local 模型名称范围={"魑魅魍魉"}
  模型=模型范围[取随机数(1,#模型范围)]
  战斗单位[1]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,变异=true,伤害=等级*5+500,气血=等级*等级,灵力=等级*10+500,速度=等级*8,防御=等级*8,法防=等级*8,躲闪=等级*8,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  模型范围={"百足将军"}
  local 模型名称范围={"妖王护法"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,3 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10+500,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  模型范围={"黑熊精"}
  local 模型名称范围={"妖护卫"}
  模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=4,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=模型名称范围[取随机数(1,#模型名称范围)],模型=模型,伤害=等级*1+500,气血=等级*等级,灵力=等级*10,速度=等级*4,防御=等级*4,法防=等级*4,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取捣乱的年兽信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*10
,气血=等级*90
,灵力=等级*4+300
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="赤金蛟龙"
,模型="蛟龙"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="赤金蛟龙"
,模型="蛟龙"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="碧玉王八"
,模型="龙龟"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级魔之心"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="碧玉王八"
,模型="龙龟"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级魔之心"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="闹事妖精"
,模型="兔子怪"
,变异=true
,伤害=等级*5
,气血=等级*60
,灵力=等级*5
,速度=等级*2
,防御=等级*6
,法防=等级*6
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
 end

 function 战斗准备类:取年兽王信息(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,伤害=等级*12
,气血=等级*150+10000
,灵力=等级*10
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="福瑞灵兽"
,模型="毗舍童子"
,变异=true
,伤害=等级*12
,气血=等级*等级+10000
,灵力=等级*8
,速度=等级*6
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="福瑞灵兽"
,模型="毗舍童子"
,变异=true
,伤害=等级*12
,气血=等级*等级+10000
,灵力=等级*8
,速度=等级*6
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="福祉灵兽"
,模型="炎魔神"
,变异=true
,伤害=等级*8
,气血=等级*等级+10000
,灵力=等级*10
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="福祉灵兽"
,模型="炎魔神"
,变异=true
,伤害=等级*8
,气血=等级*等级+10000
,灵力=等级*10
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["龙宫"]
}
  战斗单位[6]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*8
,气血=等级*4+10000
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*8
,气血=等级*4+10000
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*8
,气血=等级*4+10000
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
 战斗单位[9]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*8
,气血=等级*4+10000
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[10]={
 名称="护宝灵使"
,模型="大力金刚"
,变异=true
,伤害=等级*8
,气血=等级*4+10000
,灵力=等级*8
,速度=等级*2
,防御=等级*6
,法防=等级*3
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级)/2)
,防御修炼=math.floor(取人物修炼等级上限(等级)/2)
,法术修炼=math.floor(取人物修炼等级上限(等级)/2)
,抗法修炼=math.floor(取人物修炼等级上限(等级)/2)
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  return 战斗单位
end

function 战斗准备类:取怨灵幻影信息(任务id,玩家id)
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 战斗单位={}
  战斗单位[1]={
 名称=任务数据[任务id].名称
,模型=任务数据[任务id].模型
,变异=true
,伤害=等级*12*2+800
,气血=等级*等级*5*2+45000
,灵力=等级*8*2
,速度=等级*3.5*2
,防御=等级*5*2
,法防=等级*5*2
,躲闪=等级*6*2
,魔法=等级*500*6*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  战斗单位[2]={
 名称="怨灵幻影"
,模型="超级神龙"
,变异=true
,伤害=等级*10*2+800
,气血=等级*等级*4*2+30000
,灵力=等级*4*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*3*2
,躲闪=等级*4*2
,魔法=等级*500*4*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
 战斗单位[3]={
 名称="怨灵幻影"
,模型="超级神兔"
,变异=true
,伤害=等级*10*2+800
,气血=等级*等级*4*2+30000
,灵力=等级*4*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*3*2
,躲闪=等级*4*2
,魔法=等级*500*4*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  战斗单位[4]={
 名称="怨灵幻影"
,模型="超级神羊"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*500*4*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"三昧真火","地狱烈火","飞砂走石"}
}
     战斗单位[5]={
 名称="怨灵幻影"
,模型="超级神牛"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*500*4*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"龙卷雨击","龙腾","龙吟","二龙戏珠"}
}
战斗单位[6]={
 名称="怨灵幻影"
,模型="超级神猴"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+30000
,灵力=等级*8*2+300
,速度=等级*1.5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*4*2
,魔法=等级*500*4*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"落叶萧萧","雷击","奔雷咒"}
}
 战斗单位[7]={
 名称="怨灵幻影"
,模型="超级人参娃娃"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+20000
,灵力=等级*8*2
,速度=等级*5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*5*2
,魔法=等级*500*5*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[8]={
 名称="怨灵幻影"
,模型="超级土地公公"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*4*2+20000
,灵力=等级*8*2
,速度=等级*5*2
,防御=等级*3*2
,法防=等级*4*2
,躲闪=等级*5*2
,魔法=等级*500*5*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","反间之计"}
}
 战斗单位[9]={
 名称="怨灵幻影"
,模型="超级神蛇"
,变异=true
,伤害=等级*5*2
,气血=等级*等级*8*2+20000
,灵力=等级*8*2
,速度=等级*2.5*2
,防御=等级*8*2
,法防=等级*6*2
,躲闪=等级*8*2
,魔法=等级*500*5*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,愤怒=99999
,主动技能={"推气过宫","金刚护体","普渡众生","金刚护法","晶清诀","罗汉金钟","四海升平"}
}
 战斗单位[10]={
 名称="怨灵幻影"
,模型="超级麒麟"
,变异=true
,伤害=等级*12*2+1000
,气血=等级*等级*4*2+20000
,灵力=等级*4*2
,速度=等级*3.5*2
,防御=等级*4*2
,法防=等级*3*2
,躲闪=等级*5*2
,魔法=等级*500*5*2
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级隐身","高级感知"}
,主动技能={"横扫千军","善恶有报","烟雨剑法","天雷斩","飘渺式"}
}
  return 战斗单位
end

function 战斗准备类:取灵感分身信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  战斗单位[1]={
名称="灵感分身"
,模型="神天兵"
,角色=true
,武器=取武器数据("雷神",100)
,伤害=等级*12+500
,气血=等级*30
,灵力=等级*8
,速度=等级*4.5
,防御=等级*4
,法防=等级*3.8
,躲闪=等级*4
,魔法=200000
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(5)
}
  return 战斗单位
end

function 战斗准备类:取通天河妖信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蚌精","鲛人","碧水夜叉","大海龟","章鱼","虾兵","蟹将","海星"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称="河妖",模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天散财童子信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7,气血=等级*等级,灵力=等级*4,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"净瓶女娲"}
  local 名称范围={"炎上","润下","稼穑"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天黑熊精信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称=任务数据[任务id].名称,模型=任务数据[任务id].模型,显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*等级,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"净瓶女娲"}
  local 名称范围={"炎上","润下","稼穑"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,8 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天五色竹条信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="竹精",模型="泡泡",显示饰品=任务数据[任务id].显示饰品,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"泡泡"}
  local 名称范围={"竹精"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军1信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="红色鱼精",模型="野鬼",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蚌精","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军2信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="黄色鱼精",模型="地狱战神",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"虾兵","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军3信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="黑色鱼精",模型="鬼将",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"虾兵","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军4信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="白色鱼精",模型="鲛人",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*150,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天金鱼将军5信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)-2
  战斗单位[1]={名称="蓝色鱼精",模型="蚌精",显示饰品=任务数据[任务id].显示饰品,变异=true,伤害=等级*7+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=2,5 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,显示饰品=true,伤害=等级*5+500,气血=等级*30,灵力=等级*4+300,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:取通天灵感大王信息(任务id,玩家id)
  local 战斗单位={}
  local 等级=取队伍平均等级(玩家数据[玩家id].队伍,玩家id)
  local 模型范围={"神天兵"}
  local 名称范围={"灵感大王"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  战斗单位[1]={名称=名称,模型=模型,角色=true,武器=取武器数据("五虎断魂",140),饰品=true,变异=true,伤害=等级*10+800,气血=等级*100,灵力=等级*7+500,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"高级感知"},主动技能=取随机法术(5)}
  for i=2,5 do
      战斗单位[i]={
    名称="灵感分身"
    ,模型="神天兵"
    ,角色=true
    ,武器=取武器数据("五虎断魂",100)
    ,伤害=等级*8+200
    ,气血=等级*300
    ,灵力=等级*5+300
    ,速度=等级*4.5
    ,防御=等级*4
    ,法防=等级*3
    ,躲闪=等级*4
    ,魔法=200000
    ,等级=等级
    ,攻击修炼=math.floor(取人物修炼等级上限(等级))
    ,防御修炼=math.floor(取人物修炼等级上限(等级))
    ,法术修炼=math.floor(取人物修炼等级上限(等级))
    ,抗法修炼=math.floor(取人物修炼等级上限(等级))
    ,技能={"高级感知"}
    ,主动技能=取随机法术(5)
    }
  end
  等级=等级-10
  local 模型范围={"蟹将","龟丞相"}
  local 名称范围={"通天妖将","通天师爷"}
  local 模型=模型范围[取随机数(1,#模型范围)]
  local 名称=名称范围[取随机数(1,#名称范围)]
  local 技能范围 = {{"横扫千军","善恶有报"},{"三昧真火","地狱烈火","飞砂走石"},{"龙卷雨击","龙腾","龙吟"},{"落叶萧萧","雷击","奔雷咒"},{"失心符","定身符","反间之计"},{"推气过宫"},{"天雷斩"}}
  local 技能随机=技能范围[取随机数(1,#技能范围)]
  for i=6,10 do
    模型=模型范围[取随机数(1,#模型范围)]
    名称=名称范围[取随机数(1,#名称范围)]
    技能随机=技能范围[取随机数(1,#技能范围)]
    战斗单位[i]={名称=名称,模型=模型,饰品=true,伤害=等级*10+500,气血=等级*50,灵力=等级*5+500,速度=等级*2.3,防御=等级*3,法防=等级*3,躲闪=等级*4,魔法=200000,等级=等级,攻击修炼=math.floor(取人物修炼等级上限(等级)),
  防御修炼=math.floor(取人物修炼等级上限(等级)),法术修炼=math.floor(取人物修炼等级上限(等级)),抗法修炼=math.floor(取人物修炼等级上限(等级)),技能={"魔之心","法术连击"},主动技能=取随机法术(5)}
  end
  return 战斗单位
end

function 战斗准备类:桃园狸猫(任务id,玩家id)
  local 战斗单位={}
  for n=1,5 do
  战斗单位[n]={
   名称="狸猫"
  ,模型="浣熊"
  ,伤害=50
  ,气血=200
  ,灵力=10
  ,速度=50
  ,防御=1
  ,法防=10
  ,躲闪=100
  ,魔法=200
  ,等级=5
  ,技能={"连击"}
  ,主动技能={}
  }
  end
  return 战斗单位
end

function 战斗准备类:虎子战斗(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="僵尸虎子"
  ,模型="僵尸"
  ,伤害=150
  ,气血=2000
  ,灵力=1
  ,速度=50
  ,防御=10
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,等级=10
  ,技能={"必杀"}
  ,主动技能={"尸腐毒","判官令","高级连击"}
  }
  战斗单位[2]={
  名称="迷惘幽灵"
  ,模型="幽灵"
  ,伤害=100
  ,气血=1500
  ,灵力=1
  ,速度=50
  ,防御=10
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,等级=10
  ,技能={"必杀"}
  ,主动技能={"横扫千军","后发制人"}
  }
  战斗单位[3]={
  名称="海边妖怪"
  ,模型="骷髅怪"
  ,伤害=250
  ,气血=1500
  ,灵力=150
  ,速度=50
  ,防御=10
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,等级=10
  ,技能={"魔之心","反击"}
  ,主动技能={"水攻","高级连击"}
  }
  return 战斗单位
end

function 战斗准备类:梦战灵鹤(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="三清"
  ,模型="灵鹤"
  ,伤害=300
  ,气血=2000
  ,灵力=150
  ,速度=100
  ,防御=100
  ,法防=150
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级法术暴击"}
  ,主动技能={"五雷轰顶","雷霆万钧","地狱烈火"}
  }
  战斗单位[2]={
  名称="三清分身"
  ,模型="灵鹤"
  ,伤害=300
  ,气血=500
  ,灵力=100
  ,速度=100
  ,防御=10
  ,法防=10
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"法术暴击"}
  ,主动技能={"烈火"}
  }
  战斗单位[3]={
  名称="三清分身"
  ,模型="灵鹤"
  ,伤害=300
  ,气血=500
  ,灵力=100
  ,速度=100
  ,防御=10
  ,法防=10
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"法术暴击"}
  ,主动技能={"烈火"}
  }
  return 战斗单位
end

function 战斗准备类:梦战灵鹤2(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="三清真身"
  ,模型="进阶灵鹤"
  ,伤害=250
  ,气血=3000
  ,灵力=50
  ,速度=100
  ,防御=200
  ,法防=50
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"必杀"}
  ,主动技能={"天神护法","天雷斩","金刚镯"}
  }
  return 战斗单位
end

function 战斗准备类:梦战江南小盗(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="江南小盗"
  ,模型="强盗"
  ,伤害=350
  ,气血=3000
  ,灵力=100
  ,速度=150
  ,防御=150
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级必杀","高级感知","高级驱鬼","高级反击"}
  ,主动技能={"高级连击","力劈华山","善恶有报"}
  }
  for n=2,5 do
  战斗单位[n]={
   名称="江南小小盗"
  ,模型="山贼"
  ,伤害=300
  ,气血=1000
  ,灵力=100
  ,速度=100
  ,防御=100
  ,法防=50
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级连击","必杀","高级反击"}
  ,主动技能={}
  }
  end
  return 战斗单位
end

function 战斗准备类:梦战大大龟(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="大大龟"
  ,模型="大海龟"
  ,伤害=400
  ,气血=8000
  ,灵力=100
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级反击","高级再生"}
  ,主动技能={"壁垒击破","剑荡四方"}
  }
  战斗单位[2]={
   名称="果毛虫"
  ,模型="海毛虫"
  ,伤害=350
  ,气血=5000
  ,灵力=100
  ,速度=100
  ,防御=150
  ,法防=50
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级连击","高级必杀","高级毒","嗜血追击"}
  ,主动技能={}
  }
  return 战斗单位
end

function 战斗准备类:梦战绿皮蛙(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="绿皮蛙"
  ,模型="巨蛙"
  ,伤害=400
  ,气血=8000
  ,灵力=400
  ,速度=200
  ,防御=100
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,等级=20
  ,技能={"高级法术暴击","高级法术连击"}
  ,主动技能={"水攻","水漫金山"}
  }
  for n=2,5 do
  战斗单位[n]={
   名称="绿皮蛙分身"
  ,模型="巨蛙"
  ,伤害=300
  ,气血=3000
  ,灵力=100
  ,速度=100
  ,防御=100
  ,法防=50
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=20
  ,变异=true
  ,技能={}
  ,主动技能={"烟雨剑法","弱点击破"}
  }
end
  return 战斗单位
end

function 战斗准备类:梦战屈原(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="屈原"
  ,模型="地藏王"
  ,伤害=300
  ,气血=15000
  ,灵力=150
  ,速度=150
  ,防御=150
  ,法防=150
  ,躲闪=100
  ,魔法=20000
  ,等级=30
  ,不可封印=true
  ,技能={"高级法术暴击","高级法术连击"}
  ,主动技能={"阎罗令","尸腐毒","判官令"}
  }
  return 战斗单位
end

function 战斗准备类:梦战狂盗(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="狂盗"
  ,模型="强盗"
  ,伤害=500
  ,气血=15000
  ,灵力=150
  ,速度=150
  ,防御=150
  ,法防=150
  ,躲闪=100
  ,魔法=20000
  ,等级=30
  ,变异=true
  ,不可封印=true
  ,技能={"高级必杀","高级吸血"}
  ,主动技能={"变身","狮搏","鹰击","连环击"}
  }
  return 战斗单位
end

function 战斗准备类:梦战黄狮王(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="黄狮王"
  ,模型="巨魔王"
  ,角色=true
  ,武器=取武器数据("五丁开山",140)
  ,伤害=999
  ,气血=99999
  ,灵力=999
  ,速度=999
  ,防御=999
  ,法防=999
  ,躲闪=999
  ,魔法=20000
  ,等级=99
  ,不可封印=true
  ,技能={"高级法术暴击"}
  ,主动技能={"摇头摆尾","无敌牛虱"}
  }
  return 战斗单位
end

function 战斗准备类:梦战马全有(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="马全有"
  ,模型="山贼"
  ,伤害=650
  ,气血=30000
  ,灵力=100
  ,速度=150
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=30
  ,不可封印=true
  ,技能={"高级感知"}
  ,主动技能={"破血狂攻","狮搏","鹰击","连环击"}
  }
  for n=2,5 do
  战斗单位[n]={
   名称="被抓的海毛虫"
  ,模型="海毛虫"
  ,伤害=500
  ,气血=15000
  ,灵力=500
  ,速度=150
  ,防御=200
  ,法防=10
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=30
  ,变异=true
  ,技能={"驱鬼"}
  ,主动技能=取随机法术(10)
  }
end

  return 战斗单位
end

function 战斗准备类:梦战海盗头子(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="海绵宝宝 "
  ,模型="强盗"
  ,伤害=700
  ,气血=30000
  ,灵力=100
  ,速度=150
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=40
  ,不可封印=true
  ,技能={"高级感知","高级驱鬼"}
  ,主动技能={"天崩地裂","翻江搅海","善恶有报"}
  }

    战斗单位[2]={
   名称="派大星"
  ,模型="海星"
  ,伤害=300
  ,气血=30000
  ,灵力=500
  ,速度=150
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=40
  ,技能={"高级感知"}
  ,主动技能={"推气过宫","唧唧歪歪"}
  }

    战斗单位[3]={
   名称="章鱼哥 "
  ,模型="章鱼"
  ,伤害=300
  ,气血=30000
  ,灵力=500
  ,速度=70
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=40
  ,不可封印=true
  ,技能={"高级感知"}
  ,主动技能={"失心符","失魂符","定身符","夜舞倾城"}
  }

  return 战斗单位
end

function 战斗准备类:梦战浪鬼(任务id,玩家id)
  local 战斗单位={}
  local 随机阵法 = {"天覆阵"}
  战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
   名称="浪鬼"
  ,模型="进阶夜罗刹"
  ,伤害=700
  ,气血=30000
  ,灵力=100
  ,速度=200
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=40
  ,不可封印=true
  ,技能={"高级感知"}
  ,主动技能={"雨落寒沙","死亡召唤","满天花雨"}
  }

    战斗单位[2]={
   名称="浪妖"
  ,模型="夜罗刹"
  ,伤害=600
  ,气血=20000
  ,灵力=500
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=35
  ,技能={"高级感知"}
  ,主动技能={"横扫千军"}
  }

    战斗单位[3]={
   名称="浪妖 "
  ,模型="夜罗刹"
  ,伤害=600
  ,气血=20000
  ,灵力=500
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=35
  ,技能={"高级感知"}
  ,主动技能={"横扫千军"}
  }

  for n=4,10 do
  战斗单位[n]={
   名称="浪女"
  ,模型="镜妖"
  ,伤害=500
  ,气血=10000
  ,灵力=500
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=30
  ,技能={"驱鬼"}
  ,主动技能=取随机法术(15)
  }
end
  return 战斗单位
end

function 战斗准备类:洛树妖(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="洛树妖"
  ,模型="树怪"
  ,伤害=800
  ,气血=10000
  ,灵力=700
  ,速度=200
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=45
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知"}
  ,主动技能={"地狱烈火","烈火","八凶法阵"}
  }

  for n=2,10 do
  战斗单位[n]={
   名称="树怪喽啰"
  ,模型="树怪"
  ,伤害=800
  ,气血=5000
  ,灵力=700
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=45
  ,技能={"驱鬼"}
  ,主动技能=取随机法术(15)
  }
end
  return 战斗单位
end

function 战斗准备类:赌徒喽啰(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="赌徒大喽啰"
  ,模型="赌徒"
  ,伤害=800
  ,气血=10000
  ,灵力=700
  ,速度=200
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=45
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知"}
  ,主动技能={"横扫千军","破釜沉舟","后发制人"}
  }

  for n=2,10 do
  战斗单位[n]={
   名称="赌徒小喽啰"
  ,模型="赌徒"
  ,伤害=800
  ,气血=5000
  ,灵力=700
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=45
  ,技能={"驱鬼"}
  ,主动技能=取随机法术(15)
  }
end
  return 战斗单位
end

function 战斗准备类:江州县令(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="江州衙役"
  ,模型="护卫"
  ,伤害=800
  ,气血=10000
  ,灵力=700
  ,速度=200
  ,防御=250
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=45
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知"}
  ,主动技能={"天崩地裂","翻江搅海","浪涌"}
  }

  for n=2,10 do
  战斗单位[n]={
   名称="江州衙役"
  ,模型="护卫"
  ,伤害=800
  ,气血=5000
  ,灵力=700
  ,速度=150
  ,防御=200
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=45
  ,技能={"驱鬼"}
  ,主动技能=取随机法术(15)
  }
end
  return 战斗单位
end

function 战斗准备类:江洋大盗(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="江洋大盗"
  ,模型="强盗"
  ,伤害=1000
  ,气血=50000
  ,灵力=700
  ,速度=500
  ,防御=500
  ,法防=100
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=59
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知","高级驱鬼"}
  ,主动技能={"变身","狮搏","鹰击","天雷斩"}
  }

  for n=2,10 do
  战斗单位[n]={
   名称="江洋小盗"
  ,模型="强盗"
  ,伤害=800
  ,气血=10000
  ,灵力=700
  ,速度=500
  ,防御=500
  ,法防=100
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=59
  ,技能={"高级感知","高级驱鬼"}
  ,主动技能=取随机法术(15)
  }
end
  return 战斗单位
end

function 战斗准备类:洛川鬼(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="洛川鬼"
  ,模型="骷髅怪"
  ,伤害=1500
  ,气血=100000
  ,灵力=100
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=69
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知","高级驱鬼","高级再生","高级吸血","高级鬼魂"}
  ,主动技能={"阎罗令","尸腐毒","六道无量"}
  }

  for n=2,3 do
  战斗单位[n]={
   名称="魔族小鬼"
  ,模型="僵尸"
  ,伤害=1300
  ,气血=50000
  ,灵力=100
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,技能={"高级感知","高级驱鬼","高级鬼魂"}
  ,主动技能={"百爪狂杀","六道无量","判官令"}
  }
end
  for n=4,5 do
  战斗单位[n]={
   名称="魔族小妖"
  ,模型="野鬼"
  ,伤害=1000
  ,气血=50000
  ,灵力=1200
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,技能={"高级感知","高级驱鬼","高级鬼魂"}
  ,主动技能={"水漫金山","地狱烈火","泰山压顶","奔雷咒"}
  }
end
  return 战斗单位
end

function 战斗准备类:妩媚狐仙(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="妩媚狐仙"
  ,模型="狐狸精"
  ,伤害=1500
  ,气血=200000
  ,灵力=100
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知","高级鬼魂","凝光炼彩"}
  ,主动技能={"天罗地网","偷龙转凤","善恶有报"}
  }
  return 战斗单位
end

function 战斗准备类:赌霸城(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="赌霸城"
  ,模型="赌徒"
  ,伤害=1800
  ,气血=200000
  ,灵力=1200
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,变异=true
  ,追加法术={[1]={等级=79,名称="飞砂走石"}}
  ,技能={"高级感知","高级法术暴击","苍鸾怒击","嗜血追击","理直气壮","高级必杀"}
  ,主动技能={}
  }
  return 战斗单位
end

function 战斗准备类:半阁守将(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="半阁守将"
  ,模型="天将"
  ,伤害=1800
  ,气血=100000
  ,灵力=100
  ,速度=500
  ,防御=100
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知","高级必杀","高级驱鬼","高级吸血","高级反击","高级反击","高级幸运"}
  ,主动技能={"天雷斩"}
  }

  for n=2,3 do
  战斗单位[n]={
   名称="半阁守兵"
  ,模型="天兵"
  ,伤害=1500
  ,气血=50000
  ,灵力=100
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,不可封印=true
  ,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级吸血"}
  ,主动技能={"横扫千军","力劈华山","善恶有报"}
  }
end
  return 战斗单位
end

function 战斗准备类:流氓兔(任务id,玩家id)
  local 战斗单位={}
  for n=1,10 do
  战斗单位[n]={
   名称="流氓兔"
  ,模型="兔子怪"
  ,伤害=1500
  ,气血=50000
  ,灵力=1
  ,速度=100
  ,防御=800
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=79
  ,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级吸血"}
  ,主动技能={"龙吟"}
  }
end
  return 战斗单位
end

function 战斗准备类:大雁塔塔主(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="大雁塔塔主"
  ,模型="风伯"
  ,伤害=1800
  ,气血=100000
  ,灵力=1300
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"风卷残云","落叶萧萧","冰川怒"}
  }

  for n=2,3 do
  战斗单位[n]={
   名称="守护神鸟"
  ,模型="雷鸟人"
  ,伤害=1500
  ,气血=50000
  ,灵力=1300
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,不可封印=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"奔雷咒","雷击"}
  }
end
  return 战斗单位
end

function 战斗准备类:大雁塔塔主2(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="大雁塔塔主"
  ,模型="风伯"
  ,伤害=1800
  ,气血=80000
  ,灵力=1400
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,变异=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"风卷残云","落叶萧萧","冰川怒"}
  }

  for n=2,3 do
  战斗单位[n]={
   名称="守护神鸟"
  ,模型="雷鸟人"
  ,伤害=1500
  ,气血=30000
  ,灵力=1400
  ,速度=500
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,不可封印=true
  ,饰品=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"奔雷咒","雷击"}
  }
end
  return 战斗单位
end

function 战斗准备类:大雁塔塔主3(任务id,玩家id)
  local 战斗单位={}
  战斗单位[1]={
   名称="大雁塔塔主"
  ,模型="进阶风伯"
  ,伤害=1800
  ,气血=60000
  ,灵力=1600
  ,速度=700
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,愤怒=99999
  ,魔法=20000
  ,等级=79
  ,不可封印=true
  ,变异=true
  ,饰品=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"风卷残云","落叶萧萧"}
  }

  for n=2,3 do
  战斗单位[n]={
   名称="守护神鸟"
  ,模型="进阶雷鸟人"
  ,伤害=1500
  ,气血=10000
  ,灵力=1600
  ,速度=700
  ,防御=500
  ,法防=1
  ,躲闪=100
  ,魔法=20000
  ,愤怒=99999
  ,等级=69
  ,不可封印=true
  ,饰品=true
  ,技能={"高级感知","高级法术连击","高级法术暴击","高级驱鬼"}
  ,主动技能={"奔雷咒"}
  }
end
  return 战斗单位
end

function 战斗准备类:卷帘大将1(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="卷帘大将",
  模型="沙僧",
  伤害=1600,
  气血=100000,
  灵力=100,
  速度=800,
  防御=800,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="狮驼岭",
  技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"},
  主动技能={"变身","鹰击","狮搏","连环击"}
  }
for n=2,5 do
战斗单位[n]={
名称="天兵喽罗"
,模型="天兵"
,伤害=1500
,气血=50000
,灵力=100
,速度=500
,防御=500
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="天宫"
,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
,主动技能={"天雷斩"}
}
end
 return 战斗单位
 end

 function 战斗准备类:卷帘大将2(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="卷帘大将(心魔)",
  模型="沙僧",
  伤害=3000,
  气血=100000,
  灵力=100,
  速度=800,
  防御=800,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="狮驼岭",
  技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"},
  主动技能={"变身","鹰击"}
  }
for n=2,6 do
战斗单位[n]={
名称="天兵喽罗"
,模型="天兵"
,伤害=1500
,气血=50000
,灵力=100
,速度=500
,防御=500
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="天宫"
,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
,主动技能={"天雷斩"}
}
end
 return 战斗单位
 end
function 战斗准备类:路人甲(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="路人甲",
  模型="赌徒",
  伤害=1500,
  气血=100000,
  灵力=100,
  速度=800,
  防御=500,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="女儿村",
  技能={"高级必杀","高级感知","高级反击","高级驱鬼","高级幸运"},
  主动技能={"雨落寒沙","满天花雨"}
  }
  战斗单位[2]={
  名称="花妖喽罗",
  模型="花妖",
  伤害=1000,
  气血=50000,
  灵力=800,
  速度=500,
  防御=1000,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="化生寺",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"推气过宫","唧唧歪歪"}
  }
for n=3,5 do
战斗单位[n]={
名称="雷鸟人喽啰"
,模型="雷鸟人"
,伤害=1300
,气血=50000
,灵力=100
,速度=500
,防御=500
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="女儿村"
,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
,主动技能={"飞花摘叶","满天花雨","似玉生香"}
}
end
 return 战斗单位
 end

function 战斗准备类:杨戬(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="撒豆成兵",
  模型="天兵",
  伤害=1500,
  气血=100000,
  灵力=1000,
  速度=800,
  防御=500,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="天宫",
  技能={"高级必杀","高级感知","高级反击","高级驱鬼","高级幸运"},
  主动技能={"天雷斩","错乱","地狱烈火"}
  }
  战斗单位[2]={
  名称="天兵喽罗",
  模型="天兵",
  伤害=1000,
  气血=50000,
  灵力=800,
  速度=500,
  防御=1000,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="普陀山",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"普渡众生","日光华"}
  }
  for n=3,5 do
  战斗单位[n]={
  名称="天兵喽罗"
  ,模型="天兵"
  ,伤害=1300
  ,气血=50000
  ,灵力=800
  ,速度=500
  ,防御=100
  ,法防=1
  ,躲闪=999
  ,愤怒=999
  ,魔法=9999
  ,等级=79
  ,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
  ,主动技能=取随机法术(15)
  }
  end
  return 战斗单位
  end

  function 战斗准备类:龙孙(任务id,玩家id)
  local 战斗单位={}
  local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="龙孙",
  模型="蛟龙",
  伤害=1500,
  气血=100000,
  灵力=1200,
  速度=800,
  防御=500,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="龙宫",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"龙卷雨击","水漫金山","龙腾"}
  }
  战斗单位[2]={
  名称="虾兵喽啰",
  模型="虾兵",
  伤害=1300,
  气血=50000,
  灵力=1,
  速度=500,
  防御=1000,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="五庄观",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"生命之泉","日月乾坤","飘渺式"}
  }
  for n=3,5 do
  战斗单位[n]={
  名称="龟丞相喽啰"
  ,模型="龟丞相"
  ,伤害=1300
  ,气血=50000
  ,灵力=1000
  ,速度=500
  ,防御=100
  ,法防=1
  ,躲闪=999
  ,愤怒=999
  ,魔法=9999
  ,等级=79
  ,技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"}
  ,主动技能={"龙卷雨击","水漫金山","龙腾"}
  }
  end
  return 战斗单位
  end

   function 战斗准备类:卷帘大将3(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="卷帘大将(心魔)",
  模型="沙僧",
  伤害=2000,
  气血=150000,
  灵力=100,
  速度=800,
  防御=800,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=9999,
  饰品=true,
  等级=79,
  不可封印=true,
  门派="狮驼岭",
  技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"},
  主动技能={"变身","鹰击","狮搏","连环击"}
  }
for n=2,6 do
战斗单位[n]={
名称="天兵喽罗"
,模型="天兵"
,伤害=1500
,气血=80000
,灵力=100
,速度=500
,防御=500
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="天宫"
,技能={"高级必杀","高级感知","高级驱鬼","高级幸运"}
,主动技能={"天雷斩"}
}
end
 return 战斗单位
 end

function 战斗准备类:玄奘分身(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
 战斗单位.阵法="虎翼阵"
  战斗单位[4]={
  名称="程咬金",
  模型="程咬金",
  伤害=1800,
  气血=20000,
  灵力=500,
  速度=200,
  防御=500,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="大唐官府",
  技能={"高级必杀","高级感知","高级驱鬼"},
  主动技能={"破釜沉舟","横扫千军","杀气诀"}
  }
  战斗单位[5]={
  名称="二郎神",
  模型="二郎神",
  伤害=1500,
  气血=20000,
  灵力=500,
  速度=200,
  防御=400,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="凌波城",
  技能={"高级必杀","高级感知","高级驱鬼"},
  主动技能={"翻江搅海","天崩地裂"}
  }
  战斗单位[6]={
  名称="大大王",
  模型="大大王",
  伤害=1100,
  气血=20000,
  灵力=500,
  速度=300,
  防御=400,
  愤怒=9999,
  法防=300,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="狮驼岭",
  技能={"高级必杀","高级感知","高级驱鬼"},
  主动技能={"变身","鹰击","连环击"}
  }
  战斗单位[1]={
  名称="东海龙王",
  模型="东海龙王",
  伤害=1000,
  气血=20000,
  灵力=1000,
  速度=300,
  防御=350,
  愤怒=9999,
  法防=260,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="龙宫",
  技能={"法术连击","高级感知","高级法术暴击","高级驱鬼"},
  主动技能={"龙卷雨击","二龙戏珠","亢龙归海"}
  }
  战斗单位[2]={
  名称="牛魔王",
  模型="牛魔王",
  伤害=1500,
  气血=20000,
  灵力=1100,
  速度=200,
  防御=400,
  愤怒=9999,
  法防=400,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="魔王寨",
  技能={"法术连击","高级感知","高级法术暴击","高级驱鬼"},
  主动技能={"摇头摆尾","火甲术","飞砂走石"}
  }
  战斗单位[3]={
  名称="巫奎虎",
  模型="巫奎虎",
  伤害=2000,
  气血=20000,
  灵力=1000,
  速度=350,
  防御=400,
  愤怒=9999,
  法防=400,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="神木林",
  技能={"法术连击","高级感知","高级法术暴击","高级驱鬼"},
  主动技能={"风卷残云","落叶萧萧","雾杀"}
  }
  战斗单位[7]={
  名称="空度禅师",
  模型="空度禅师",
  伤害=1000,
  气血=30000,
  灵力=1000,
  速度=300,
  防御=400,
  愤怒=9999,
  法防=400,
  躲闪=999,
  魔法=9999,
  等级=79,
  门派="化生寺",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"唧唧歪歪","推气过宫","金刚护法","金刚护体"}
  }
  战斗单位[8]={
  名称="地涌夫人",
  模型="地涌夫人",
  伤害=1000,
  气血=30000,
  灵力=1000,
  速度=300,
  防御=400,
  愤怒=9999,
  法防=400,
  躲闪=999,
  魔法=9999,
  等级=79,
  门派="无底洞",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"夺命咒","地涌金莲"}
  }
  战斗单位[9]={
  名称="镇元大仙",
  模型="镇元大仙",
  伤害=2000,
  气血=20000,
  灵力=2000,
  速度=350,
  防御=500,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="五庄观",
  技能={"高级必杀","高级感知","高级驱鬼","高级幸运"},
  主动技能={"飘渺式","日月乾坤","日月乾坤","日月乾坤"}
  }
  战斗单位[10]={
  名称="孙婆婆",
  模型="孙婆婆",
  伤害=3000,
  气血=20000,
  灵力=1500,
  速度=600,
  防御=600,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="女儿村",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"雨落寒沙","一笑倾城","一笑倾城","一笑倾城"}
  }
 return 战斗单位
 end

 function 战斗准备类:空慈方丈(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
 local 武器造型=取天罡星武器造型(模型)
 local 模型="逍遥生"
  战斗单位[1]={
  名称="空慈方丈",
  模型="空度禅师",
  伤害=2000,
  气血=50000,
  灵力=2000,
  速度=800,
  防御=500,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="化生寺",
  技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"},
  主动技能={"唧唧歪歪","推气过宫","破碎无双","惊心一剑"}
  }
for n=2,10 do
武器造型=取天罡星武器造型(模型)
战斗单位[n]={
名称="化生寺弟子"
,模型="逍遥生"
,角色=true
,武器=取武器数据(武器造型.武器,武器造型.级别)
,伤害=2000
,气血=30000
,灵力=2000
,速度=600
,防御=500
,法防=500
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="化生寺"
,技能={"高级法术连击","高级感知","高级法术暴击","高级驱鬼","高级幸运"}
,主动技能={"唧唧歪歪","牛刀小试","金刚护体","金刚护法"}
}
end
 return 战斗单位
 end

function 战斗准备类:王福来(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="王福来",
  模型="大大王",
  伤害=2500,
  气血=50000,
  灵力=2000,
  速度=500,
  防御=300,
  愤怒=9999,
  法防=300,
  躲闪=999,
  魔法=9999,
  等级=79,
  不可封印=true,
  门派="狮驼岭",
  附加状态={[1]={等级=89,名称="变身"}},
  技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"},
  主动技能={"变身","鹰击","狮搏","连环击"}
  }
for n=2,10 do
local 武器造型={武器="八卦",级别=90}
战斗单位[n]={
名称="魔族弟子"
,模型="虎头怪"
,角色=true
,武器=取武器数据(武器造型.武器,武器造型.级别)
,伤害=2300
,气血=30000
,灵力=2000
,速度=450
,防御=300
,法防=300
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,门派="狮驼岭"
,附加状态={[1]={等级=89,名称="变身"}}
,技能={"高级必杀","高级感知","高级吸血","高级驱鬼","高级幸运"}
,主动技能={"变身","鹰击","象形"}
}
end
 return 战斗单位
 end

 function 战斗准备类:蓝火兽(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="蓝火兽",
  模型="古代瑞兽",
  变异=true,
  伤害=2500,
  气血=80000,
  灵力=2000,
  速度=600,
  防御=1,
  愤怒=9999,
  法防=1,
  躲闪=999,
  魔法=99999,
  等级=79,
  不可封印=true,
  技能={"高级法术暴击","高级法术连击","高级反击","高级土属性吸收","高级火属性吸收","高级雷属性吸收","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级感知"},
  主动技能={"泰山压顶","食指大动"}
  }
for n=2,10 do
战斗单位[n]={
名称="红火兽"
,模型="古代瑞兽"
,伤害=2300
,气血=50000
,灵力=2000
,速度=500
,防御=1
,法防=1
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,技能={"高级法术暴击","高级法术连击","高级反击","高级土属性吸收","高级火属性吸收","高级雷属性吸收","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级感知"}
,主动技能={"泰山压顶"}
}
end
 return 战斗单位
 end

  function 战斗准备类:吸血蝙蝠(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="吸血蝙蝠",
  模型="大蝙蝠",
  变异=true,
  伤害=2500,
  气血=80000,
  灵力=2000,
  速度=600,
  防御=800,
  愤怒=9999,
  法防=800,
  躲闪=999,
  魔法=99999,
  等级=79,
  不可封印=true,
  技能={"高级必杀","高级吸血","高级反击","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级隐身"},
  主动技能={"剑荡四方"}
  }
for n=2,10 do
战斗单位[n]={
名称="大蝙蝠"
,模型="大蝙蝠"
,伤害=2300
,气血=50000
,灵力=2000
,速度=500
,防御=800
,法防=800
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,技能={"高级必杀","高级吸血","高级反击","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级隐身"}
,主动技能={"剑荡四方"}
}
end
 return 战斗单位
 end

function 战斗准备类:肾宝狼(任务id,玩家id)
 local 战斗单位={}
 local 等级=玩家数据[玩家id].角色.数据.等级
  战斗单位[1]={
  名称="肾宝狼",
  模型="狼",
  变异=true,
  伤害=3000,
  气血=100000,
  灵力=2000,
  速度=600,
  防御=500,
  愤怒=9999,
  法防=500,
  躲闪=999,
  魔法=99999,
  等级=79,
  躲避减少=50,
  不可封印=true,
  追加法术={[1]={等级=175,名称="理直气壮"}},
  技能={"高级必杀","苍鸾怒击","高级连击","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级偷袭"},
  主动技能={}
  }
for n=2,10 do
战斗单位[n]={
名称="狼"
,模型="狼"
,伤害=3000
,气血=50000
,灵力=2000
,速度=500
,防御=500
,法防=500
,躲闪=999
,愤怒=999
,魔法=9999
,等级=79
,躲避减少=30
,追加法术={[1]={等级=175,名称="理直气壮"}}
,技能={"高级必杀","苍鸾怒击","高级连击","高级幸运","高级神迹","高级招架","高级永恒","高级驱鬼","高级偷袭"}
,主动技能={}
}
end
 return 战斗单位
 end

function 战斗准备类:取文韵李世民(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
 名称="李世民"
,模型="剑侠客"
,伤害=等级*2+700
,愤怒=99999999
,气血=等级*200
,灵力=等级*5
,速度=等级*4
,防御=等级*15
,法防=等级
,躲闪=等级*6
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级偷袭","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"飞砂走石","龙卷雨击","破碎无双"}
}
  战斗单位[2]={
 名称="诡秘千疑"
,模型="幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*5
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","神迹","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,防御=等级*15
,法防=等级
,法术修炼=5
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,法术修炼=5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击","神迹"}
,主动技能=Q_门派法术["龙宫"]
}
 战斗单位[6]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="神封无量"
,模型="琴仙"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*30
,防御=等级*10
,法防=等级*30
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}

  战斗单位[9]={
 名称="长生不死"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*3
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知"}
,主动技能={"金刚护体","金刚护法","普度众生"}
}
  战斗单位[10]={
 名称="长生不老"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*等级*5
,灵力=等级*50
,速度=等级*3
,不可封印=true
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知","高级神迹"}
,主动技能={"推气过宫","罗汉金钟","圣灵之甲"}
}
  return 战斗单位
 end


 function 战斗准备类:取文韵砍木头(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
 名称="绿凤凰"
,模型="进阶凤凰"
,伤害=等级*2+700
,愤怒=99999999
,气血=等级*200
,灵力=等级*5
,速度=等级*4
,防御=等级*15
,法防=等级
,躲闪=等级*6
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级感知","高级驱鬼","高级必杀","高级幸运","高级偷袭","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"飞砂走石","龙卷雨击","破碎无双"}
}
  战斗单位[2]={
 名称="红凤凰"
,模型="凤凰"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*5
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级感知","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","神迹","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="诡秘千疑"
,模型="幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,防御=等级*15
,法防=等级
,法术修炼=5
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="诡秘千疑"
,模型="进阶幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,法术修炼=5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击","神迹"}
,主动技能=Q_门派法术["龙宫"]
}
 战斗单位[6]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="喽罗"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="神封无量"
,模型="琴仙"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*30
,防御=等级*10
,法防=等级*30
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}

  战斗单位[9]={
 名称="长生不死"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*3
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知"}
,主动技能={"金刚护体","金刚护法","普度众生"}
}
  战斗单位[10]={
 名称="长生不老"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*等级*5
,灵力=等级*50
,速度=等级*3
,不可封印=true
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知","高级神迹"}
,主动技能={"推气过宫","罗汉金钟","圣灵之甲"}
}
  return 战斗单位
 end


function 战斗准备类:取文韵巡逻(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
 名称="文韵巡逻小怪"
,模型="鬼将"
,伤害=等级*2+700
,愤怒=99999999
,气血=等级*200
,灵力=等级*5
,速度=等级*4
,防御=等级*15
,法防=等级
,躲闪=等级*6
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级偷袭","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"飞砂走石","龙卷雨击","破碎无双"}
}
  战斗单位[2]={
 名称="文韵巡逻小怪"
,模型="幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*5
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="文韵巡逻小怪"
,模型="进阶幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","神迹","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="文韵巡逻小怪"
,模型="幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,防御=等级*15
,法防=等级
,法术修炼=5
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="文韵巡逻小怪"
,模型="进阶幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,法术修炼=5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击","神迹"}
,主动技能=Q_门派法术["龙宫"]
}
 战斗单位[6]={
 名称="文韵巡逻小怪"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="文韵巡逻小怪"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="文韵巡逻小怪"
,模型="琴仙"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*30
,防御=等级*10
,法防=等级*30
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}

  战斗单位[9]={
 名称="文韵巡逻小怪"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*3
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知"}
,主动技能={"金刚护体","金刚护法","普度众生"}
}
  战斗单位[10]={
 名称="文韵巡逻小怪"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*等级*5
,灵力=等级*50
,速度=等级*3
,不可封印=true
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知","高级神迹"}
,主动技能={"推气过宫","罗汉金钟","圣灵之甲"}
}
  return 战斗单位
 end


 function 战斗准备类:取文韵护送西域使者(任务id,玩家id)
 local 战斗单位={}
 local 等级=取队伍最高等级数(玩家数据[玩家id].队伍,玩家id)
 local 随机阵法 = {"天覆阵","地载阵","风扬阵","云垂阵","龙飞阵","虎翼阵","鸟翔阵","蛇蟠阵","鹰啸阵","雷绝阵"}
战斗单位.阵法=随机阵法[取随机数(1,#随机阵法)]
  战斗单位[1]={
 名称="西域拦截小怪"
,模型="鬼将"
,伤害=等级*2+700
,愤怒=99999999
,气血=等级*200
,灵力=等级*5
,速度=等级*4
,防御=等级*15
,法防=等级
,躲闪=等级*6
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级驱鬼","高级必杀","高级幸运","高级偷袭","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能={"飞砂走石","龙卷雨击","破碎无双"}
}
  战斗单位[2]={
 名称="西域拦截小怪"
,模型="幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*5
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
 战斗单位[3]={
 名称="西域拦截小怪"
,模型="进阶幽灵"
,变异=true
,伤害=等级*2+700
,气血=等级*100
,灵力=等级*5
,速度=等级*5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知","神迹","高级必杀","高级幸运","高级偷袭"}
,主动技能=Q_门派法术["大唐官府"]
}
  战斗单位[4]={
 名称="西域拦截小怪"
,模型="幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,防御=等级*15
,法防=等级
,法术修炼=5
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击"}
,主动技能=Q_门派法术["魔王寨"]
}
  战斗单位[5]={
 名称="西域拦截小怪"
,模型="进阶幽灵"
,伤害=等级*7
,气血=等级*100
,灵力=等级*5
,速度=等级*2
,法术修炼=5
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"神佑复生","高级魔之心","高级法术连击","高级法术暴击","神迹"}
,主动技能=Q_门派法术["龙宫"]
}
 战斗单位[6]={
 名称="西域拦截小怪"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[7]={
 名称="西域拦截小怪"
,模型="野猪精"
,伤害=等级*2+800
,气血=等级*100
,灵力=等级*5
,速度=等级*3
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能=取随机法术(3)
}
  战斗单位[8]={
 名称="西域拦截小怪"
,模型="琴仙"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*30
,防御=等级*10
,法防=等级*30
,躲闪=等级*10
,魔法=等级*500*10
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级感知"}
,主动技能={"失心符","定身符","似玉生香","反间之计"}
}

  战斗单位[9]={
 名称="西域拦截小怪"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*200
,灵力=等级*5
,速度=等级*3
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知"}
,主动技能={"金刚护体","金刚护法","普度众生"}
}
  战斗单位[10]={
 名称="西域拦截小怪"
,模型="进阶龙龟"
,伤害=等级*2+800
,气血=等级*等级*5
,灵力=等级*50
,速度=等级*3
,不可封印=true
,愤怒=99999999
,防御=等级*15
,法防=等级
,躲闪=等级*10
,魔法=等级*500*100
,等级=等级
,攻击修炼=math.floor(取人物修炼等级上限(等级))
,防御修炼=math.floor(取人物修炼等级上限(等级))
,法术修炼=math.floor(取人物修炼等级上限(等级))
,抗法修炼=math.floor(取人物修炼等级上限(等级))
,技能={"高级防御","高级感知","高级神迹"}
,主动技能={"推气过宫","罗汉金钟","圣灵之甲"}
}
  return 战斗单位
 end

return 战斗准备类