-- @Author: baidwwy
-- @Date:   2023-03-10 11:49:53
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-05-17 12:35:02

local 管理工具类 = class()


function 管理工具类:初始化()

end
function 管理工具类:数据处理(ID,序号,内容)


 if 内容==nil or 内容=="" then
     --self:断开连接(id,"通讯密码错误")
    return
  end


if 内容=="" or 内容==nil then
    self:断开连接(id,"通讯密码错误")
    return
  end


 --local 序号=数据[1]+0

 local 连接id=ID

 __C客户信息[连接id] = {IP = IP,认证=os.time(),PORT = PORT}
 --if __C客户信息[连接id].管理==nil or 序号==1.22 then --认证账号
 if 序号==6201.22 then --认证账号

    local 账号=内容.账号
    local 密码=内容.密码
          __C客户信息[连接id].认证=nil
          __C客户信息[连接id].管理=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","管理")+0
          __C客户信息[连接id].点数=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点数")+0
          __C客户信息[连接id].账号=账号

     --print(账号)--嘎嘎

       if f函数.文件是否存在([[data/]]..账号)==false then

          发送数据(连接id,998,"这样的账号并不存在")
          __S服务:断开连接(连接id)
          __C客户信息[连接id]=nil

           return
       elseif 密码~=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","密码") then
          发送数据(连接id,998,"密码错误")
          __S服务:断开连接(连接id)
          __C客户信息[连接id]=nil

           return
        elseif f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","管理")=="0" then
          发送数据(连接id,998,"你的账号尚未开通此工具的使用权限")
          __S服务:断开连接(连接id)
          __C客户信息[连接id]=nil

           return

       else
          __C客户信息[连接id].认证=nil
          __C客户信息[连接id].管理=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","管理")+0
          __C客户信息[连接id].点数=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点数")+0
          __C客户信息[连接id].账号=账号
--嘎嘎妹1551337333
          --发送数据1(连接id,2,__C客户信息[连接id].管理.."@-@"..__C客户信息[连接id].点数.."@-@"..__C客户信息[连接id].账号)
          --发送数据(连接id,998,"你已经登录了游戏,请勿多开")
          发送数据(连接id,10086,{管理=__C客户信息[连接id].管理,点数=__C客户信息[连接id].点数,账号=__C客户信息[连接id].账号})

       end
   elseif 序号==2 then

      local 充值账号=数据[2]
      local 充值点数=数据[3]+0
      local 充值类型=数据[4]


      local 账号= __C客户信息[连接id].账号
      __C客户信息[连接id].点数=f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点数")+0
      if f函数.文件是否存在([[data/]]..充值账号)==false then

          发送数据1(连接id,3,"为["..充值账号.."]充值失败，原因为该账号不存在。")
          return

       elseif  __C客户信息[连接id].点数<充值点数 then
         发送数据1(连接id,3,"为["..充值账号.."]充值失败，原因为你没有那么多的点数。")
          return
       elseif 充值类型=="点数" and __C客户信息[连接id].管理~=1 and __C客户信息[连接id].管理~=2 then
          发送数据1(连接id,3,"为["..充值账号.."]充值失败，原因为点数充值功能仅限于总代理使用。")
          return
         end
      local 单价=0
      if 充值类型=="仙玉" then

         单价=10
        elseif 充值类型=="银子" then

         单价=100000

       elseif 充值类型=="储备" then

         单价=500000
       elseif 充值类型=="点数" then
         单价=1

         end
      local 充值数额=充值点数*单价
      __C客户信息[连接id].点数=__C客户信息[连接id].点数-充值点数
      f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点数",__C客户信息[连接id].点数)
      local 管理日志=""
      if  f函数.文件是否存在([[data/]]..账号..[[/管理记录.txt]])then
          管理日志=读入文件([[data/]]..账号..[[/管理记录.txt]])
      end

      管理日志=管理日志..format("%s：为账号[%s]充值%s%s,剩余点数为%s",时间转换(os.time()),充值账号,充值数额,充值类型,__C客户信息[连接id].点数).."换行符"
      写出文件([[data/]]..账号..[[/管理记录.txt]],管理日志)

      if 充值类型=="仙玉" then

         local 仙玉=f函数.读配置(程序目录..[[data\]]..充值账号..[[\账号信息.txt]],"账号配置","仙玉")+充值数额
         f函数.写配置(程序目录..[[data\]]..充值账号..[[\账号信息.txt]],"账号配置","仙玉",仙玉)


        else

         local 仙玉=f函数.读配置(程序目录..[[data\]]..充值账号..[[\账号信息.txt]],"账号配置",充值类型)+充值数额
         f函数.写配置(程序目录..[[data\]]..充值账号..[[\账号信息.txt]],"账号配置",充值类型,仙玉)

         end
      local 充值日志=""
      if  f函数.文件是否存在([[data/]]..充值账号..[[/充值记录.txt]])then
          充值日志=读入文件([[data/]]..充值账号..[[/充值记录.txt]]).."#换行符"
      end

      充值日志=充值日志..format("%s：账号[%s]为本账号充值%s%s,剩余点数为%s",时间转换(os.time()),账号,充值数额,充值类型,__C客户信息[连接id].点数)
      写出文件([[data/]]..充值账号..[[/充值记录.txt]],充值日志)
      发送数据1(连接id,3,format("%s：为账号[%s]充值%s%s,剩余点数为%s",时间转换(os.time()),充值账号,充值数额,充值类型,__C客户信息[连接id].点数))

      发送数据1(连接id,2,__C客户信息[连接id].管理.."@-@"..__C客户信息[连接id].点数.."@-@"..__C客户信息[连接id].账号)

    elseif 序号==3 then
      local 账号= __C客户信息[连接id].账号
      local 管理日志="没有查询到关于此账号的记录"
      if  f函数.文件是否存在([[data/]]..账号..[[/管理记录.txt]])then
          管理日志=读入文件([[data/]]..账号..[[/管理记录.txt]])
      end
       发送数据1(连接id,4,管理日志)
       发送数据1(连接id,2,__C客户信息[连接id].管理.."@-@"..__C客户信息[连接id].点数.."@-@"..__C客户信息[连接id].账号)


    else
     if __C客户信息[连接id].管理~=1 then --非管理权限直接断开

          __S服务:断开连接(连接id)
          __C客户信息[连接id]=nil

        elseif 序号==4 then
          local 账号=数据[2]
         if f函数.文件是否存在([[data/]]..账号)==false then

             发送数据1(连接id,1,"该账号不存在。")
             return
            end

           local 临时文件=读入文件([[data/]]..账号..[[/信息.txt]])
           local 写入信息=table.loadstring(临时文件)
           local 发送信息=""
           for n=1,#写入信息 do

              local 读取文件=读入文件([[data/]]..账号..[[/]]..写入信息[n]..[[/角色.txt]])
              local 还原数据=table.loadstring(读取文件)
              local 日期=还原数据.出生日期
              if 日期==nil then 日期=0 end
              发送信息=发送信息..写入信息[n].."*-*"..还原数据.名称.."*-*"..还原数据.等级.."*-*"..还原数据.门派.."*-*"..时间转换(日期).."@-@"


             end
          if 发送信息=="" then

             发送信息="该账号尚未建立游戏角色"

             end
          发送数据1(连接id,5,发送信息)
       elseif 序号==5 then
          local 账号=数据[2]
          local id=数据[3]
          发送数据1(连接id,6,self:取日志数量(账号,id).."")
       elseif 序号==6 then
          local 账号=数据[2]
          local id=数据[3]
          local 页数=数据[4]
            if f函数.文件是否存在([[data/]]..账号..[[/]]..id..[[/日志记录/]]..页数..".txt")==false then

             发送数据1(连接id,1,"该页记录不存在。")
             return
            end
         发送数据1(连接id,7,读入文件([[data/]]..账号..[[/]]..id..[[/日志记录/]]..页数..".txt"))

       elseif 序号==7 then
          local 账号=数据[2]
          local id=数据[3]
            if f函数.文件是否存在([[data/]]..账号..[[/]].."消费记录.txt")==false then

             发送数据1(连接id,7,"该记录不存在。")
             return
            end
         发送数据1(连接id,7,读入文件([[data/]]..账号..[[/]].."消费记录.txt"))


        elseif 序号==8 then
          local 账号=数据[2]
          local id=数据[3]
            if f函数.文件是否存在([[data/]]..账号..[[/]].."充值记录.txt")==false then

             发送数据1(连接id,7,"该记录不存在。")
             return
            end
         发送数据1(连接id,7,读入文件([[data/]]..账号..[[/]].."充值记录.txt"))
        elseif 序号==9 then
          local 选中=数据[2]+0
         if 选中==0 then
              聊天监控[连接id]=nil
              发送数据1(连接id,8,"-------------------关闭监控-------------------")
         else
             聊天监控[连接id]=true
             发送数据1(连接id,8,"-------------------开始监控-------------------")
          end

        elseif 序号==10 then

          local 账号=数据[2]
          local id=数据[3]
            if f函数.文件是否存在([[data/]]..账号..[[/]].."账号信息.txt")==false then

             发送数据1(连接id,7,"该账号不存在。")
             return
            end
           if f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","推广礼包")=="1" then

             发送数据1(连接id,7,"该账号已经拥有此礼包了。")
             return

             end
          f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","推广礼包","1")
          发送数据1(连接id,7,账号.."添加推广礼包成功。")
        elseif 序号==11 then

          local 账号=数据[2]
          local id=数据[3]
            if f函数.文件是否存在([[data/]]..账号..[[/]].."账号信息.txt")==false then

             发送数据1(连接id,7,"该账号不存在。")
             return
            end
           if f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","测试礼包")=="1" then

             发送数据1(连接id,7,"该账号已经拥有此礼包了。")
             return

             end
          f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","测试礼包","1")
          发送数据1(连接id,7,账号.."添加测试礼包成功。")
        elseif 序号==12 then
         local 账号=数据[2]
         local id=数据[3]+0
         if 玩家数据[id]==nil then

              发送数据1(连接id,7,id.."当前并没有在线记录。")
              return

            else

            -- 发送数据(玩家数据[id].连接id,998,"您的该角色已被管理员强制下线，具体原因请联系管理员！")
             __S服务:发送(服务端参数.网关id,玩家数据[id].连接id,table.tostring({序号=998,内容="您的该角色已被管理员强制下线，具体原因请联系管理员！"}))
             系统处理类:断开游戏(id)
             发送数据1(连接id,7,id.."已被强制下线。")
             return


           end

       elseif 序号==13 then
         local 账号=数据[2]
         local id=数据[3]+0
         if 玩家数据[id]==nil then

              发送数据1(连接id,7,id.."当前并没有在线记录。")
              return

            elseif 玩家数据[id].战斗==0 then
              发送数据1(连接id,7,id.."该账号不在战斗中")
              return
            else

              if 玩家数据[id].队伍~=0 then
                 战斗准备类.战斗盒子[玩家数据[id].战斗]:结束战斗(0,玩家数据[id].队伍)
                else
                 战斗准备类.战斗盒子[玩家数据[id].战斗]:结束战斗(0,id)
                 end

             发送数据1(连接id,7,id.."已被强制退出战斗。")
             return


           end


        elseif 序号==14 then
         local 账号=数据[2]
         f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","封禁","1")
         self.临时文件=读入文件([[data/]]..账号..[[/信息.txt]])
         self.写入信息=table.loadstring(self.临时文件)
         local 下线id=""
          for n=1,#self.写入信息 do

             local id=self.写入信息[n]+0
             if 玩家数据[id]~=nil then

                 下线id=下线id..id.."、"
                  __S服务:发送(服务端参数.网关id,玩家数据[id].连接id,table.tostring({序号=998,内容="您的该角色已被管理员强制下线，具体原因请联系管理员！"}))
                 系统处理类:断开游戏(id)


               end



             end

            发送数据1(连接id,7,账号.."已被封禁，相关在线id已经被强制下线："..下线id)
            return

       elseif 序号==15 then
         local 账号=数据[2]
         f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","封禁","1")
         self.临时文件=读入文件([[data/]]..账号..[[/信息.txt]])
         self.写入信息=table.loadstring(self.临时文件)
         local ip=""
         local 下线id=""

          for n=1,#self.写入信息 do

             local id=self.写入信息[n]+0
             if 玩家数据[id]~=nil then

                 下线id=下线id..id.."、"
                  ip=玩家数据[id].ip
                  __S服务:发送(服务端参数.网关id,玩家数据[id].连接id,table.tostring({序号=998,内容="您的该角色已被管理员强制下线，具体原因请联系管理员！"}))
                 系统处理类:断开游戏(id)



               end



             end
           if ip~="" then

             ip封禁表[#ip封禁表+1]={ip=ip,时间=时间转换(os.time()),关联账号={[1]=账号}}
             for n, v in pairs(玩家数据) do

                  if 玩家数据[n].ip==ip then
                      f函数.写配置(程序目录..[[data\]]..玩家数据[n].账号..[[\账号信息.txt]],"账号配置","封禁","1")
                      ip封禁表[#ip封禁表].关联账号[#ip封禁表[#ip封禁表].关联账号+1]=玩家数据[n].账号

                      系统处理类:断开游戏(n)


                     end



                 end



             end
            发送数据1(连接id,7,账号.."已被封禁，相关在线id已经被强制下线："..下线id..",匹配的ip为："..ip)
            return






         elseif 序号==16 then
         local 账号=数据[2]
          f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","封禁","0")

          发送数据1(连接id,7,账号.."已被解除封禁状态")
          return
        elseif 序号==17 then

         local ip=数据[2]

         local 序列=0
         for n=1,#ip封禁表 do

             if ip封禁表[n].ip==ip then

                 序列=n

               end



           end


          if 序列==0 then

              发送数据1(连接id,7,ip.."该ip地址并未在黑名单中。")

            else
              table.remove(ip封禁表,序列)

             发送数据1(连接id,7,ip.."该ip地址已成功从服务器黑名单中移除。")


             end

        elseif 序号==18 then
         服务端参数.经验获得率=数据[2]+0
         f函数.写配置(程序目录.."配置文件.ini","主要配置","经验",服务端参数.经验获得率)
          广播消息({内容="#Y服务器当前经验倍率已调整为#R"..服务端参数.经验获得率.."#Y倍",频道="xt"})
          发送数据1(连接id,9,"服务器当前经验倍率已调整为"..服务端参数.经验获得率.."倍")
       elseif 序号==19 then
         local 账号=数据[2]
         local id=数据[3]+0
         local 名称=数据[4]
         local 参数=数据[6]
         if 玩家数据[id]==nil then

             发送数据1(连接id,7,"这个id当前不在线")
             return

            else

              local 数量
              if 数据[5]~=nil and 数据[5]~="" then

                  数量=数据[5]+0

                 end

             玩家数据[id].道具:给予道具(id,名称,数量,参数)
             常规提示(id,"#Y你获得了#R"..名称)
                发送数据1(连接id,7,id.."添加道具成功，道具名称为"..名称)


           end


      elseif 序号==20 then
         local 账号=数据[2]
         local id=数据[3]+0
         local 名称=数据[4]
         local 参数=数据[6]
         if 玩家数据[id]==nil then

             发送数据1(连接id,7,"这个id当前不在线")
             return

            else


             玩家数据[id].道具:给予法宝(id,名称)
             常规提示(id,"#Y你获得了#R"..名称)
             发送数据1(连接id,7,id.."添加法宝成功，法宝名称为"..名称)


           end


       elseif 序号==21 then

         local 数量=0
         local ip=0
         local ip表={}
          for n, v in pairs(玩家数据) do

              数量=数量+1
              local 重复=false
              for i=1,#ip表 do

                  if 玩家数据[n].ip==ip表[i] or 玩家数据[n].离线摊位 then

                      重复=true

                     end

                 end

               if 重复==false then

                  ip=ip+1
                  ip表[#ip表+1]=玩家数据[n].ip

                 end


              end
         发送数据1(连接id,10,数量.."@-@"..ip.."@-@"..服务端参数.连接数)
       elseif 序号==22 then

         local 名称=数据[2]
         local 语句="没有查找到此角色"
         for n=1,#名称数据 do


              if 名称数据[n].名称==名称 then

                  语句="查找到的数据如下：#分割符名称："..名称数据[n].名称.."#分割符账号："..名称数据[n].账号.."#分割符id："..名称数据[n].id


                 end


           end

          发送数据1(连接id,7,语句)

      elseif 序号==23 then
        发送公告(数据[2])

      elseif 序号==24 then
         local 账号=数据[2]
         local id=数据[3]+0
         local 名称=数据[4]
         local 等级=数据[5]+0
         local 参数=数据[6]+0
         if 玩家数据[id]==nil then

             发送数据1(连接id,7,"这个id当前不在线")
             return

            else


            -- 玩家数据[id].道具:给予法宝(id,名称)
             --常规提示(id,"#Y你获得了#R"..名称)
             self:取随机装备(id,名称,等级,参数)
             发送数据1(连接id,7,id.."添加装备成功，装备名称为"..名称)


           end
      elseif 序号==25 then
         local 账号=数据[2]
         local id=数据[3]+0
         玩家数据[id].道具:清空包裹(玩家数据[id].连接id,id)

      elseif 序号==26 then
         local 账号=数据[2]
         local id=数据[3]+0
         local 数额=数据[4]+0
         if 玩家数据[id]==nil then

             发送数据1(连接id,7,"这个id当前不在线")
             return

            else
             添加国庆活动积分(id,数额)

             发送数据1(连接id,7,id.."添加国庆活动积分成功，本次添加积分数量为"..数额)
           end

      elseif 序号==27 then
        local 账号=数据[2]
        local id=数据[3]+0
        local 数额=数据[4]+0
        if 玩家数据[id]==nil then
          发送数据1(连接id,7,"这个id当前不在线")
          return
        else
          if 妖魔积分[id]==nil then
            妖魔积分[id]={当前=0,总计=0,使用=0}
          end
            妖魔积分[id].当前=妖魔积分[id].当前+数额
            妖魔积分[id].总计=妖魔积分[id].总计+数额
            常规提示(id,"#Y/你获得了#R"..数额.."点妖魔积分#Y，妖魔积分可在长安城袁天罡处兑换奖励")

            发送数据1(连接id,7,id.."添加妖魔积分成功，本次添加积分数量为"..数额)
        end

      elseif 序号==28 then
        local 账号=数据[2]
        local id=数据[3]+0
        local 数额=数据[4]+0
        if 玩家数据[id]==nil then
          发送数据1(连接id,7,"这个id当前不在线")
          return
        else
          if 妖魔积分[id]==nil then
            妖魔积分[id]={当前=0,总计=0,使用=0}
          end
            玩家数据[id].角色.数据.比武积分.当前积分=玩家数据[id].角色.数据.比武积分.当前积分+数额
            常规提示(id,"#Y/你获得了#R"..数额.."点比武积分")
            发送数据1(连接id,7,id.."添加比武积分成功，本次添加积分数量为"..数额)
        end

      elseif 序号==29 then
        local 账号=数据[2]
        local id=数据[3]+0
        local 经验=数据[4]+0
        if 玩家数据[id]==nil then
          发送数据1(连接id,7,"这个id当前不在线")
          return
        else
            玩家数据[id].角色:GM添加经验(经验,"GM工具",1)

            发送数据1(连接id,7,id.."添加经验成功，本次添加经验为"..经验)
        end

      elseif 序号==100 then
        local 账号=数据[2]
        local id=数据[3]+0
        local rmb=数据[4]+0
        if 玩家数据[id]==nil then
          发送数据1(连接id,7,"这个id当前不在线")
          return
        else
            玩家数据[id].角色:添加rmb(rmb,"GM工具",1)

            发送数据1(连接id,7,id.."充值成功，本次添加rmb为"..rmb)
        end
      elseif 序号==101 then
        local 账号=数据[2]
        local id=数据[3]+0
        local rmb=数据[4]+0
        if 玩家数据[id].角色:扣除rmb(rmb,"GM工具",1) then
          发送数据1(连接id,7,id.."扣除成功，本次扣除rmb为"..rmb)
        else
          发送数据1(连接id,7,id.."扣除失败，玩家没有"..rmb.."点rmb积分")
        end
      elseif 序号==102 then
        local 账号=数据[2]
        local id=数据[3]+0
        local 称谓=数据[4]
        local 称谓描述=数据[5]
        if 称谓=="" then 发送数据1(连接id,7,id.."请填写称谓") return end
        玩家数据[id].角色:添加称谓(称谓,称谓描述,88)
        发送数据1(连接id,7,id.."称谓添加成功！")




--[[-----------------------------------------------------↓这一段添加到角色处理类↓----------------------------------------------

function 角色处理类:GM添加经验(数额,类型,提示)
 local 倍率=1
 local 之前银子=self.当前经验
 local 经验=math.floor(数额*倍率)
 self.当前经验=self.当前经验+经验
 发送数据(玩家数据[self.数字id].连接id,33,玩家数据[self.数字id].角色:取总数据())
 发送数据(玩家数据[self.数字id].连接id,38,{内容="你获得了"..经验.."点经验",频道="xt"})
 if 提示~=nil then
      常规提示(self.数字id,"#Y/GM给你添加了了"..经验.."点经验")
     end
self:日志记录(format("事件:获得经验,类型%s,数额%s,倍率%s,获得前%s,获得后%s",类型,数额,倍率,之前银子,self.当前经验))
 if 经验数据.排行[self.数字id]==nil then
   经验数据.排行[self.数字id]={id=self.数字id,名称=self.名称,经验=经验,门派=self.门派,等级=self.等级}
  else
   经验数据.排行[self.数字id].经验=经验数据.排行[self.数字id].经验+经验
   经验数据.排行[self.数字id].等级=self.等级
   经验数据.排行[self.数字id].门派=self.门派
   end
 end

--]]-----------------------------------------------------↑这一段添加到角色处理类↑----------------------------------------------

      elseif 序号==30 then --预留功能1（自定义管理）
任务处理类:开启宝藏山()
      elseif 序号==31 then --预留功能2（自定义管理）
任务处理类:开启迷宫()
      elseif 序号==32 then --预留功能3（自定义管理）
任务处理类:刷出年兽()
      elseif 序号==33 then --预留功能4（自定义管理）
任务处理类:开启游戏比赛()
      elseif 序号==34 then --预留功能5（自定义管理）
任务处理类:刷出星宿()
      elseif 序号==35 then --预留功能6（自定义管理）
任务处理类:刷出星君()
      elseif 序号==36 then --预留功能7（自定义管理）
任务处理类:开启地煞星()
      elseif 序号==37 then --预留功能8（自定义管理）
任务处理类:刷出50级BOOS()
      elseif 序号==38 then --预留功能9（自定义管理）
任务处理类:刷出100级BOOS()
      elseif 序号==39 then --预留功能10（自定义管理）
任务处理类:开启镖王活动()
      elseif 序号==40 then --预留功能11（自定义管理）
任务处理类:开启皇宫飞贼()
      elseif 序号==41 then --预留功能12（自定义管理）
任务处理类:刷出知了王()
      elseif 序号==42 then --预留功能13（自定义管理）
任务处理类:刷出特朗普()
      elseif 序号==43 then --预留功能14 自定义管理）
任务处理类:刷出多宝童子()
      elseif 序号==44 then --预留功能15（自定义管理）
任务处理类:刷出八大门派()
      elseif 序号==45 then --预留功能16（自定义管理）
任务处理类:刷出妖魔鬼怪()
      elseif 序号==46 then --预留功能17（自定义管理）

      elseif 序号==47 then --预留功能18（自定义管理）

      elseif 序号==48 then --预留功能19（自定义管理）

      elseif 序号==49 then --预留功能20（自定义管理）



      elseif 序号==50 then
        增加装备(数据,连接id)
      elseif 序号==51 then
        增加灵饰(数据,连接id)
      elseif 序号==52 then
        增加宝宝(数据,连接id)



      end
    end
end

function 增加装备(数据,连接id)
 装备类型 = 数据[4]--斧钺、枪矛 等
  if 装备类型 == "枪矛" then
    枪矛类(数据,连接id)
  elseif 装备类型 == "斧钺" then
    斧钺类(数据,连接id)
  elseif 装备类型 == "剑" then
    剑类(数据,连接id)
  elseif 装备类型 == "双短剑" then
    双短剑类(数据,连接id)
  elseif 装备类型 == "飘带" then
    飘带类(数据,连接id)
  elseif 装备类型 == "爪刺" then
    爪刺类(数据,连接id)
  elseif 装备类型 == "扇" then
    扇类(数据,连接id)
  elseif 装备类型 == "魔棒" then
    魔棒类(数据,连接id)
  elseif 装备类型 == "锤" then
    锤类(数据,连接id)
  elseif 装备类型 == "鞭" then
    鞭类(数据,连接id)
  elseif 装备类型 == "环圈" then
    环圈类(数据,连接id)
  elseif 装备类型 == "刀" then
    刀类(数据,连接id)
  elseif 装备类型 == "法杖" then
    法杖类(数据,连接id)
  elseif 装备类型 == "弓弩" then
    弓弩类(数据,连接id)
  elseif 装备类型 == "宝珠" then
    宝珠类(数据,连接id)
  elseif 装备类型 == "巨剑" then
    巨剑类(数据,连接id)
  elseif 装备类型 == "伞" then
    伞类(数据,连接id)
  elseif 装备类型 == "灯笼" then
    灯笼类(数据,连接id)
  elseif 装备类型 == "头盔" then
    男头类(数据,连接id)
  elseif 装备类型 == "发钗" then
    女头类(数据,连接id)
  elseif 装备类型 == "项链" then
    项链类(数据,连接id)
  elseif 装备类型 == "女衣" then
    女衣类(数据,连接id)
  elseif 装备类型 == "男衣" then
    男衣类(数据,连接id)
  elseif 装备类型 == "腰带" then
    腰带类(数据,连接id)
  elseif 装备类型 == "鞋子" then
    鞋子类(数据,连接id)
  end
end
function 男头类(数据,连接id)
  男头 = {["性别限制"]="男",["染色组"]={},["染色方案"]=0,["总类"]=2,["特技"]="凝气诀",["名称"]="紫金磐龙冠",["耐久"]=500,["子类"]=1,["识别码"]="4000237_1587386203_1341255_781",["特效"]="无级别限制",["级别限制"]=150,["分类"]=1,["魔法"]=234,["防御"]=145}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、男头矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特效二     = 数据[24]
  特效三     = 数据[25]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    男头.耐久 = 数据[26]+0
  else
    男头.耐久 = 500
  end
  if 数据[27]~= "" then
    男头.不可交易=true
  end
  if 数据[28]~= "" then
    男头.专用=id
  end
  男头.名称 = 装备名称
  男头.魔法 = 魔法值
  男头.防御 = 防御值
  男头.级别限制 = 等级
  男头.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    男头.特效 = 特效
  else
      男头.特效 = nil
  end
  if 特效二 ~= "" then
    男头.特效二 = 特效二
  else
      男头.特效二 = nil
  end
  if 特效三 ~= "" then
    男头.特效三 = 特效三
  else
      男头.特效三 = nil
  end
  if 特技 ~= "" then
    男头.特技 = 特技
  else
      男头.特技 = nil
  end
  if 制造者 ~= "" then
    男头.制造者 = 制造者.."强化打造"
  else
    男头.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    男头.体质 = 体力点
  end
  if 魔力点 ~= "" then
    男头.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    男头.力量 = 力量点
  end
  if 耐力点 ~= "" then
    男头.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    男头.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    男头.套装效果 = {}
    男头.套装效果[1] = 状态类型
    男头.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=男头
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特效二 = nil
  特效三 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  男头 = nil


end
function 女头类(数据,连接id)
  女头 = {["性别限制"]="女",["染色组"]={},["染色方案"]=0,["总类"]=2,["特技"]="命归术",["名称"]="鸾羽九凤冠",["识别码"]="4000240_1587386752_312815_767",["防御"]=121,["耐久"]=677,["子类"]=1,["魔法"]=253,["特效"]="无级别限制",["分类"]=1,["级别限制"]=140}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、女头矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    女头.耐久 = 数据[26]+0
  else
    女头.耐久 = 500
  end
  if 数据[27]~= "" then
    女头.不可交易=true
  end
  if 数据[28]~= "" then
    女头.专用=id
  end
  女头.名称 = 装备名称
  女头.魔法 = 魔法值
  女头.防御 = 防御值
  女头.级别限制 = 等级
  女头.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    女头.特效 = 特效
  else
      女头.特效 = nil
  end
  if 特技 ~= "" then
    女头.特技 = 特技
  else
      女头.特技 = nil
  end
  if 制造者 ~= "" then
    女头.制造者 = 制造者.."强化打造"
  else
    女头.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    女头.体质 = 体力点
  end
  if 魔力点 ~= "" then
    女头.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    女头.力量 = 力量点
  end
  if 耐力点 ~= "" then
    女头.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    女头.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    女头.套装效果 = {}
    女头.套装效果[1] = 状态类型
    女头.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=女头
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  女头 = nil


end
function 项链类(数据,连接id)

  项链 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["特技"]="气疗术",["耐久"]=550,["灵力"]=251,["子类"]=1,["识别码"]="4000240_1587386445_4751559_377",["特效"]="无级别限制",["分类"]=2,["名称"]="紫金碧玺佩",["级别限制"]=150}



  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、项链矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    项链.耐久 = 数据[26]+0
  else
    项链.耐久 = 500
  end
  if 数据[27]~= "" then
    项链.不可交易=true
  end
  if 数据[28]~= "" then
    项链.专用=id
  end
  项链.名称 = 装备名称
  项链.灵力 = 灵力值
  项链.级别限制 = 等级
  项链.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    项链.特效 = 特效
  else
      项链.特效 = nil
  end
  if 特技 ~= "" then
    项链.特技 = 特技
  else
      项链.特技 = nil
  end
  if 制造者 ~= "" then
    项链.制造者 = 制造者.."强化打造"
  else
    项链.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    项链.体质 = 体力点
  end
  if 魔力点 ~= "" then
    项链.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    项链.力量 = 力量点
  end
  if 耐力点 ~= "" then
    项链.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    项链.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    项链.套装效果 = {}
    项链.套装效果[1] = 状态类型
    项链.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=项链
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  项链 = nil
end
function 男衣类(数据,连接id)
  男衣 = {["性别限制"]="男",["染色组"]={},["染色方案"]=0,["总类"]=2,["特技"]="起死回生",["名称"]="紫金磐龙甲",["力量"]=-7,["耐久"]=508,["子类"]=1,["识别码"]="4000237_1587386202_2354756_722",["特效"]="无级别限制",["级别限制"]=150,["分类"]=4,["耐力"]=-2,["防御"]=324}



  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、男衣矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    男衣.耐久 = 数据[26]+0
  else
    男衣.耐久 = 500
  end
  if 数据[27]~= "" then
    男衣.不可交易=true
  end
  if 数据[28]~= "" then
    男衣.专用=id
  end
  男衣.名称 = 装备名称
  男衣.防御 = 防御值
  男衣.级别限制 = 等级
  男衣.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    男衣.特效 = 特效
  else
      男衣.特效 = nil
  end
  if 特技 ~= "" then
    男衣.特技 = 特技
  else
      男衣.特技 = nil
  end
  if 制造者 ~= "" then
    男衣.制造者 = 制造者.."强化打造"
  else
    男衣.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    男衣.体质 = 体力点
  end
  if 魔力点 ~= "" then
    男衣.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    男衣.力量 = 力量点
  end
  if 耐力点 ~= "" then
    男衣.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    男衣.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    男衣.套装效果 = {}
    男衣.套装效果[1] = 状态类型
    男衣.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=男衣
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  男衣 = nil


end


function 女衣类(数据,连接id)
  女衣 = {["性别限制"]="女",["染色组"]={},["染色方案"]=0,["总类"]=2,["名称"]="五彩凤翅衣",["特效"]="无级别限制",["防御"]=341,["耐久"]=576,["子类"]=1,["识别码"]="4000240_1587386445_6223418_364",["耐力"]=4,["分类"]=4,["体质"]=2,["级别限制"]=150}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、女衣矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    女衣.耐久 = 数据[26]+0
  else
    女衣.耐久 = 500
  end
  if 数据[27]~= "" then
    女衣.不可交易=true
  end
  if 数据[28]~= "" then
    女衣.专用=id
  end
  女衣.名称 = 装备名称
  女衣.防御 = 防御值
  女衣.级别限制 = 等级
  女衣.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    女衣.特效 = 特效
  else
      女衣.特效 = nil
  end
  if 特技 ~= "" then
    女衣.特技 = 特技
  else
      女衣.特技 = nil
  end
  if 制造者 ~= "" then
    女衣.制造者 = 制造者.."强化打造"
  else
    女衣.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    女衣.体质 = 体力点
  end
  if 魔力点 ~= "" then
    女衣.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    女衣.力量 = 力量点
  end
  if 耐力点 ~= "" then
    女衣.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    女衣.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    女衣.套装效果 = {}
    女衣.套装效果[1] = 状态类型
    女衣.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=女衣
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  女衣 = nil


end

function 腰带类(数据,连接id)

  腰带 = {["防御"]=164,["染色组"]={},["染色方案"]=0,["总类"]=2,["特技"]="冥王爆杀",["耐久"]=674,["子类"]=1,["识别码"]="4000240_1587386445_1948290_384",["特效"]="无级别限制",["气血"]=548,["分类"]=5,["名称"]="磐龙凤翔带",["级别限制"]=150}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、腰带矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    腰带.耐久 = 数据[26]+0
  else
    腰带.耐久 = 500
  end
  if 数据[27]~= "" then
    腰带.不可交易=true
  end
  if 数据[28]~= "" then
    腰带.专用=id
  end
  腰带.名称 = 装备名称
  腰带.防御 = 防御值
  腰带.气血 = 气血值
  腰带.级别限制 = 等级
  腰带.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    腰带.特效 = 特效
  else
      腰带.特效 = nil
  end
  if 特技 ~= "" then
    腰带.特技 = 特技
  else
      腰带.特技 = nil
  end
  if 制造者 ~= "" then
    腰带.制造者 = 制造者.."强化打造"
  else
    腰带.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    腰带.体质 = 体力点
  end
  if 魔力点 ~= "" then
    腰带.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    腰带.力量 = 力量点
  end
  if 耐力点 ~= "" then
    腰带.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    腰带.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    腰带.套装效果 = {}
    腰带.套装效果[1] = 状态类型
    腰带.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=腰带
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  腰带 = nil


end

function 鞋子类(数据,连接id)
  鞋子 = {["防御"]=154,["染色组"]={},["染色方案"]=0,["总类"]=2,["耐久"]=548,["子类"]=1,["识别码"]="4000240_1587386445_4248242_390",["特效"]="无级别限制",["敏捷"]=108,["分类"]=6,["名称"]="金丝逐日履",["级别限制"]=150}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、鞋子矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    鞋子.耐久 = 数据[26]+0
  else
    鞋子.耐久 = 500
  end
  if 数据[27]~= "" then
    鞋子.不可交易=true
  end
  if 数据[28]~= "" then
    鞋子.专用=id
  end
  鞋子.名称 = 装备名称
  鞋子.防御 = 防御值
  鞋子.敏捷 = 敏捷点
  鞋子.级别限制 = 等级
  鞋子.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    鞋子.特效 = 特效
  else
      鞋子.特效 = nil
  end
  if 特技 ~= "" then
    鞋子.特技 = 特技
  else
      鞋子.特技 = nil
  end
  if 制造者 ~= "" then
    鞋子.制造者 = 制造者.."强化打造"
  else
    鞋子.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    鞋子.体质 = 体力点
  end
  if 魔力点 ~= "" then
    鞋子.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    鞋子.力量 = 力量点
  end
  if 耐力点 ~= "" then
    鞋子.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    鞋子.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    鞋子.套装效果 = {}
    鞋子.套装效果[1] = 状态类型
    鞋子.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=鞋子
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  鞋子 = nil

end

function 枪矛类(数据,连接id)

  枪 = {["级别限制"]=150,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=594,["名称"]="天龙破城",["特技"]="冰清诀",["伤害"]=533,["耐久"]=554,["子类"]=1,["识别码"]="4000226_1587385664_4144078_699",["特效"]="无级别限制",["敏捷"]=29,["分类"]=3,["体质"]=11,["角色限制"]={[1]="龙太子",[2]="神天兵"}}
  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、枪矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    枪.耐久 = 数据[26]+0
  else
    枪.耐久 = 500
  end
  if 数据[27]~= "" then
    枪.不可交易=true
  end
  if 数据[28]~= "" then
    枪.专用=id
  end
  枪.名称 = 装备名称
  枪.伤害 = 伤害值
  枪.命中 = 命中值
  枪.级别限制 = 等级
  枪.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    枪.特效 = 特效
  else
      枪.特效 = nil
  end
  if 特技 ~= "" then
    枪.特技 = 特技
  else
      枪.特技 = nil
  end
  if 制造者 ~= "" then
    枪.制造者 = 制造者.."强化打造"
  else
    枪.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    枪.体质 = 体力点
  end
  if 魔力点 ~= "" then
    枪.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    枪.力量 = 力量点
  end
  if 耐力点 ~= "" then
    枪.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    枪.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    枪.套装效果 = {}
    枪.套装效果[1] = 状态类型
    枪.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=枪
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  枪 = nil

end
function 斧钺类(数据,连接id)

  斧钺 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=717,["名称"]="碧血干戚",["特效"]="无级别限制",["力量"]=4,["伤害"]=575,["耐久"]=544,["子类"]=2,["识别码"]="4000237_1587386203_4839725_763",["耐力"]=17,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="巨魔王",[2]="虎头怪"}}
  装备名称 = 数据[3]--
  装备类型 = 数据[4]--斧钺、斧钺矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    斧钺.耐久 = 数据[26]+0
  else
    斧钺.耐久 = 500
  end
  if 数据[27]~= "" then
    斧钺.不可交易=true
  end
  if 数据[28]~= "" then
    斧钺.专用=id
  end
  斧钺.名称 = 装备名称
  斧钺.伤害 = 伤害值
  斧钺.命中 = 命中值
  斧钺.级别限制 = 等级
  斧钺.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    斧钺.特效 = 特效
  else
      斧钺.特效 = nil
  end
  if 特技 ~= "" then
    斧钺.特技 = 特技
  else
      斧钺.特技 = nil
  end
  if 制造者 ~= "" then
    斧钺.制造者 = 制造者.."强化打造"
  else
    斧钺.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    斧钺.体质 = 体力点
  end
  if 魔力点 ~= "" then
    斧钺.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    斧钺.力量 = 力量点
  end
  if 耐力点 ~= "" then
    斧钺.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    斧钺.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    斧钺.套装效果 = {}
    斧钺.套装效果[1] = 状态类型
    斧钺.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=斧钺
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  斧钺 = nil

end

function 剑类(数据,连接id)
  剑 = {["级别限制"]=150,["染色组"]={},["染色方案"]=0,["命中"]=647,["名称"]="霜冷九州",["特效"]="无级别限制",["总类"]=2,["伤害"]=508,["耐久"]=669,["子类"]=3,["识别码"]="4000234_1587385890_8278921_993",["耐力"]=21,["特技"]="凝气诀",["分类"]=3,["体质"]=33,["角色限制"]={[1]="逍遥生",[2]="剑侠客",[3]="偃无师"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--剑、剑矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    剑.耐久 = 数据[26]+0
  else
    剑.耐久 = 500
  end
  if 数据[27]~= "" then
    剑.不可交易=true
  end
  if 数据[28]~= "" then
    剑.专用=id
  end
  剑.名称 = 装备名称
  剑.伤害 = 伤害值
  剑.命中 = 命中值
  剑.级别限制 = 等级
  剑.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    剑.特效 = 特效
  else
      剑.特效 = nil
  end
  if 特技 ~= "" then
    剑.特技 = 特技
  else
      剑.特技 = nil
  end
  if 制造者 ~= "" then
    剑.制造者 = 制造者.."强化打造"
  else
    剑.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    剑.体质 = 体力点
  end
  if 魔力点 ~= "" then
    剑.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    剑.力量 = 力量点
  end
  if 耐力点 ~= "" then
    剑.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    剑.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    剑.套装效果 = {}
    剑.套装效果[1] = 状态类型
    剑.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=剑
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  剑 = nil

end

function 双短剑类(数据,连接id)

  双短剑 = {["魔力"]=34,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=615,["名称"]="紫电青霜",["特技"]="起死回生",["伤害"]=620,["耐久"]=674,["子类"]=4,["识别码"]="4000233_1587385805_9502819_881",["特效"]="无级别限制",["敏捷"]=-5,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="英女侠",[2]="飞燕女"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--双短剑、双短剑矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    双短剑.耐久 = 数据[26]+0
  else
    双短剑.耐久 = 500
  end
  if 数据[27]~= "" then
    双短剑.不可交易=true
  end
  if 数据[28]~= "" then
    双短剑.专用=id
  end
  双短剑.名称 = 装备名称
  双短剑.伤害 = 伤害值
  双短剑.命中 = 命中值
  双短剑.级别限制 = 等级
  双短剑.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    双短剑.特效 = 特效
  else
      双短剑.特效 = nil
  end
  if 特技 ~= "" then
    双短剑.特技 = 特技
  else
      双短剑.特技 = nil
  end
  if 制造者 ~= "" then
    双短剑.制造者 = 制造者.."强化打造"
  else
    双短剑.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    双短剑.体质 = 体力点
  end
  if 魔力点 ~= "" then
    双短剑.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    双短剑.力量 = 力量点
  end
  if 耐力点 ~= "" then
    双短剑.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    双短剑.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    双短剑.套装效果 = {}
    双短剑.套装效果[1] = 状态类型
    双短剑.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=双短剑
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  双短剑 = nil

end

function 飘带类(数据,连接id)
  飘带 = {["魔力"]=25,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=673,["名称"]="揽月摘星",["特技"]="四海升平",["力量"]=27,["伤害"]=522,["耐久"]=527,["子类"]=5,["识别码"]="4000236_1587386074_3365776_390",["特效"]="无级别限制",["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="舞天姬",[2]="玄彩娥",[3]="桃夭夭"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--飘带、飘带矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    飘带.耐久 = 数据[26]+0
  else
    飘带.耐久 = 500
  end
  if 数据[27]~= "" then
    飘带.不可交易=true
  end
  if 数据[28]~= "" then
    飘带.专用=id
  end
  飘带.名称 = 装备名称
  飘带.伤害 = 伤害值
  飘带.命中 = 命中值
  飘带.级别限制 = 等级
  飘带.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    飘带.特效 = 特效
  else
      飘带.特效 = nil
  end
  if 特技 ~= "" then
    飘带.特技 = 特技
  else
      飘带.特技 = nil
  end
  if 制造者 ~= "" then
    飘带.制造者 = 制造者.."强化打造"
  else
    飘带.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    飘带.体质 = 体力点
  end
  if 魔力点 ~= "" then
    飘带.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    飘带.力量 = 力量点
  end
  if 耐力点 ~= "" then
    飘带.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    飘带.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    飘带.套装效果 = {}
    飘带.套装效果[1] = 状态类型
    飘带.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=飘带
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  飘带 = nil
end

function 爪刺类(数据,连接id)
  爪刺 = {["魔力"]=25,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=634,["名称"]="忘川三途",["特技"]="冰清诀",["伤害"]=607,["耐久"]=578,["子类"]=6,["识别码"]="4000235_1587385938_1679555_154",["特效"]="无级别限制",["级别限制"]=150,["分类"]=3,["体质"]=6,["角色限制"]={[1]="狐美人",[2]="骨精灵",[3]="鬼潇潇"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--爪刺、爪刺矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    爪刺.耐久 = 数据[26]+0
  else
    爪刺.耐久 = 500
  end
  if 数据[27]~= "" then
    爪刺.不可交易=true
  end
  if 数据[28]~= "" then
    爪刺.专用=id
  end
  爪刺.名称 = 装备名称
  爪刺.伤害 = 伤害值
  爪刺.命中 = 命中值
  爪刺.级别限制 = 等级
  爪刺.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    爪刺.特效 = 特效
  else
      爪刺.特效 = nil
  end
  if 特技 ~= "" then
    爪刺.特技 = 特技
  else
      爪刺.特技 = nil
  end
  if 制造者 ~= "" then
    爪刺.制造者 = 制造者.."强化打造"
  else
    爪刺.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    爪刺.体质 = 体力点
  end
  if 魔力点 ~= "" then
    爪刺.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    爪刺.力量 = 力量点
  end
  if 耐力点 ~= "" then
    爪刺.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    爪刺.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    爪刺.套装效果 = {}
    爪刺.套装效果[1] = 状态类型
    爪刺.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=爪刺
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  爪刺 = nil
end


function 扇类(数据,连接id)
  扇 = {["魔力"]=5,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=617,["名称"]="浩气长舒",["力量"]=32,["伤害"]=529,["耐久"]=554,["子类"]=7,["识别码"]="4000226_1587385575_4450558_643",["特效"]="无级别限制",["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="逍遥生",[2]="龙太子"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--扇、扇矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    扇.耐久 = 数据[26]+0
  else
    扇.耐久 = 500
  end
  if 数据[27]~= "" then
    扇.不可交易=true
  end
  if 数据[28]~= "" then
    扇.专用=id
  end
  扇.名称 = 装备名称
  扇.伤害 = 伤害值
  扇.命中 = 命中值
  扇.级别限制 = 等级
  扇.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    扇.特效 = 特效
  else
      扇.特效 = nil
  end
  if 特技 ~= "" then
    扇.特技 = 特技
  else
      扇.特技 = nil
  end
  if 制造者 ~= "" then
    扇.制造者 = 制造者.."强化打造"
  else
    扇.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    扇.体质 = 体力点
  end
  if 魔力点 ~= "" then
    扇.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    扇.力量 = 力量点
  end
  if 耐力点 ~= "" then
    扇.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    扇.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    扇.套装效果 = {}
    扇.套装效果[1] = 状态类型
    扇.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=扇
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  扇 = nil
end

function 魔棒类(数据,连接id)
  魔棒 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=700,["名称"]="丝萝乔木",["特效"]="无级别限制",["伤害"]=520,["耐久"]=519,["子类"]=8,["识别码"]="4000236_1587386076_6341340_444",["耐力"]=25,["敏捷"]=34,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="玄彩娥",[2]="骨精灵"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--魔棒、魔棒矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    魔棒.耐久 = 数据[26]+0
  else
    魔棒.耐久 = 500
  end
  if 数据[27]~= "" then
    魔棒.不可交易=true
  end
  if 数据[28]~= "" then
    魔棒.专用=id
  end
  魔棒.名称 = 装备名称
  魔棒.伤害 = 伤害值
  魔棒.命中 = 命中值
  魔棒.级别限制 = 等级
  魔棒.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    魔棒.特效 = 特效
  else
      魔棒.特效 = nil
  end
  if 特技 ~= "" then
    魔棒.特技 = 特技
  else
      魔棒.特技 = nil
  end
  if 制造者 ~= "" then
    魔棒.制造者 = 制造者.."强化打造"
  else
    魔棒.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    魔棒.体质 = 体力点
  end
  if 魔力点 ~= "" then
    魔棒.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    魔棒.力量 = 力量点
  end
  if 耐力点 ~= "" then
    魔棒.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    魔棒.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    魔棒.套装效果 = {}
    魔棒.套装效果[1] = 状态类型
    魔棒.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=魔棒
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  魔棒 = nil
end


function 锤类(数据,连接id)
  锤 = {["级别限制"]=150,["染色组"]={},["染色方案"]=0,["命中"]=570,["名称"]="狂澜碎岳",["特效"]="无级别限制",["总类"]=2,["伤害"]=503,["耐久"]=504,["子类"]=9,["识别码"]="4000238_1587386298_5018421_986",["耐力"]=26,["特技"]="碎甲术",["分类"]=3,["体质"]=34,["角色限制"]={[1]="神天兵",[2]="虎头怪"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--锤、锤矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    锤.耐久 = 数据[26]+0
  else
    锤.耐久 = 500
  end
  if 数据[27]~= "" then
    锤.不可交易=true
  end
  if 数据[28]~= "" then
    锤.专用=id
  end
  锤.名称 = 装备名称
  锤.伤害 = 伤害值
  锤.命中 = 命中值
  锤.级别限制 = 等级
  锤.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    锤.特效 = 特效
  else
      锤.特效 = nil
  end
  if 特技 ~= "" then
    锤.特技 = 特技
  else
      锤.特技 = nil
  end
  if 制造者 ~= "" then
    锤.制造者 = 制造者.."强化打造"
  else
    锤.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    锤.体质 = 体力点
  end
  if 魔力点 ~= "" then
    锤.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    锤.力量 = 力量点
  end
  if 耐力点 ~= "" then
    锤.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    锤.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    锤.套装效果 = {}
    锤.套装效果[1] = 状态类型
    锤.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=锤
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  锤 = nil
end


function 鞭类(数据,连接id)
  鞭 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=570,["名称"]="牧云清歌",["特技"]="水清诀",["力量"]=11,["伤害"]=519,["耐久"]=574,["子类"]=10,["识别码"]="4000235_1587385937_3648363_103",["特效"]="无级别限制",["敏捷"]=23,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="英女侠",[2]="狐美人"}}

  装备名称 = 数据[3]--
  装备类型 = 数据[4]--鞭、鞭矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    鞭.耐久 = 数据[26]+0
  else
    鞭.耐久 = 500
  end
  if 数据[27]~= "" then
    鞭.不可交易=true
  end
  if 数据[28]~= "" then
    鞭.专用=id
  end
  鞭.名称 = 装备名称
  鞭.伤害 = 伤害值
  鞭.命中 = 命中值
  鞭.级别限制 = 等级
  鞭.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    鞭.特效 = 特效
  else
      鞭.特效 = nil
  end
  if 特技 ~= "" then
    鞭.特技 = 特技
  else
      鞭.特技 = nil
  end
  if 制造者 ~= "" then
    鞭.制造者 = 制造者.."强化打造"
  else
    鞭.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    鞭.体质 = 体力点
  end
  if 魔力点 ~= "" then
    鞭.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    鞭.力量 = 力量点
  end
  if 耐力点 ~= "" then
    鞭.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    鞭.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    鞭.套装效果 = {}
    鞭.套装效果[1] = 状态类型
    鞭.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=鞭
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  鞭 = nil
end

function 环圈类(数据,连接id)
  环圈 = {["级别限制"]=150,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=650,["名称"]="无关风月",["特技"]="凝气诀",["力量"]=-1,["伤害"]=624,["耐久"]=595,["子类"]=11,["识别码"]="4000233_1587385803_5898502_827",["特效"]="无级别限制",["分类"]=3,["体质"]=4,["角色限制"]={[1]="飞燕女",[2]="舞天姬"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--环圈、环圈矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    环圈.耐久 = 数据[26]+0
  else
    环圈.耐久 = 500
  end
  if 数据[27]~= "" then
    环圈.不可交易=true
  end
  if 数据[28]~= "" then
    环圈.专用=id
  end
  环圈.名称 = 装备名称
  环圈.伤害 = 伤害值
  环圈.命中 = 命中值
  环圈.级别限制 = 等级
  环圈.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    环圈.特效 = 特效
  else
      环圈.特效 = nil
  end
  if 特技 ~= "" then
    环圈.特技 = 特技
  else
      环圈.特技 = nil
  end
  if 制造者 ~= "" then
    环圈.制造者 = 制造者.."强化打造"
  else
    环圈.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    环圈.体质 = 体力点
  end
  if 魔力点 ~= "" then
    环圈.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    环圈.力量 = 力量点
  end
  if 耐力点 ~= "" then
    环圈.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    环圈.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    环圈.套装效果 = {}
    环圈.套装效果[1] = 状态类型
    环圈.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=环圈
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  环圈 = nil
end


function 刀类(数据,连接id)


  刀 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=579,["名称"]="业火三灾",["特技"]="气疗术",["力量"]=25,["伤害"]=606,["耐久"]=668,["子类"]=12,["识别码"]="4000234_1587385891_6647788_45",["特效"]="无级别限制",["敏捷"]=7,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="剑侠客",[2]="巨魔王"}}



  装备名称 = 数据[3]--
  装备类型 = 数据[4]--刀、刀矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    刀.耐久 = 数据[26]+0
  else
    刀.耐久 = 500
  end
  if 数据[27]~= "" then
    刀.不可交易=true
  end
  if 数据[28]~= "" then
    刀.专用=id
  end
  刀.名称 = 装备名称
  刀.伤害 = 伤害值
  刀.命中 = 命中值
  刀.级别限制 = 等级
  刀.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    刀.特效 = 特效
  else
      刀.特效 = nil
  end
  if 特技 ~= "" then
    刀.特技 = 特技
  else
      刀.特技 = nil
  end
  if 制造者 ~= "" then
    刀.制造者 = 制造者.."强化打造"
  else
    刀.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    刀.体质 = 体力点
  end
  if 魔力点 ~= "" then
    刀.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    刀.力量 = 力量点
  end
  if 耐力点 ~= "" then
    刀.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    刀.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    刀.套装效果 = {}
    刀.套装效果[1] = 状态类型
    刀.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=刀
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  刀 = nil
end


function 法杖类(数据,连接id)

  法杖 = {["魔力"]=37,["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=606,["名称"]="碧海潮生",["特技"]="四海升平",["伤害"]=552,["耐久"]=522,["子类"]=13,["识别码"]="4000240_1587386445_3933559_354",["特效"]="无级别限制",["敏捷"]=15,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="巫蛮儿",[2]="羽灵神"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--法杖、法杖矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    法杖.耐久 = 数据[26]+0
  else
    法杖.耐久 = 500
  end
  if 数据[27]~= "" then
    法杖.不可交易=true
  end
  if 数据[28]~= "" then
    法杖.专用=id
  end
  法杖.名称 = 装备名称
  法杖.伤害 = 伤害值
  法杖.命中 = 命中值
  法杖.级别限制 = 等级
  法杖.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    法杖.特效 = 特效
  else
      法杖.特效 = nil
  end
  if 特技 ~= "" then
    法杖.特技 = 特技
  else
      法杖.特技 = nil
  end
  if 制造者 ~= "" then
    法杖.制造者 = 制造者.."强化打造"
  else
    法杖.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    法杖.体质 = 体力点
  end
  if 魔力点 ~= "" then
    法杖.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    法杖.力量 = 力量点
  end
  if 耐力点 ~= "" then
    法杖.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    法杖.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    法杖.套装效果 = {}
    法杖.套装效果[1] = 状态类型
    法杖.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=法杖
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  法杖 = nil
end


function 弓弩类(数据,连接id)
  弓弩 = {["特效"]="无级别限制",["染色组"]={},["染色方案"]=0,["总类"]=2,["命中"]=738,["名称"]="九霄风雷",["特技"]="命归术",["伤害"]=496,["耐久"]=525,["子类"]=14,["识别码"]="4000239_1587386359_7608120_96",["耐力"]=4,["敏捷"]=33,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="羽灵神",[2]="杀破狼"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--弓弩、弓弩矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    弓弩.耐久 = 数据[26]+0
  else
    弓弩.耐久 = 500
  end
  if 数据[27]~= "" then
    弓弩.不可交易=true
  end
  if 数据[28]~= "" then
    弓弩.专用=id
  end
  弓弩.名称 = 装备名称
  弓弩.伤害 = 伤害值
  弓弩.命中 = 命中值
  弓弩.级别限制 = 等级
  弓弩.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    弓弩.特效 = 特效
  else
      弓弩.特效 = nil
  end
  if 特技 ~= "" then
    弓弩.特技 = 特技
  else
      弓弩.特技 = nil
  end
  if 制造者 ~= "" then
    弓弩.制造者 = 制造者.."强化打造"
  else
    弓弩.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    弓弩.体质 = 体力点
  end
  if 魔力点 ~= "" then
    弓弩.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    弓弩.力量 = 力量点
  end
  if 耐力点 ~= "" then
    弓弩.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    弓弩.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    弓弩.套装效果 = {}
    弓弩.套装效果[1] = 状态类型
    弓弩.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=弓弩
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  弓弩 = nil
end


function 宝珠类(数据,连接id)


  宝珠 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=571,["名称"]="云雷万里",["特技"]="晶清诀",["力量"]=7,["伤害"]=582,["耐久"]=691,["子类"]=15,["识别码"]="4000239_1587386353_7167076_43",["特效"]="无级别限制",["敏捷"]=-3,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="巫蛮儿",[2]="杀破狼"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--宝珠、宝珠矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    宝珠.耐久 = 数据[26]+0
  else
    宝珠.耐久 = 500
  end
  if 数据[27]~= "" then
    宝珠.不可交易=true
  end
  if 数据[28]~= "" then
    宝珠.专用=id
  end
  宝珠.名称 = 装备名称
  宝珠.伤害 = 伤害值
  宝珠.命中 = 命中值
  宝珠.级别限制 = 等级
  宝珠.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    宝珠.特效 = 特效
  else
      宝珠.特效 = nil
  end
  if 特技 ~= "" then
    宝珠.特技 = 特技
  else
      宝珠.特技 = nil
  end
  if 制造者 ~= "" then
    宝珠.制造者 = 制造者.."强化打造"
  else
    宝珠.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    宝珠.体质 = 体力点
  end
  if 魔力点 ~= "" then
    宝珠.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    宝珠.力量 = 力量点
  end
  if 耐力点 ~= "" then
    宝珠.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    宝珠.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    宝珠.套装效果 = {}
    宝珠.套装效果[1] = 状态类型
    宝珠.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=宝珠
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  宝珠 = nil
end

function 巨剑类(数据,连接id)


  巨剑 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=571,["名称"]="百辟镇魂",["特技"]="晶清诀",["力量"]=7,["伤害"]=582,["耐久"]=691,["子类"]=16,["识别码"]="4000239_1587386353_7167076_43",["特效"]="无级别限制",["敏捷"]=-3,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="偃无师"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--巨剑、巨剑矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    巨剑.耐久 = 数据[26]+0
  else
    巨剑.耐久 = 500
  end
  if 数据[27]~= "" then
    巨剑.不可交易=true
  end
  if 数据[28]~= "" then
    巨剑.专用=id
  end
  巨剑.名称 = 装备名称
  巨剑.伤害 = 伤害值
  巨剑.命中 = 命中值
  巨剑.级别限制 = 等级
  巨剑.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    巨剑.特效 = 特效
  else
      巨剑.特效 = nil
  end
  if 特技 ~= "" then
    巨剑.特技 = 特技
  else
      巨剑.特技 = nil
  end
  if 制造者 ~= "" then
    巨剑.制造者 = 制造者.."强化打造"
  else
    巨剑.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    巨剑.体质 = 体力点
  end
  if 魔力点 ~= "" then
    巨剑.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    巨剑.力量 = 力量点
  end
  if 耐力点 ~= "" then
    巨剑.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    巨剑.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    巨剑.套装效果 = {}
    巨剑.套装效果[1] = 状态类型
    巨剑.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=巨剑
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  巨剑 = nil
end


function 伞类(数据,连接id)


  伞 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=571,["名称"]="浮生归梦",["特技"]="晶清诀",["力量"]=7,["伤害"]=582,["耐久"]=691,["子类"]=17,["识别码"]="4000239_1587386353_7167076_43",["特效"]="无级别限制",["敏捷"]=-3,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="鬼潇潇"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--伞、伞矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    伞.耐久 = 数据[26]+0
  else
    伞.耐久 = 500
  end
  if 数据[27]~= "" then
    伞.不可交易=true
  end
  if 数据[28]~= "" then
    伞.专用=id
  end
  伞.名称 = 装备名称
  伞.伤害 = 伤害值
  伞.命中 = 命中值
  伞.级别限制 = 等级
  伞.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    伞.特效 = 特效
  else
      伞.特效 = nil
  end
  if 特技 ~= "" then
    伞.特技 = 特技
  else
      伞.特技 = nil
  end
  if 制造者 ~= "" then
    伞.制造者 = 制造者.."强化打造"
  else
    伞.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    伞.体质 = 体力点
  end
  if 魔力点 ~= "" then
    伞.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    伞.力量 = 力量点
  end
  if 耐力点 ~= "" then
    伞.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    伞.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    伞.套装效果 = {}
    伞.套装效果[1] = 状态类型
    伞.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=伞
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  伞 = nil
end



function 灯笼类(数据,连接id)


  灯笼 = {["总类"]=2,["染色组"]={},["染色方案"]=0,["命中"]=571,["名称"]="夭桃秾李",["特技"]="晶清诀",["力量"]=7,["伤害"]=582,["耐久"]=691,["子类"]=18,["识别码"]="4000239_1587386353_7167076_43",["特效"]="无级别限制",["敏捷"]=-3,["分类"]=3,["级别限制"]=150,["角色限制"]={[1]="桃夭夭"}}


  装备名称 = 数据[3]--
  装备类型 = 数据[4]--灯笼、灯笼矛 等
  制造者   = 数据[5]
  if 数据[6] ~= "" then
    防御值   = 数据[6]+0
  end
  if 数据[7] ~= "" then
    魔法值   = 数据[7]+0
  end
  if 数据[8] ~= "" then
    灵力值   = 数据[8]+0
  end
  if 数据[9] ~= "" then
    命中值   = 数据[9]+0
  end
  if 数据[10] ~= "" then
    伤害值   = 数据[10]+0
  end
  if 数据[11] ~= "" then
    气血值   = 数据[11]+0
  end
  if 数据[12] ~= "" then
    敏捷值   = 数据[12]+0
  end
  if 数据[13] ~= "" then
    体力点   = 数据[13]+0
  end
  if 数据[14] ~= "" then
    魔力点   = 数据[14]+0
  end
  if 数据[15] ~= "" then
    力量点   = 数据[15]+0
  end
  if 数据[16] ~= "" then
    耐力点   = 数据[16]+0
  end
  if 数据[17] ~= "" then
    敏捷点   = 数据[17]+0
  end
  特效     = 数据[18]
  特技     = 数据[19]
  套装     = 数据[20]
  等级     = 数据[21]+0
  id       = 数据[22]+0
  状态类型 = 数据[23]
  if 数据[26]~="" then
    灯笼.耐久 = 数据[26]+0
  else
    灯笼.耐久 = 500
  end
  if 数据[27]~= "" then
    灯笼.不可交易=true
  end
  if 数据[28]~= "" then
    灯笼.专用=id
  end
  灯笼.名称 = 装备名称
  灯笼.伤害 = 伤害值
  灯笼.命中 = 命中值
  灯笼.级别限制 = 等级
  灯笼.识别码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    灯笼.特效 = 特效
  else
      灯笼.特效 = nil
  end
  if 特技 ~= "" then
    灯笼.特技 = 特技
  else
      灯笼.特技 = nil
  end
  if 制造者 ~= "" then
    灯笼.制造者 = 制造者.."强化打造"
  else
    灯笼.制造者 = "GM亲手为你强化打造"
  end
  if 体力点 ~= "" then
    灯笼.体质 = 体力点
  end
  if 魔力点 ~= "" then
    灯笼.魔力 = 魔力点
  end
  if 力量点 ~= "" then
    灯笼.力量 = 力量点
  end
  if 耐力点 ~= "" then
    灯笼.耐力 = 耐力点
  end
  if 敏捷点 ~= "" then
    灯笼.敏捷 = 敏捷点
  end

  if 套装 ~= "" then
    灯笼.套装效果 = {}
    灯笼.套装效果[1] = 状态类型
    灯笼.套装效果[2] = 套装
  end

  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=灯笼
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..装备名称.."#Y，请注意查收。")
  装备名称 = nil
  装备类型  = nil
  制造者 = nil
  防御值 = nil
  魔法值 = nil
  灵力值 = nil
  命中值 = nil
  伤害值 = nil
  气血值 = nil
  敏捷值 = nil
  体力点 = nil
  魔力点 = nil
  力量点 = nil
  耐力点 = nil
  敏捷点 = nil
  特效 = nil
  特技 = nil
  套装 = nil
  等级 = nil
  id = nil
  状态类型 = nil
  灯笼 = nil
end







function 增加灵饰(数据,连接id)
  灵饰类型 = 数据[3]
  if 灵饰类型 == "戒指" then
    戒指类(数据,连接id)
  elseif 灵饰类型 == "手镯" then
    手镯类(数据,连接id)
  elseif 灵饰类型 == "耳饰" then
    耳饰类(数据,连接id)
  elseif 灵饰类型 == "佩饰" then
    佩饰类(数据,连接id)
  end
end
function 戒指类(数据,连接id)
  戒指 = {["总类"]=2,["不可交易"]=false,["部位类型"]="戒指",["幻化属性"]={["附加"]={{},{},{},{},{}},["基础"]={["类型"]="伤害",["强化"]=0,["数值"]=19}},["耐久"]=500,["子类"]=3,["识别码"]="4000241_1587408611_8280922_545",["幻化等级"]=0,["级别限制"]=140,["分类"]=12,["名称"]="九曜光华",["灵饰"]=true}


  id =  数据[4]+0
  戒指名称 = 数据[5]
  主属性 = 数据[6]
  属性一 = 数据[7]
  属性二 = 数据[8]
  属性三 = 数据[9]
  属性四 = 数据[10]
  属性五 = 数据[19]
  if 数据[11] ~= "" then
    属一值 = 数据[11]+0
  end
  if 数据[12] ~= "" then
    属二值 = 数据[12]+0
  end
  if 数据[13] ~= "" then
    属三值 = 数据[13]+0
  end
  if 数据[14] ~= "" then
    属四值 = 数据[14]+0
  end
  if 数据[20] ~= "" then
    属五值 = 数据[20]+0
  end
  特效 =   数据[15]
  制造者 = 数据[16]
  戒指等级 = 数据[17]+0
  主属性值 = 数据[18]+0
  戒指.幻化属性.基础.类型 = 主属性
  戒指.幻化属性.基础.数值 = 主属性值
  戒指.级别限制 = 戒指等级
  戒指.名称 = 戒指名称
  if 数据[21]~="" then 戒指.不可交易 = true else 戒指.不可交易 = false end
  戒指.识别码 =  id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    戒指.特效 = 特效
  end
  if 属性一 ~= "" then
    戒指.幻化属性.附加[1].类型 = 属性一
    戒指.幻化属性.附加[1].数值 = 属一值
    戒指.幻化属性.附加[1].强化 = 0
  else
    戒指.幻化属性.附加[1] = nil
  end
  if 属性二 ~= "" then
    戒指.幻化属性.附加[2].类型 = 属性二
    戒指.幻化属性.附加[2].数值 = 属二值
    戒指.幻化属性.附加[2].强化 = 0
  else
    戒指.幻化属性.附加[2] = nil
  end
  if 属性三 ~= "" then
    戒指.幻化属性.附加[3].类型 = 属性三
    戒指.幻化属性.附加[3].数值 = 属三值
    戒指.幻化属性.附加[3].强化 = 0
  else
    戒指.幻化属性.附加[3] = nil
  end

  if 属性四 ~= "" then
    戒指.幻化属性.附加[4].类型 = 属性四
    戒指.幻化属性.附加[4].数值 = 属四值
    戒指.幻化属性.附加[4].强化 = 0
  else
    戒指.幻化属性.附加[4] = nil
  end
  if 属性五 ~= "" then
    戒指.幻化属性.附加[5].类型 = 属性五
    戒指.幻化属性.附加[5].数值 = 属五值
    戒指.幻化属性.附加[5].强化 = 0
  else
    戒指.幻化属性.附加[5] = nil
  end

  if 制造者 ~= "" then
    戒指.制造者 = 制造者.."强化打造"
  else
    戒指.制造者 = "GM亲手为你强化打造"
  end


  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=戒指
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
常规提示(id,"#Y/你获得了管理员送来的#R"..戒指名称.."#Y，请注意查收。")
end
function 耳饰类(数据,连接id)
  耳饰 = {["总类"]=2,["部位类型"]="耳饰",["幻化属性"]={["附加"]={{},{},{},{},{}},["基础"]={["类型"]="法术防御",["强化"]=0,["数值"]=37}},["耐久"]=500,["子类"]=1,["识别码"]="4000241_1587408611_5803019_556",["幻化等级"]=0,["级别限制"]=140,["分类"]=10,["名称"]="凤羽流苏",["灵饰"]=true}


  id =  数据[4]+0
  耳饰名称 = 数据[5]
  主属性 = 数据[6]
  属性一 = 数据[7]
  属性二 = 数据[8]
  属性三 = 数据[9]
  属性四 = 数据[10]
  属性五 = 数据[19]
  if 数据[11] ~= "" then
    属一值 = 数据[11]+0
  end
  if 数据[12] ~= "" then
    属二值 = 数据[12]+0
  end
  if 数据[13] ~= "" then
    属三值 = 数据[13]+0
  end
  if 数据[14] ~= "" then
    属四值 = 数据[14]+0
  end
  if 数据[20] ~= "" then
    属五值 = 数据[20]+0
  end
  特效 =   数据[15]
  制造者 = 数据[16]
  耳饰等级 = 数据[17]+0
  主属性值 = 数据[18]+0
  耳饰.幻化属性.基础.类型 = 主属性
  耳饰.幻化属性.基础.数值 = 主属性值
  耳饰.级别限制 = 耳饰等级
  耳饰.名称 = 耳饰名称
  if 数据[21]~="" then 耳饰.不可交易 = true else 耳饰.不可交易 = false end
  耳饰.识别码 =  id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    耳饰.特效 = 特效
  end
  if 属性一 ~= "" then
    耳饰.幻化属性.附加[1].类型 = 属性一
    耳饰.幻化属性.附加[1].数值 = 属一值
    耳饰.幻化属性.附加[1].强化 = 0
  else
    耳饰.幻化属性.附加[1] = nil
  end
  if 属性二 ~= "" then
    耳饰.幻化属性.附加[2].类型 = 属性二
    耳饰.幻化属性.附加[2].数值 = 属二值
    耳饰.幻化属性.附加[2].强化 = 0
  else
    耳饰.幻化属性.附加[2] = nil
  end
  if 属性三 ~= "" then
    耳饰.幻化属性.附加[3].类型 = 属性三
    耳饰.幻化属性.附加[3].数值 = 属三值
    耳饰.幻化属性.附加[3].强化 = 0
  else
    耳饰.幻化属性.附加[3] = nil
  end

  if 属性四 ~= "" then
    耳饰.幻化属性.附加[4].类型 = 属性四
    耳饰.幻化属性.附加[4].数值 = 属四值
    耳饰.幻化属性.附加[4].强化 = 0
  else
    耳饰.幻化属性.附加[4] = nil
  end
  if 属性五 ~= "" then
    耳饰.幻化属性.附加[5].类型 = 属性五
    耳饰.幻化属性.附加[5].数值 = 属五值
    耳饰.幻化属性.附加[5].强化 = 0
  else
    耳饰.幻化属性.附加[5] = nil
  end

  if 制造者 ~= "" then
    耳饰.制造者 = 制造者.."强化打造"
  else
    耳饰.制造者 = "GM亲手为你强化打造"
  end


  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=耳饰
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
常规提示(id,"#Y/你获得了管理员送来的#R"..耳饰名称.."#Y，请注意查收。")
end
function 手镯类(数据,连接id)
  手镯 = {["总类"]=2,["部位类型"]="手镯",["幻化属性"]={["附加"]={{},{},{},{},{}},["基础"]={["数值"]=30,["强化"]=0,["类型"]="抵抗封印等级"}},["耐久"]=500,["子类"]=4,["识别码"]="4000241_1587408624_8409390_570",["幻化等级"]=0,["灵饰"]=true,["分类"]=13,["名称"]="金水菩提",["级别限制"]=140}


  id =  数据[4]+0
  手镯名称 = 数据[5]
  主属性 = 数据[6]
  属性一 = 数据[7]
  属性二 = 数据[8]
  属性三 = 数据[9]
  属性四 = 数据[10]
  属性五 = 数据[19]
  if 数据[11] ~= "" then
    属一值 = 数据[11]+0
  end
  if 数据[12] ~= "" then
    属二值 = 数据[12]+0
  end
  if 数据[13] ~= "" then
    属三值 = 数据[13]+0
  end
  if 数据[14] ~= "" then
    属四值 = 数据[14]+0
  end
  if 数据[20] ~= "" then
    属五值 = 数据[20]+0
  end
  特效 =   数据[15]
  制造者 = 数据[16]
  手镯等级 = 数据[17]+0
  主属性值 = 数据[18]+0
  手镯.幻化属性.基础.类型 = 主属性
  手镯.幻化属性.基础.数值 = 主属性值
  手镯.级别限制 = 手镯等级
  手镯.名称 = 手镯名称
  if 数据[21]~="" then 手镯.不可交易 = true else 手镯.不可交易 = false end
  手镯.识别码 =  id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    手镯.特效 = 特效
  end
  if 属性一 ~= "" then
    手镯.幻化属性.附加[1].类型 = 属性一
    手镯.幻化属性.附加[1].数值 = 属一值
    手镯.幻化属性.附加[1].强化 = 0
  else
    手镯.幻化属性.附加[1] = nil
  end
  if 属性二 ~= "" then
    手镯.幻化属性.附加[2].类型 = 属性二
    手镯.幻化属性.附加[2].数值 = 属二值
    手镯.幻化属性.附加[2].强化 = 0
  else
    手镯.幻化属性.附加[2] = nil
  end
  if 属性三 ~= "" then
    手镯.幻化属性.附加[3].类型 = 属性三
    手镯.幻化属性.附加[3].数值 = 属三值
    手镯.幻化属性.附加[3].强化 = 0
  else
    手镯.幻化属性.附加[3] = nil
  end

  if 属性四 ~= "" then
    手镯.幻化属性.附加[4].类型 = 属性四
    手镯.幻化属性.附加[4].数值 = 属四值
    手镯.幻化属性.附加[4].强化 = 0
  else
    手镯.幻化属性.附加[4] = nil
  end
  if 属性五 ~= "" then
    手镯.幻化属性.附加[5].类型 = 属性五
    手镯.幻化属性.附加[5].数值 = 属五值
    手镯.幻化属性.附加[5].强化 = 0
  else
    手镯.幻化属性.附加[5] = nil
  end

  if 制造者 ~= "" then
    手镯.制造者 = 制造者.."强化打造"
  else
    手镯.制造者 = "GM亲手为你强化打造"
  end


  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=手镯
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
常规提示(id,"#Y/你获得了管理员送来的#R"..手镯名称.."#Y，请注意查收。")
end
function 佩饰类(数据,连接id)
  佩饰 = {["总类"]=2,["部位类型"]="佩饰",["幻化属性"]={["附加"]={{},{},{},{},{}},["基础"]={["类型"]="速度",["强化"]=0,["数值"]=22}},["耐久"]=500,["子类"]=2,["识别码"]="4000241_1587408611_8130875_534",["幻化等级"]=0,["级别限制"]=140,["分类"]=11,["名称"]="玄龙苍珀",["灵饰"]=true}


  id =  数据[4]+0
  佩饰名称 = 数据[5]
  主属性 = 数据[6]
  属性一 = 数据[7]
  属性二 = 数据[8]
  属性三 = 数据[9]
  属性四 = 数据[10]
  属性五 = 数据[19]
  if 数据[11] ~= "" then
    属一值 = 数据[11]+0
  end
  if 数据[12] ~= "" then
    属二值 = 数据[12]+0
  end
  if 数据[13] ~= "" then
    属三值 = 数据[13]+0
  end
  if 数据[14] ~= "" then
    属四值 = 数据[14]+0
  end
  if 数据[20] ~= "" then
    属五值 = 数据[20]+0
  end
  特效 =   数据[15]
  制造者 = 数据[16]
  佩饰等级 = 数据[17]+0
  主属性值 = 数据[18]+0
  佩饰.幻化属性.基础.类型 = 主属性
  佩饰.幻化属性.基础.数值 = 主属性值
  佩饰.级别限制 = 佩饰等级
  佩饰.名称 = 佩饰名称
  if 数据[21]~="" then 佩饰.不可交易 = true else 佩饰.不可交易 = false end
  佩饰.识别码 =  id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  if 特效 ~= "" then
    佩饰.特效 = 特效
  end
  if 属性一 ~= "" then
    佩饰.幻化属性.附加[1].类型 = 属性一
    佩饰.幻化属性.附加[1].数值 = 属一值
    佩饰.幻化属性.附加[1].强化 = 0
  else
    佩饰.幻化属性.附加[1] = nil
  end
  if 属性二 ~= "" then
    佩饰.幻化属性.附加[2].类型 = 属性二
    佩饰.幻化属性.附加[2].数值 = 属二值
    佩饰.幻化属性.附加[2].强化 = 0
  else
    佩饰.幻化属性.附加[2] = nil
  end
  if 属性三 ~= "" then
    佩饰.幻化属性.附加[3].类型 = 属性三
    佩饰.幻化属性.附加[3].数值 = 属三值
    佩饰.幻化属性.附加[3].强化 = 0
  else
    佩饰.幻化属性.附加[3] = nil
  end

  if 属性四 ~= "" then
    佩饰.幻化属性.附加[4].类型 = 属性四
    佩饰.幻化属性.附加[4].数值 = 属四值
    佩饰.幻化属性.附加[4].强化 = 0
  else
    佩饰.幻化属性.附加[4] = nil
  end
  if 属性五 ~= "" then
    佩饰.幻化属性.附加[5].类型 = 属性五
    佩饰.幻化属性.附加[5].数值 = 属五值
    佩饰.幻化属性.附加[5].强化 = 0
  else
    佩饰.幻化属性.附加[5] = nil
  end

  if 制造者 ~= "" then
    佩饰.制造者 = 制造者.."强化打造"
  else
    佩饰.制造者 = "GM亲手为你强化打造"
  end


  local 格子=玩家数据[id].道具:取新编号()
  玩家数据[id].道具.数据[格子]=佩饰
  玩家数据[id].角色.数据.道具[玩家数据[id].角色:取道具格子()]=格子
  道具刷新(id)
  发送数据1(连接id,7,"装备发送成功了")
常规提示(id,"#Y/你获得了管理员送来的#R"..佩饰名称.."#Y，请注意查收。")
end
function 增加宝宝(数据,连接id)
  染色信息={老虎={方案={[1]=1,[2]=0},id=64},白熊={方案={[1]=1,[2]=1},id=72},虾兵={方案={[1]=1,[2]=0},id=83},噬天虎={方案={[1]=1,[2]=0},id=106},雨师={方案={[1]=1,[2]=0},id=114},牛头={方案={[1]=1,[2]=0},id=77},骷髅怪={方案={[1]=1,[2]=0},id=60},长眉灵猴={方案={[1]=1,[2]=0},id=2051},修罗傀儡鬼={方案={[1]=1,[2]=0},id=2065},树怪={方案={[1]=1,[2]=0},id=56},羊头怪={方案={[1]=1,[2]=0},id=54},海毛虫={方案={[1]=1,[2]=0},id=67},野猪={方案={[1]=1,[2]=0},id=52},天兵={方案={[1]=1,[2]=0},id=82},野猪精={方案={[1]=1,[2]=1},id=107},赌徒={方案={[1]=1,[2]=0},id=76},野鬼={方案={[1]=1,[2]=0},id=80},连弩车={方案={[1]=1,[2]=0},id=2070},猫灵兽形={方案={[1]=0,[2]=1},id=2057},黑熊精={方案={[1]=1,[2]=0},id=53},龟丞相={方案={[1]=1,[2]=0},id=85},大海龟={方案={[1]=1,[2]=0},id=69},曼珠沙华={方案={[1]=1,[2]=0},id=2070},护卫={方案={[1]=1,[2]=0},id=2051},章鱼={方案={[1]=2},id=119},金铙僧={方案={[1]=0,[2]=1},id=2069},大力金刚={方案={[1]=1,[2]=0},id=101},花妖={方案={[1]=1,[2]=0},id=58},金身罗汉={方案={[1]=2,[2]=0},id=2000},修罗傀儡妖={方案={[1]=5,[2]=0},id=2078},蜃气妖={方案={[1]=5,[2]=0},id=2079},阴阳伞={方案={[1]=1,[2]=0},id=2070},混沌兽={方案={[1]=6,[2]=0},id=2078},蔓藤妖花={方案={[1]=1,[2]=0},id=2042},蛟龙={方案={[1]=1,[2]=1},id=90},葫芦宝贝={方案={[1]=1,[2]=0},id=2071},山贼={方案={[1]=1,[2]=0},id=75},鬼将={方案={[1]=1,[2]=0},id=95},百足将军={方案={[1]=1,[2]=1},id=108},狐狸精={方案={[1]=1,[2]=0},id=81},巨蛙={方案={[1]=1,[2]=0},id=70},芙蓉仙子={方案={[1]=1,[2]=1},id=55},海星={方案={[1]=0},id=119},小龙女={方案={[1]=1,[2]=0},id=63},猫灵人形={方案={[1]=1,[2]=0},id=2042},浣熊={方案={[1]=5},id=2079},风伯={方案={[1]=1,[2]=0},id=89},大蝙蝠={方案={[1]=1,[2]=0},id=66},幽萤娃娃={方案={[1]=4,[2]=0},id=20113},强盗={方案={[1]=1,[2]=0},id=74},巴蛇={方案={[1]=1,[2]=0},id=2070},机关鸟={方案={[1]=1,[2]=0},id=2070},机关兽={方案={[1]=1,[2]=0},id=2070},红萼仙子={方案={[1]=0,[2]=1},id=111},镜妖={方案={[1]=1,[2]=0},id=2062},龙龟={方案={[1]=0,[2]=1},id=112},机关人={方案={[1]=1,[2]=0},id=2070},灵符女娲={方案={[1]=1,[2]=0},id=98},地狱战神={方案={[1]=1,[2]=1},id=94},踏云兽={方案={[1]=0,[2]=1},id=110},雾中仙={方案={[1]=0,[2]=1},id=102},蛤蟆精={方案={[1]=1,[2]=0},id=61},如意仙子={方案={[1]=1,[2]=1},id=59},泪妖={方案={[1]=6},id=20113},狼={方案={[1]=1,[2]=0},id=68},巨力神猿={方案={[1]=0,[2]=1},id=2079},琴仙={方案={[1]=1,[2]=0},id=2071},马面={方案={[1]=1,[2]=0},id=78},兔子怪={方案={[1]=1,[2]=0},id=51},黑山老妖={方案={[1]=1,[2]=1},id=93},雷鸟人={方案={[1]=1,[2]=0},id=62},灵鹤={方案={[1]=1,[2]=0},id=103},天将={方案={[1]=1,[2]=0},id=71},千年蛇魅={方案={[1]=5,[2]=0},id=20104},巡游天神={方案={[1]=1,[2]=1},id=92},锦毛貂精={方案={[1]=0,[2]=3},id=20103},黑熊={方案={[1]=1,[2]=0},id=65},狂豹兽形={方案={[1]=1,[2]=0},id=2065},凤凰={方案={[1]=1,[2]=1},id=91},幽灵={方案={[1]=1,[2]=0},id=97},吸血鬼={方案={[1]=1,[2]=0},id=96},牛妖={方案={[1]=1,[2]=0},id=87},炎魔神={方案={[1]=1,[2]=0},id=105},律法女娲={方案={[1]=1,[2]=0},id=99},夜罗刹={方案={[1]=1,[2]=0},id=104},星灵仙子={方案={[1]=1,[2]=1},id=88},蚌精={方案={[1]=1},id=20306},净瓶女娲={方案={[1]=1,[2]=0},id=100},鲛人={方案={[1]=1,[2]=1},id=2057},蜘蛛精={方案={[1]=1,[2]=0},id=80},古代瑞兽={方案={[1]=1,[2]=1},id=73},蝎子精={方案={[1]=1,[2]=0},id=2071},犀牛将军兽形={方案={[1]=0,[2]=5},id=20104},僵尸={方案={[1]=1,[2]=0},id=79},蝴蝶仙子={方案={[1]=1,[2]=0},id=57},碧水夜叉={方案={[1]=1},id=2059},蟹将={方案={[1]=1,[2]=0},id=84},画魂={方案={[1]=4,[2]=0},id=20113},鼠先锋={方案={[1]=1,[2]=0},id=109},狂豹人形={方案={[1]=3,[2]=0},id=20230}}
  id = 数据[11]+0
  宝宝造型 = 数据[3]
  攻击资质 = 数据[4]
  防御资质 = 数据[5]
  体力资质 = 数据[6]
  法力资质 = 数据[7]
  速度资质 = 数据[8]
  躲闪资质 = 数据[9]
  成长 = 数据[10]
  index  = 1
  local 临时宝宝 = {灵性=0,等级=0,攻击资质=1400,模型="新手召唤兽",躲闪资质=1400,参战等级=0,统御属性={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},最大魔法=66,特性几率=0,防御=30,装备属性={防御=0,命中=0,速度=0,伤害=0,灵力=0,躲避=0,魔法=0,耐力=0,敏捷=0,气血=0,力量=0,体质=0,魔力=0},速度资质=1400,灵力=40,寿命=5000,进阶属性={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},体力资质=4400,仙露上限=7,名称="新手召唤兽",装备={},魔法=66,气血=132,伤害=28,忠诚=100,速度=28,敏捷=20,当前经验=0,最大经验=50,最大气血=132,魔力=20,认证码="22_1601891987_11814_289967657812",耐力=20,进阶=false,内丹={内丹上限=6,可用内丹=6},力量=20,染色组={},防御资质=1400,法力资质=2400,特性="无",种类="神兽",成长=1.1,技能={[1]="水漫金山",[2]="魔之心",[3]="法术暴击",[4]="法术波动",[5]="法术连击"},五行="水",体质=20,潜力=0}
  if 玩家数据[id] == nil then
    发送数据1(连接id,7,id.."当前并没有在线记录。")
    return
  end
  临时宝宝.模型 = 宝宝造型
  临时宝宝.名称 = 宝宝造型
  临时宝宝.攻击资质 = 攻击资质
  临时宝宝.防御资质 = 防御资质
  临时宝宝.体力资质 = 体力资质
  临时宝宝.法力资质 = 法力资质
  临时宝宝.速度资质 = 速度资质
  临时宝宝.躲闪资质 = 躲闪资质
  临时宝宝.成长 = 成长
  临时宝宝.五行 = 取五行()
  临时宝宝.认证码 = id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  临时宝宝.参战等级 = 数据[37]+0
  临时宝宝.种类 = 数据[38]
  if 临时宝宝.种类=="变异" then
   临时宝宝.变异=true
    if 染色信息[宝宝造型]~=nil then
      临时宝宝.染色方案 = 染色信息[宝宝造型].id
      临时宝宝.染色组 = {染色信息[宝宝造型].方案[1],染色信息[宝宝造型].方案[2]}
    end
  end
  for i = 12, 35 do
    if 数据[i] ~= "" then
      临时宝宝.技能[index] = 数据[i]
      index = index + 1
    end
  end

  -- if 数据[36]+0 == 0 then
  --   临时宝宝.内丹[1] = 6
  -- end

  local 宝宝=宝宝类.创建()
  宝宝:加载数据(临时宝宝)
  玩家数据[id].召唤兽.数据[#玩家数据[id].召唤兽.数据+1]=宝宝
  发送数据1(连接id,7,"已经发送宝宝成功了")
  常规提示(id,"#Y/你获得了管理员送来的#R"..宝宝造型.."#Y，请注意查收。")
end


function 管理工具类:取随机装备(id,名称,等级,序列)


  local 临时格子=玩家数据[id].角色:取道具格子()




         local 道具 = 物品类()
          道具:置对象(名称)
          道具.级别限制 = 等级
          local dz = 玩家数据[id].装备:打造公式(等级,序列)

          if dz[1] ~= nil then
                道具.命中 = dz[1]
              end
              if dz[2] ~= nil then
                道具.伤害 = dz[2]
              end
              if dz[3] ~= nil then
                道具.防御 = dz[3]
              end
              if dz[4] ~= nil then
                道具.魔法 = dz[4]
              end
              if dz[5] ~= nil then
                道具.灵力 = dz[5]
              end
              if dz[6] ~= nil then
                道具.气血 = dz[6]
              end
              if dz[7] ~= nil then
                道具.敏捷 = dz[7]
              end
              if dz[8] ~= nil then
                道具.体质 = dz[8]
              end
              if dz[9] ~= nil then
                道具.力量 = dz[9]
              end
              if dz[10] ~= nil then
                道具.耐力 = dz[10]
              end
              if dz[11] ~= nil then
                道具.魔力 = dz[11]
              end

              if dz[13] ~= nil then
                local 通用特技 = {"修罗咒","天衣无缝","气疗术","心疗术","命疗术","凝气诀","凝神诀","气归术","命归术","四海升平","回魂咒","起死回生","水清诀","冰清诀","玉清诀","晶清诀","弱点击破","冥王爆杀","放下屠刀","河东狮吼","碎甲术","破甲术","破血狂攻","罗汉金钟","慈航普渡","太极护法","光辉之甲","圣灵之甲","野兽之力","魔兽之印","流云诀","啸风诀","笑里藏刀","绝幻魔音","凝滞术","停陷术","破碎无双"}
                道具.特技 = 通用特技[取随机数(1,#通用特技)]
              end


   local 道具id=玩家数据[id].道具:取新编号()

   玩家数据[id].道具.数据[道具id]=道具
   玩家数据[id].道具.数据[道具id].级别限制=等级
   玩家数据[id].道具.数据[道具id].专用=id
   玩家数据[id].道具.数据[道具id].不可交易=true
   玩家数据[id].道具.数据[道具id].特效="无级别限制"
   玩家数据[id].道具.数据[道具id].五行=取五行()
   玩家数据[id].角色.道具[临时格子]=道具id
   发送数据(玩家数据[id].连接id,38,{内容="你得到了#R/"..玩家数据[id].道具.数据[道具id].名称})
   常规提示(id,"#Y你获得了#R"..名称)

 end











function 管理工具类:取日志数量(账号,id)

 local 读取文件=读入文件([[data/]]..账号..[[/]]..id..[[/角色.txt]])
 local 还原数据=table.loadstring(读取文件)
 return 还原数据.日志编号

end
function 管理工具类:更新(dt)

end


function 管理工具类:显示(x,y)

end

return 管理工具类