-- @Author: baidwwy
-- @Date:   2024-01-13 22:20:01
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-01-29 00:01:37
function 取神兽资质(造型,物法)
	if 物法 ~= nil then
		造型 = 造型.."_"..物法
	end
	local bbs = {}
	if 造型 == "超级神龙" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级驱鬼","高级夜战","幸运","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神龙_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","龙魂","高级法术波动","魔之心","再生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级腾蛇" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级连击","高级毒","高级夜战","偷袭","敏捷"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级腾蛇_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"地狱烈火","灵能激发","高级法术波动","魔之心","永恒"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级青鸾" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"苍鸾怒击","高级夜战","高级飞行","高级连击","反震"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级青鸾_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级魔之心","高级幸运","高级神佑复生","法术暴击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级人参娃娃" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"壁垒击破","高级必杀","高级强力","高级驱鬼","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级人参娃娃_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"泰山压顶","高级法术波动","高级冥思","高级法术暴击","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级海豚" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"剑荡四方","高级偷袭","高级必杀","高级幸运","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级海豚_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"水漫金山","高级魔之心","高级法术暴击","高级感知","慧根"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神牛" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"力劈华山","高级幸运","高级招架","必杀","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神牛_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","高级法术暴击","奔雷咒","冥思","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神虎" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级感知","嗜血追击","高级夜战","连击","强力"}
	    bbs[9] = {100,20,20,20,20,20}
		elseif 造型 == "善财童子·鼓" then
		bbs[1] = 2500 --攻资
		bbs[2] = 1750 --防资
		bbs[3] = 6500 --体资
		bbs[4] = 4000 --法资
		bbs[5] = 1750 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.75
	    bbs[8] = {"苍鸾怒击","嗜血追击","高级夜战","理直气壮","高级强力","高级必杀","高级神佑复生","高级吸血","高级偷袭","浮云神马"}
	    bbs[9] = {100,20,20,20,20,20}
	    elseif 造型 == "善财童子·玉" then
		bbs[1] = 2000 --攻资
		bbs[2] = 1750 --防资
		bbs[3] = 6500 --体资
		bbs[4] = 5000 --法资
		bbs[5] = 1750 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.75
	    bbs[8] = {"须弥真言","高级法术波动","高级法术连击","高级魔之心","高级法术暴击","叱咤风云","高级神佑复生","高级感知","灵能激发","龙魂"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神虎_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级驱鬼","高级法术暴击","奔雷咒","魔之心","法术波动"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神兔" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级敏捷","夜战","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神兔_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术连击","高级反震","奔雷咒","感知","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级泡泡" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级神佑复生","高级感知","高级飞行","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级泡泡_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级慧根","高级魔之心","奔雷咒","高级感知","雷击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大熊猫" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级连击","高级防御","高级感知","高级强力","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大熊猫_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级冥思","高级魔之心","奔雷咒","高级法术波动","雷击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级金猴" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级敏捷","高级幸运","高级连击","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级金猴_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级魔之心","高级精神集中","高级法术波动","雷击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大象" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级强力","高级再生","高级反震","高级必杀","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大象_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级神迹","高级魔之心","高级法术连击","雷击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵鹿" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"善恶有报","高级再生","高级冥思","高级偷袭","永恒"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵鹿_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"泰山压顶","高级法术连击","高级法术暴击","上古灵符","高级再生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级白泽" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级敏捷","高级夜战","高级幸运","感知"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级白泽_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"水漫金山","高级法术暴击","高级魔之心","高级反震","上古灵符"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级赤焰兽" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级感知","高级必杀","高级反击","高级毒","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级赤焰兽_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"八凶法阵","地狱烈火","高级冥思","高级法术暴击","魔之心"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级麒麟" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级合纵","高级连击","高级幸运","高级夜战","偷袭"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级麒麟_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"泰山压顶","高级魔之心","高级驱鬼","高级法术连击","感知"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大鹏" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级飞行","高级敏捷","高级偷袭","高级神佑复生","必杀"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级大鹏_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级法术暴击","高级招架","高级法术波动","冥思"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵狐" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"惊心一剑","高级敏捷","高级必杀","高级偷袭","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级灵狐_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级法术暴击","高级感知","高级魔之心","法术连击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级孔雀" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级飞行","高级再生","高级连击","高级必杀"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级孔雀_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级魔之心","高级神佑复生","高级法术暴击","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神马" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级连击","高级神佑复生","浮云神马","幸运","神迹"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神马_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级法术连击","高级魔之心","法术暴击","慧根"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级六耳猕猴" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级敏捷","高级连击","高级招架","高级偷袭","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级六耳猕猴_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"须弥真言","上古灵符","高级法术连击","高级法术暴击","永恒"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神羊" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级连击","千钧一怒","感知","反震"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神羊_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级魔之心","高级法术波动","法术暴击","驱鬼"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级土地公公" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级敏捷","高级神佑复生","高级连击","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级土地公公_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术连击","高级神佑复生","高级魔之心","天降灵葫","招架"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猴" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级吸血","高级神佑复生","大快朵颐","必杀","连击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猴_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术连击","高级法术波动","奔雷咒","魔之心","法术暴击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级玉兔" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级夜战","高级敏捷","高级感知","偷袭","连击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级玉兔_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","高级法术暴击","高级神佑复生","月光","驱鬼"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鸡" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级强力","高级神佑复生","从天而降","必杀","夜战"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鸡_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","高级感知","地狱烈火","魔之心","招架"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级筋斗云" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级神佑复生","高级偷袭","高级敏捷","高级夜战","强力"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级筋斗云_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级法术连击","高级感知","高级魔之心","反震"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神蛇" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级连击","高级毒","高级夜战","偷袭","敏捷"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神蛇_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"地狱烈火","灵能激发","高级法术波动","魔之心","永恒"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神狗" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级神迹","高级神佑复生","理直气壮","强力","再生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神狗_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"地狱烈火","高级招架","高级防御","魔之心","法术暴击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "飞天" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级连击","高级敏捷","高级飞行","高级夜战","神佑复生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "飞天_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"流沙轻音","净台妙谛","高级法术暴击","高级法术波动","幸运"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鼠" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级夜战","高级隐身","高级敏捷","偷袭","吸血"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神鼠_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"奔雷咒","高级慧根","高级再生","魔之心","法术波动"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猪" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级神佑复生","高级必杀","高级防御","幸运","再生"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级神猪_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级魔之心","地狱烈火","高级法术暴击","招架","驱鬼"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级小白龙" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级反击","高级再生","高级夜战","感知"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级小白龙_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术连击","高级法术暴击","叱咤风云","高级神佑复生","永恒"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级猪小戒" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级必杀","高级强力","高级防御","高级偷袭","反击"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级猪小戒_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"食指大动","高级魔之心","高级感知","高级法术连击","法术波动"}
	    bbs[9] = {100,20,20,20,20,20}

	elseif 造型 == "龙马" then
		bbs[1] = 1200 --攻资
		bbs[2] = 1200 --防资
		bbs[3] = 3000 --体资
		bbs[4] = 1500 --法资
		bbs[5] = 1200 --速资
		bbs[6] = 1200 --躲闪
		bbs[7] = 0.9
	    bbs[8] = {"法术暴击","魔之心","雷击","必杀","连击","吸血"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "海毛虫" then
		bbs[1] = 1200 --攻资
		bbs[2] = 1200 --防资
		bbs[3] = 3000 --体资
		bbs[4] = 1500 --法资
		bbs[5] = 1200 --速资
		bbs[6] = 1200 --躲闪
		bbs[7] = 0.9
	    bbs[8] = {"夜战","偷袭","神佑复生","必杀","连击","吸血"}
	    bbs[9] = {100,20,20,20,20,20}
	 elseif 造型 == "古代瑞兽" then
		bbs[1] = 1330
		bbs[2] = 1386
		bbs[3] = 3960
		bbs[4] = 2754
		bbs[5] = 1518
		bbs[6] = 1320
		bbs[7] = 1.173
	    bbs[8] = {"高级神迹","高级反震","泰山压顶","高级驱鬼"}
	    bbs[9] = {100,15,15,15,15,15}
	elseif 造型 == "小毛头" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
	    bbs[8] = {"横扫千军","后发制人","高级连击","高级必杀","高级强力","高级鬼魂术","高级吸血","开门见山"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小丫丫" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
		bbs[8] = {"唧唧歪歪","推气过宫","高级防御","高级再生","高级法术抵抗","高级神佑复生","赴汤蹈火","还魂咒"}
		bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小仙灵" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
		bbs[8] = {"龙卷雨击","龙腾","高级法术连击","高级法术暴击","高级法术波动","高级魔之心","高级鬼魂术","张弛有道"}
		bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小仙女" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
		bbs[8] = {"日光华","普渡众生","高级防御","高级再生","高级法术抵抗","高级神佑复生","赴汤蹈火","仙人指路"}
		bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小精灵" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
		bbs[8] = {"地涌金莲","夺命咒","高级防御","高级再生","高级法术抵抗","高级神佑复生","赴汤蹈火","峰回路转"}
		bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "小魔头" then
		bbs[1] = 1500 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3000 --法资
		bbs[5] = 1400 --速资
		bbs[6] = 1400 --躲闪
		bbs[7] = 1.3
		bbs[8] = {"判官令","阎罗令","高级法术连击","高级法术暴击","高级驱鬼","高级魔之心","高级感知","张弛有道"}
		bbs[9] = {100,20,20,20,20,20}


    elseif 造型 == "鲲鹏" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"扶摇万里","高级连击","高级毒","高级夜战","偷袭","敏捷"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "鲲鹏_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"扶摇万里","高级法术波动","地狱烈火","魔之心","灵能激发","永恒"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "广目巡守" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "广目巡守_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "超级飞天" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "超级飞天_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "狐不归"  then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "狐不归_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "涂山雪"  then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "涂山雪_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "月魅"  then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月魅_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

	elseif 造型 == "云游火"  then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "云游火_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}

    elseif 造型 == "月影仙"  then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级偷袭","高级连击","高级幸运","高级敏捷","驱怪"}
	    bbs[9] = {100,20,20,20,20,20}
	elseif 造型 == "月影仙_法系" then
		bbs[1] = 1800 --攻资
		bbs[2] = 1500 --防资
		bbs[3] = 5000 --体资
		bbs[4] = 3800 --法资
		bbs[5] = 1300 --速资
		bbs[6] = 1300 --躲闪
		bbs[7] = 1.5
	    bbs[8] = {"高级法术波动","奔雷咒","高级魔之心","高级精神集中","雷击"}
	    bbs[9] = {100,20,20,20,20,20}
	------------------------------------摩托修改新增胚子召唤兽
	end
	return  bbs
end