npc位置信息={
--桃园

夏大叔={X=37,Y=85,地图=1003},
窑窑={X=42,Y=88,地图=1003},
彤彤={X=71,Y=87,地图=1003},
萍儿={X=78,Y=87,地图=1003},
桃源仙女={X=115,Y=63,地图=1003},
郭大哥={X=163,Y=73,地图=1003},
狸={X=171,Y=79,地图=1003},
狸={X=170,Y=70,地图=1003},
狸={X=165,Y=85,地图=1003},
桃园村长={X=163,Y=48,地图=1003},
玄大夫={X=137,Y=47,地图=1003},
雨画师={X=126,Y=50,地图=1003},
孙厨娘={X=108,Y=40,地图=1003},
刘大婶={X=110,Y=21,地图=1003},
小绿={X=123,Y=16,地图=1003},
清清={X=128,Y=14,地图=1003},
孙猎户={X=164,Y=18,地图=1003},
野猪={X=171,Y=14,地图=1003},
霞姑娘={X=78,Y=25,地图=1003},
新手接待师={X=27,Y=27,地图=1003},
狼宝宝={X=51,Y=9,地图=1003},

--建邺城

宠物仙子={X=62,Y=29,地图=1501},
戏班班主={X=84,Y=31,地图=1501},
吹牛王={X=88,Y=38,地图=1501},
刻晴={X=41,Y=101,地图=1501},
飞儿={X=97,Y=49,地图=1501},
王大嫂={X=139,Y=14,地图=1501},
海产收购商={X=232,Y=13,地图=1501},
建邺老孙头 = {X=224,Y=10,地图=1501},
陈长寿 = {X=222,Y=20,地图=1501},
罗招弟 ={X=217,Y=29,地图=1501},
牛大胆 ={X=230,Y=38,地图=1501},
装备收购商={X=238,Y=24,地图=1501},
装备鉴定商={X=243,Y=28,地图=1501},
超级巫医={X=214,Y=44,地图=1501},
赵元宝={X=227,Y=79,地图=1501},
小花={X=204,Y=106,地图=1501},
赵捕头={X=115,Y=80,地图=1501},
超级巫医={X=107,Y=87,地图=1501},
张来福={X=87,Y=71,地图=1501},
建邺特产商人={X=84,Y=77,地图=1501},
马全有={X=49,Y=89,地图=1501},
迎客僧={X=10,Y=89,地图=1501},
李善人的管家={X=42,Y=64,地图=1501},
符全={X=18,Y=54,地图=1501},
建邺守卫={X=15.5,Y=138.5,地图=1501},
雷黑子={X=70,Y=133,地图=1501},
教书先生={X=77,Y=54,地图=1501},
仓库管理员={X=52,Y=112,地图=1501},
建邺哥哥快={X=201,Y=19,地图=1501},


--梦战建邺城
宠物仙子={X=62,Y=29,地图=6043},
张捕头={X=87,Y=71,地图=6043},
哥哥快={X=201,Y=19,地图=6043},
江南小盗={X=80,Y=2,地图=6043},
老孙头={X=224,Y=10,地图=6043},
小红={X=41,Y=64,地图=6043},
渔夫={X=39,Y=66,地图=6043},
黄狮王={X=43,Y=68,地图=6043},





--梦战东海湾
大大龟={X=77,Y=99,地图=6044},
果毛虫={X=81,Y=105,地图=6044},


--梦战岩洞

绿皮蛙={X=82,Y=42,地图=6045},
寒夕={X=82,Y=42,地图=6045},
--梦战海底
屈原={X=48,Y=30,地图=6046},
狂盗={X=153,Y=17,地图=6046},

小宝箱={X=19,Y=20,地图=1525},


幽冥鬼={X=52,Y=31,地图=1127},

---江南野外

罗纤纤={X=25,Y=29,地图=1193},
江湖奸商={X=102,Y=23,地图=1193},
卵二姐={X=23,Y=99,地图=1193},
樵夫	={X=134,Y=96,地图=1193},
洛树妖={X=43,Y=22,地图=1193},


无名野鬼={X=64,Y=26,地图=1129},


美猴王={X=62,Y=34,地图=1103},


杂货店老板={X=35,Y=26,地图=1505},


小宝箱={X=127,Y=17,地图=1202},


朱紫校尉={X=138,Y=21,地图=1208},
药店伙计={X=125,Y=97,地图=1208},
紫阳药师={X=144,Y=82,地图=1208},
端木娘子={X=97,Y=113,地图=1208},
朱紫侍卫={X=21,Y=115,地图=1208},
朱紫侍卫={X=7,Y=109,地图=1208},
超级巫医={X=9,Y=31,地图=1208},
申太公={X=76,Y=105,地图=1208},
妖魔亲信={X=104,Y=10,地图=1208},
土地公公={X=21,Y=25,地图=1208},

--西凉女国

西梁女兵={X=129,Y=104,地图=1040},
西梁女兵={X=141,Y=99,地图=1040},
驿站老板={X=18,Y=71,地图=1040},
驿站老板={X=15,Y=114,地图=1040},
周吊伦={X=85,Y=62,地图=1040},
西凉国王={X=21,Y=18,地图=1040},


蜃妖元神={X=52,Y=32,地图=1215},


御兽仙={X=151,Y=59,地图=1216},
百兽王={X=24,Y=84,地图=1216},


驿站老板={X=143,Y=27,地图=1226},
镖局学童={X=54,Y=14,地图=1226},
土地公公={X=119,Y=16,地图=1226},
药店老板={X=148,Y=67,地图=1226},


土地公公={X=76,Y=24,地图=5001},

--建邺城衙门

建邺县令={X=43,Y=17,地图=1537},
衙役={X=17,Y=24,地图=1537},
衙役={X=26,Y=20,地图=1537},
衙役={X=26,Y=29,地图=1537},
衙役={X=33,Y=25,地图=1537},
简师爷={X=30,Y=19,地图=1537},


当铺老板={X=28,Y=23,地图=1523},

武器店老板={X=22,Y=18,地图=1502},
武器店掌柜={X=15,Y=18,地图=1502},


服装店老板={X=24,Y=23,地图=1503},


药店老板={X=28,Y=20,地图=1504},


周猎户={X=20,Y=25,地图=1526},


钱庄老板={X=36,Y=23,地图=1524},


李善人={X=21,Y=29,地图=1534},

--东海湾

船夫={X=55,Y=112,地图=1506},
云游神医={X=75,Y=109,地图=1506},
超级巫医={X=101,Y=104,地图=1506},
林老汉={X=91,Y=81,地图=1506},
老虾={X=115,Y=29,地图=1506},
楚恋依={X=58,Y=35,地图=1506},
海盗头子={X=18,Y=102,地图=1506},
牛二={X=59,Y=70,地图=1506},
玉面公主={X=88,Y=11,地图=1506},

--国境

大唐国境土地={X=177,Y=74,地图=1110},
普陀山接引仙女={X=229,Y=269,地图=1110},
小二={X=68,Y=268,地图=1110},
驿站老板={X=86,Y=86,地图=1110},
超级巫医={X=35,Y=257,地图=1110},
者释和尚={X=174,Y=248,地图=1110},
业释和尚={X=186,Y=184,地图=1110},
海释和尚={X=139,Y=157,地图=1110},
白琉璃={X=27,Y=176,地图=1110},
山神={X=43,Y=98,地图=1110},
虾兵={X=241,Y=76,地图=1110},
水族的家伙={X=241,Y=76,地图=1110},
吴老爹={X=312,Y=82,地图=1110},
小芸芸={X=169,Y=33,地图=1110},
吴文彩={X=306,Y=116,地图=1110},
婆婆={X=35,Y=310,地图=1110},
文秀={X=238,Y=54,地图=1110},
衙役={X=314,Y=37,地图=1110},
赌徒喽啰={X=252,Y=117,地图=1110},
江洋大盗={X=223,Y=19,地图=1110},
洛川鬼={X=37,Y=22,地图=1110},


酒肉和尚={X=38,Y=20,地图=1153},
疯和尚={X=38,Y=20,地图=1153},
玄奘={X=13,Y=21,地图=1153},


刘洪={X=38,Y=20,地图=1168},
殷温娇={X=13,Y=21,地图=1168},
江州县令={X=27,Y=21,地图=1168},

--凌波城

二郎神={X=68,Y=32,地图=1150},
哮天犬={X=77,Y=36,地图=1150},
守门天将={X=6,Y=88,地图=1150},
守门天将={X=15,Y=93.5,地图=1150},
荒芜星={X=23,Y=117,地图=1150},
刀砧星={X=29,Y=141,地图=1150},
反吟星={X=54,Y=137,地图=1150},
天瘟星={X=93,Y=104,地图=1150},
伏断星={X=100,Y=48,地图=1150},
破碎星={X=26.5,Y=55.5,地图=1150},
传送天将={X=44,Y=57,地图=1150},

--普陀山

龙女宝宝={X=23,Y=29,地图=1140},
黑熊怪={X=24,Y=47,地图=1140},
接引仙女={X=8,Y=9,地图=1140},

--潮音洞

观音姐姐={X=12.5,Y=11.5,地图=1141},
青莲仙女={X=25,Y=33,地图=1141},

--地府

钟馗={X=63,Y=60,地图=1122},
马面={X=10,Y=87,地图=1122},
追梦鬼={X=10,Y=104,地图=1122},
地遁鬼={X=27.5,Y=63.5,地图=1122},
孟婆={X=99.5,Y=94.5,地图=1122},
地府商人={X=83,Y=108,地图=1122},
地府货商={X=68,Y=73,地图=1122},

--森罗3.42

判官={X=18,Y=20,地图=1123},
阎罗王={X=22.2,Y=26.5,地图=1123},
转轮王={X=25.6,Y=28.5,地图=1123},
秦广王={X=29,Y=30.5,地图=1123},
初江王={X=32.4,Y=32.5,地图=1123},
宋帝王={X=35.8,Y=34.5,地图=1123},
卞城王={X=31.7,Y=21.7,地图=1123},
平等王={X=35.1,Y=23.7,地图=1123},
泰山王={X=38.5,Y=25.7,地图=1123},
都市王={X=41.9,Y=27.7,地图=1123},
忤官王={X=45.3,Y=29.7,地图=1123},


白无常={X=20,Y=23,地图=1125},
黑无常={X=37,Y=22,地图=1125},

--地藏王府

地藏王={X=32,Y=22,地图=1124},

--龙宫

虾兵={X=24,Y=97,地图=1116},
蟹将军={X=32,Y=100,地图=1116},
虾兵={X=40,Y=104,地图=1116},
龟千岁={X=99,Y=57,地图=1116},
小龙女={X=96,Y=49,地图=1116},
虾兵={X=47,Y=21,地图=1116},
龟太尉={X=53,Y=16,地图=1116,},
虾兵={X=62,Y=14,地图=1116},
虾兵={X=188,Y=12,地图=1116},
蛤蟆勇士={X=195,Y=16,地图=1116},
虾兵={X=203,Y=20,地图=1116},
虾兵={X=188,Y=92,地图=1116},
虾将军={X=195,Y=88,地图=1116},
虾兵={X=203,Y=84,地图=1116},
万圣公主={X=18,Y=50,地图=1116},
传送蟹将={X=108,Y=60,地图=1116},

--水晶宫

东海龙王={X=39,Y=25,地图=1117},

--海底

螃蟹精={X=34,Y=31,地图=1507},
蛤蟆精={X=50,Y=29,地图=1507},

--花果山

老马猴={X=42,Y=75,地图=1514},
猴医仙={X=135,Y=36,地图=1514},
老猕猴={X=44,Y=14,地图=1514},

--北俱芦洲

地遁鬼={X=195,Y=63,地图=1174},
女娲神迹传送人={X=13,Y=17,地图=1174},
青琉璃={X=22,Y=35,地图=1174},
超级巫医={X=2,Y=105,地图=1174},
龙女妹妹={X=138,Y=71,地图=1174},
莽汉={X=3,Y=129,地图=1174},
北俱商人={X=18,Y=145,地图=1174},
北俱货商={X=18,Y=91,地图=1174},
驿站老板={X=93,Y=76,地图=1174},
雷鸟精={X=63,Y=29,地图=1174},
白熊怪={X=108,Y=117,地图=1174},
翻天怪={X=181,Y=137,地图=1174},

--花果山
--长寿郊外

驿站老板={X=6,Y=88,地图=1091},
传送天将={X=22,Y=112,地图=1091},
西牛贺洲土地={X=9,Y=158,地图=1091},
鬼谷道人={X=133,Y=86,地图=1091},
路人甲={X=174,Y=119,地图=1091},

--长寿村
--方寸

觉明={X=62,Y=118,地图=1135},
灵儿={X=5,Y=92,地图=1135},
接引道童={X=118,Y=30,地图=1135},

--境外

南瞻部洲土地={X=44,Y=102,地图=1173},
驿站老板={X=13,Y=95,地图=1173},
超级巫医={X=50,Y=49,地图=1173},
山贼头子={X=94,Y=15,地图=1173},
牛将军={X=79,Y=43,地图=1173},
驿站老板={X=205,Y=93,地图=1173},
白衣人={X=234,Y=110,地图=1173},
阿紫={X=319,Y=47,地图=1173},
姚太尉={X=324,Y=44,地图=1173},
云游僧={X=350,Y=89,地图=1173},
白鹿精={X=354,Y=111,地图=1173},
小白鹿={X=354,Y=111,地图=1173},
玉面狐狸={X=39,Y=110,地图=1173},
超级巫医={X=409,Y=108,地图=1173},
野猪王={X=480,Y=113,地图=1173},
偷尸鬼={X=579,Y=98,地图=1173},
李彪={X=588,Y=101,地图=1173},
刘洪={X=591,Y=104,地图=1173},
强盗头子={X=562,Y=33,地图=1173},
冤魂={X=603,Y=19,地图=1173},
至尊宝={X=161,Y=59,地图=1173},
天兵飞剑={X=246,Y=56,地图=1173},
卷帘大将={X=237,Y=64,地图=1173},
天蓬元帅={X=396,Y=71,地图=1173},

--沉船

虾精={X=17,Y=16,地图=1508},
妖风={X=55,Y=31,地图=1508},


商人的鬼魂={X=23,Y=27,地图=1509},
鬼魂={X=23,Y=27,地图=1509},

--长安

长安导游={X=463,Y=262,地图=1001},
王夫人={X=33,Y=231,地图=1001},
商会总管={X=329,Y=265,地图=1001},
陈员外={X=176,Y=249,地图=1001},
花香香={X=301,Y=256,地图=1001},
老花农={X=289,Y=249,地图=1001},
罗道人={X=258,Y=243,地图=1001},
染色师={X=20,Y=264,地图=1001},
驿站老板={X=274,Y=238,地图=1001},
张老财={X=27,Y=253,地图=1001},
超级巫医={X=526,Y=95,地图=1001},
门派传送人={X=478,Y=246.8,地图=1001},
圣山传送人={X=350,Y=205,地图=1001},
门派闯关使者={X=128,Y=90,地图=1001},
刘副将={X=147,Y=176,地图=1001},
兰虎={X=234,Y=104,地图=1001},
马副将={X=194,Y=115,地图=1001},
御林军={X=21,Y=106,地图=1001},
皇宫护卫={X=228,Y=102,地图=1001},
礼部侍郎={X=280,Y=95,地图=1001},
袁天罡={X=253,Y=112,地图=1001},
李将军={X=145,Y=84,地图=1001},
杜少海={X=223,Y=99,地图=1001},
御林军左统领={X=101,Y=65,地图=1001},
御林军右统领={X=110,Y=49,地图=1001},
长安珍品商人={X=193,Y=261,地图=1001},
装备收购商={X=419,Y=47,地图=1001},
装备鉴定商={X=429,Y=51,地图=1001},
仓库管理员={X=49,Y=107,地图=1001},
符石道人={X=490,Y=203,地图=1001},
帮派管理员={X=32,Y=17,地图=1001},
长安商人={X=25,Y=166,地图=1001},
长安货商={X=383,Y=120,地图=1001},
袁守城={X=181,Y=263,地图=1001},
龙孙={X=176,Y=267,地图=1001},
建房吏={X=26,Y=213,地图=1001},
效果取消员={X=26,Y=109,地图=1001},
宝石商人={X=47,Y=140,地图=1001},
相府守卫={X=17,Y=171,地图=1001},
相府守卫={X=195,Y=162,地图=1001},
节日礼物使者={X=206,Y=153,地图=1001},
房都尉={X=35,Y=206,地图=1001},
怜儿姑娘={X=259,Y=184,地图=1001},
小宝={X=314,Y=147,地图=1001},
奖励发放员={X=240,Y=06,地图=1001},
比武大会主持人={X=110,Y=167,地图=1001},
月老={X=422,Y=134,地图=1001},
轿夫={X=519,Y=151,地图=1001},
御兽仙={X=258,Y=114,地图=1001},
女猪脚={X=301,Y=91,地图=1001},
长安城内的殷丞相={X=165,Y=143,地图=1001},
刻晴={X=237,Y=166,地图=1001},
赌日天={X=22,Y=163,地图=1001},
游奕灵官={X=160,Y=76,地图=1001},
雪人={X=437,Y=72,地图=1001},

刻晴={X=399,Y=66,地图=1001},
月寒={X=364,Y=50,地图=1001},
全功仔={X=382,Y=51,地图=1001},
哒总={X=378,Y=53,地图=1001},
菊花={X=387,Y=49,地图=1001},
曲终人散={X=378,Y=44,地图=1001},
季珪={X=383,Y=60,地图=1001},
御风神行={X=396,Y=55,地图=1001},
风清柒={X=348,Y=48,地图=1001},
阿饼={X=352,Y=50,地图=1001},
江湖小虾米={X=357,Y=52,地图=1001},
踏月夜归人={X=377,Y=35,地图=1001},
风度翩翩={X=383,Y=39,地图=1001},
书生={X=353,Y=35,地图=1001},
扳手={X=360,Y=33,地图=1001},
神器制造者={X=374,Y=48,地图=1001},
六一大侠={X=396,Y=71,地图=1001},
大鱼海棠={X=408,Y=65,地图=1001},
方寸是星河={X=403,Y=69,地图=1001},


--书香斋

夺旗竞赛裁判={X=137,Y=10,地图=6019},
传送侍卫={X=7,Y=95,地图=6019},


传送侍卫={X=29,Y=19,地图=6020},
传送侍卫={X=133,Y=12,地图=6020},


颜如玉={X=27,Y=25,地图=1019},


杂货店老板={X=21,Y=15,地图=1015},

--广源钱庄

钱庄老板={X=29,Y=25,地图=1013},


殷丞相={X=31,Y=29,地图=1049},
殷夫人={X=14,Y=36,地图=1049},


秦夫人={X=24,Y=18,地图=1056},


秦琼={X=31,Y=29,地图=1057},

--长寿村钱庄

钱庄老板={X=21,Y=14,地图=1081},

--傲来钱庄

钱庄老板={X=26,Y=24,地图=1099},

--冯记铁铺

冯铁匠={X=25,Y=16,地图=1025},
打铁炉={X=29,Y=19,地图=1025},


罗百万={X=37,Y=41,地图=1033},
小桃红={X=42,Y=39,地图=1033},
陈妈妈={X=33,Y=33,地图=1033},

--金銮殿

魏征={X=70,Y=52.5,地图=1044},
房玄龄={X=78,Y=57,地图=1044},
李世民={X=51,Y=46,地图=1044},

--长安酒店

店小二={X=12,Y=29,地图=1028},
酒店老板={X=41,Y=34,地图=1028},

--大唐官府

程夫人={X=28,Y=26,地图=1198},
丫鬟={X=24,Y=28,地图=1198},
程府护卫={X=89,Y=95,地图=1198},
程府护卫={X=121.5,Y=82.4,地图=1198},
程府护卫={X=128,Y=79,地图=1198},
程府护卫={X=155,Y=63,地图=1198},
传送护卫={X=72,Y=61,地图=1198},


程咬金={X=21,Y=21,地图=1054},

--长安药店

药店老板={X=13.5,Y=18.7,地图=1016},

--长安镖局

郑镖头={X=31,Y=24,地图=1024},

--长安兵铁铺

武器店掌柜={X=16,Y=21,地图=1020},
武器店老板={X=28,Y=21,地图=1020},
长安城武器店老板={X=28,Y=21,地图=1020},

--国子监

吴举人={X=26,Y=26,地图=1026},

--云来酒店

酒店老板={X=38,Y=24,地图=1030},

--化生寺

疥癞和尚={X=37,Y=55,地图=1002},
接引僧={X=58,Y=66,地图=1002},
慧海={X=46,Y=60,地图=1002},
小胖和尚={X=46,Y=60,地图=1002},
慧悲={X=20,Y=51,地图=1002},
空慈方丈={X=40,Y=25,地图=1002},
慧静={X=113,Y=47,地图=1002},


马超={X=54,Y=49,地图=1004},
妩媚狐仙={X=71,Y=7,地图=1004},


黄忠={X=85,Y=23,地图=1005},
赌霸城={X=77,Y=71,地图=1005},


张飞={X=54,Y=36,地图=1006},
半阁守将={X=71,Y=10,地图=1006},


关羽={X=79,Y=41,地图=1007},
流氓兔={X=103,Y=24,地图=1007},


赵云={X=59,Y=36,地图=1008},
-- 流氓兔={X=103,Y=24,地图=1008},


大雁塔塔主={X=70,Y=44,地图=1090},


镇塔之神={X=29,Y=24,1009},
狂盗={X=58,Y=23,地图=1009},


慧明={X=14,Y=23,地图=1528},
法明长老={X=29,Y=21,地图=1528},


空度禅师={X=7,Y=17,地图=1043},

--长安饰品店

饰品店老板={X=26,Y=21,地图=1017},

--长安衣服店

服装店老板={X=35,Y=19,地图=1022},

--傲来国

船夫={X=188,Y=135,地图=1092},
仙岛引路人={X=18,Y=51,地图=1092},
驿站老板={X=63,Y=67,地图=1092},
超级巫医={X=53,Y=119,地图=1092},
蝴蝶妹妹={X=67,Y=98,地图=1092},
九头精怪={X=47,Y=64,地图=1092},
报名官={X=144,Y=59,地图=1092},
偷偷怪={X=107,Y=42,地图=1092},
金毛猿={X=202,Y=6,地图=1092},
傲来珍品商人={X=56,Y=38,地图=1092},
傲来商人={X=180,Y=46,地图=1092},
傲来货商={X=87,Y=41,地图=1092},
红毛猿={X=57,Y=47,地图=1092},
渔夫={X=150,Y=143,地图=1092},
蓝火兽={X=197,Y=128,地图=1092},
吸血蝙蝠={X=188,Y=90,地图=1092},
肾宝狼={X=115,Y=86,地图=1092},



王福来={X=21,Y=24,地图=1093},
慕容先生={X=44,Y=18,地图=1093},


沈妙衣={X=28,Y=21,地图=1104},


杂货店老板={X=15,Y=24,地图=1105},


杜天={X=23,Y=18,地图=1101},


牛师傅={X=27,Y=21,地图=1095},

--女儿村

翠花={X=73,Y=96,地图=1142},
栗栗娘={X=102,Y=56,地图=1142},
柳飞絮={X=11,Y=98,地图=1142},
绿儿={X=77,Y=68,地图=1142},
翠儿={X=34,Y=70,地图=1142},
接引女使={X=24,Y=14,地图=1142},


孙婆婆={X=25,Y=20,地图=1143},

--方寸

菩提老祖={X=45,Y=30,地图=1137},

--天宫

守门天将={X=242,Y=154,地图=1111},
执法天兵={X=231.5,Y=149.5,地图=1111},
守门天兵={X=238.8,Y=146,地图=1111},
接引仙女={X=148.5,Y=109.8,地图=1111},
守门道童={X=25,Y=146.5,地图=1111},
守门道童={X=32,Y=144,地图=1111},
千里眼={X=175,Y=102,地图=1111},
顺风耳={X=117,Y=113,地图=1111},
马真人={X=229,Y=95,地图=1111},
天牢守卫={X=228,Y=25,地图=1111},
水兵统领={X=175,Y=28,地图=1111},
大力神灵={X=19,Y=39,地图=1111},

--梦战天宫

秋风的回忆={X=89,Y=76,地图=6035},

--梦战天宫

秋风的回忆={X=117,Y=10,地图=6040},
太白金星={X=193,Y=128,地图=6040},

--梦战兜率宫

太上老君={X=20,Y=17,地图=6041},
三清={X=15,Y=20,地图=6041},

--梦战凌霄殿

玉皇大帝={X=25,Y=33,地图=6042},

--凌霄殿

杨戬={X=54.5,Y=53.4,地图=1112},
李靖={X=26,Y=43,地图=1112},
玉皇大帝={X=29.8,Y=34.8,地图=1112},
王母娘娘={X=35.0,Y=31.5,地图=1112},
哪吒={X=65.7,Y=46.8,地图=1112},


太上老君={X=14,Y=20,地图=1113},
炼丹道士={X=35,Y=23,地图=1113},
金童子={X=23,Y=23,地图=1113},


吴刚={X=12,Y=60,地图=1114},
嫦娥={X=97,Y=29,地图=1114},
康太尉={X=104,Y=35,地图=1114},

--魔王寨

守门牛妖={X=13,Y=75,地图=1512},
守门牛妖={X=17,Y=78,地图=1512},
传送牛妖={X=87,Y=13,地图=1512},


牛魔王={X=33,Y=21,地图=1145},

--五庄

接引道童={X=46.5,Y=37,地图=1146},
清风={X=60,Y=43,地图=1146},

--乾坤殿

镇元子={X=25.5,Y=20.5,地图=1147},

--狮驼岭

守山小妖={X=114,Y=8,地图=1131},
守山小妖={X=119.2,Y=12.5,地图=1131},
传送小妖={X=111,Y=71,地图=1131},

--狮王洞

二大王={X=29,Y=19,地图=1132},


三大王={X=25,Y=21,地图=1133},


大大王={X=29.2,Y=19.2,地图=1134},

--盘丝岭

女妖={X=110,Y=104,地图=1513},
金琉璃={X=64.5,Y=81,地图=1513},
栗栗儿={X=73,Y=85,地图=1513},
看门小妖={X=171.8,Y=27.5,地图=1513},
看门小妖={X=180,Y=33,地图=1513},
引路小妖={X=180,Y=22,地图=1513},


春十三娘={X=30,Y=42,地图=1144},
白晶晶={X=38,Y=13,地图=1144},

--神木林

引路族民={X=54,Y=92,地图=1138},
云中月={X=22,Y=68,地图=1138},
云小奴={X=17,Y=48,地图=1138},
满天星={X=25,Y=37,地图=1138},


巫奎虎={X=33.5,Y=32,地图=1154},

--碗子山

碗子山土地={X=25,Y=173,地图=1228},

--无底洞

璎珞={X=85,Y=49,地图=1139},
墨衣={X=4,Y=54,地图=1139},
红莲={X=29,Y=15,地图=1139},
接引小妖={X=47,Y=120,地图=1139},


地涌夫人={X=49.6,Y=27.6,地图=1156},
灵鼠娃娃={X=55,Y=33,地图=1156},

--丝绸之路

驿站老板={X=464,Y=92,地图=1235},

--麒麟山

驿站老板={X=70,Y=140,地图=1210},

--蓬莱仙岛

驿站老板={X=9.2,Y=101.8,地图=1207},

--长寿村

慧觉和尚={X=120,Y=141,地图=1070},
陆萧然={X=20,Y=185,地图=1070},
蝴蝶女={X=47,Y=71,地图=1070},
太白金星={X=53,Y=194,地图=1070},
海老先生={X=107,Y=175,地图=1070},
钟书生={X=43,Y=51,地图=1070},
许姑娘={X=76,Y=35,地图=1070},
仓库管理员={X=100,Y=149,地图=1070},
南极仙翁={X=107,Y=22,地图=1070},
长寿珍品商人={X=109,Y=158,地图=1070},
长寿商人={X=141,Y=41,地图=1070},
长寿货商={X=54,Y=168,地图=1070},
许大娘={X=80,Y=144,地图=1070},
超级巫医={X=126,Y=101,地图=1070},
毛驴张={X=76,Y=82,地图=1070},
凤凰姑娘={X=25,Y=103,地图=1070},
马婆婆={X=43,Y=140,地图=1070},
长寿村村长={X=16,Y=169,地图=1070},
PK申请人={X=50,Y=113,地图=1070},
药店老板={X=89,Y=192,地图=1070},


裁缝张={X=23.2,Y=20,地图=1083},


子鼠={X=114,Y=47,地图=1213},
丑牛={X=113,Y=38,地图=1213},
寅虎={X=115,Y=28,地图=1213},
卯兔={X=117,Y=20,地图=1213},


武器店老板={X=19,Y=20,地图=1085},

--月宫

吴刚={X=12,Y=63,地图=1114},

--小雷音寺

丹青生={X=22,Y=48,地图=1204},

--聚义堂

帮派总管={X=23,Y=22,地图=1875},
黑色机关人={X=47,Y=29,地图=1875},

--青龙堂

青龙总管={X=18,Y=19,地图=1865},
橙色机关人={X=30,Y=19,地图=1865},

--药房

药房总管={X=20,Y=16,地图=1855},
红色机关人={X=15,Y=21,地图=1855},

--厢房

厢房总管={X=18,Y=18,地图=1845},
绿色机关人={X=16,Y=23,地图=1845},

--兽室

帮派守护兽={X=20,Y=20,地图=1835},
青色机关人={X=35,Y=22,地图=1835},

--书院

帮派师爷={X=15,Y=17,地图=1825},
蓝色机关人={X=33,Y=21,地图=1825},

--金库

金库总管={X=22,Y=22,地图=1815},
紫色机关人={X=27,Y=20,地图=1815},

--车迟副本

道观={X=88,Y=28,地图=6021},


道场督僧={X=38,Y=61,地图=6024},
道场童子={X=4,Y=86,地图=6024},


传送侍卫={X=501,Y=6,地图=6025},
代笔师爷={X=483,Y=125,地图=6025},
瓜农={X=478,Y=119,地图=6025},
绣娘={X=459,Y=162,地图=6025},
喜轿轿夫={X=483,Y=147,地图=6025},
卖艺者={X=430,Y=182,地图=6025},
乞丐乙={X=455,Y=184,地图=6025},
阿咪={X=470,Y=192,地图=6025},
马商={X=407,Y=211,地图=6025},
小顽童={X=401,Y=203,地图=6025},
卖花童={X=420,Y=219,地图=6025},
丫鬟={X=424,Y=222,地图=6025},
富家小姐={X=431,Y=225,地图=6025},
卖鱼人={X=442,Y=229,地图=6025},
面点师傅={X=443,Y=223,地图=6025},
针线娘子={X=464,Y=240,地图=6025},
樵夫={X=462,Y=262,地图=6025},
大财主={X=427,Y=228,地图=6025},
曾衙役={X=421,Y=225,地图=6025},
布陈太医={X=370,Y=243,地图=6025},
游方郎中={X=389,Y=234,地图=6025},


传送侍卫={X=86,Y=29,地图=1249},


传送侍卫={X=137,Y=46,地图=1250},


齐天大圣={X=91,Y=16,地图=1251},
传送侍卫={X=90,Y=24,地图=1251},


天女魃={X=41,Y=16,地图=1252},


小夫子={X=58,Y=127,地图=1253},


女佣={X=31,Y=44,地图=1332},
管家={X=46,Y=49,地图=1332},


看门爬虫={X=16,Y=26,地图=1340},
看门爬虫={X=24,Y=32,地图=1340},


判官={X=47,Y=65,地图=6037},
阎王={X=31,Y=53,地图=6037},


玉皇大帝={X=152,Y=108,地图=6038},
天蓬元帅={X=247,Y=104,地图=6038},


镇塔之神={X=25,Y=24,地图=6039},
}