-- @Author: baidwwy
-- @Date:   2023-03-10 11:49:53
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-07-01 20:33:05
-- @Author: baidwwy
-- @Date:   2023-03-10 11:49:53
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-05-20 13:08:21
--======================================================================--

--======================================================================--
function 取假人表(地图ID,假人ID)

	local 假人 = {}
	if 地图ID == 1003 then--桃园
		假人[1]={名称="夏大叔",模型="男人_苦力",X=37,方向=3,Y=85,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2]={名称="窑窑",模型="女人_绿儿",X=42,方向=2,Y=88,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3]={名称="彤彤",模型="女人_绿儿",X=71,方向=0,Y=87,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4]={名称="萍儿",模型="女人_赵姨娘",X=78,方向=1,Y=87,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5]={名称="桃源仙女",模型="普陀_接引仙女",X=115,方向=0,Y=63,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6]={名称="郭大哥",模型="男人_店小二",X=163,方向=0,Y=73,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7]={名称="狸",模型="狸",X=171,方向=1,Y=79,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8]={名称="狸",模型="狸",X=170,方向=1,Y=70,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9]={名称="狸",模型="狸",X=165,方向=0,Y=85,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10]={名称="谭村长",模型="男人_村长",X=163,方向=1,Y=48,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11]={名称="玄大夫",模型="男人_药店老板",X=137,方向=1,Y=47,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12]={名称="雨画师",模型="男人_老书生",X=126,方向=1,Y=50,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13]={名称="孙厨娘",模型="女人_染色师",X=108,方向=0,Y=40,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14]={名称="刘大婶",模型="女人_翠花",X=110,方向=0,Y=21,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15]={名称="小绿",模型="小毛头",X=123,方向=0,Y=16,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16]={名称="清清",模型="小丫丫",X=128,方向=1,Y=14,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17]={名称="孙猎户",模型="男人_铁匠",X=164,方向=3,Y=18,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[18]={名称="野猪",模型="野猪",X=171,方向=1,Y=14,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[19]={名称="霞姑娘",模型="女人_丫鬟",X=78,方向=2,Y=25,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[20]={名称="新手接待师",模型="普陀_接引仙女",饰品=true,称谓="新手礼包",X=27,方向=1,Y=27,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    --假人[20]={名称="新手接待师",称谓="新手礼包",武器="弦月",模型="巫蛮儿",锦衣="冰雪玉兔",X=32,方向=1,Y=19,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    --假人[21]={名称="狼宝宝",模型="神天兵",武器="狂澜碎岳",染色方案=9,染色组={3,3,3},称谓="→助战获取←",X=51,方向=4,Y=9,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[21]={名称="狼宝宝",模型="神天兵",武器="天龙破城",锦衣="青花瓷",染色方案=9,染色组={3,3,3},称谓="盖世英雄",X=51,方向=4,Y=9,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

        if 池定制 then
        	假人[21]=nil
        end

	elseif 地图ID == 1501 then--建邺城
		假人[1] = {名称="宠物仙子",模型="普陀_接引仙女",X=62,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="戏班班主",模型="男人_老伯",X=84,Y=31,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="吹牛王",模型="男人_苦力",X=88,Y=38,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="刻晴",称谓="查询领取",模型="剑侠客",锦衣="黑浪淘纱",武器="偃月青龙",X=41,Y=101,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="飞儿",模型="小孩_飞儿",X=97,Y=49,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[6] = {名称="勾魂马面",模型="马面",X=97,Y=12,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="王大嫂",模型="女人_王大嫂",X=139,Y=14,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="海产收购商",模型="男人_钓鱼",X=232,Y=13,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="老孙头",模型="男人_老孙头",X=224,Y=10,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="陈长寿",模型="男人_药店老板",X=222,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="罗招弟",模型="小孩_飞儿",X=217,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="牛大胆",模型="男人_道士",X=230,Y=38,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="装备收购商",模型="男人_苦力",X=238,Y=24,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="装备鉴定商",模型="男人_苦力",X=243,Y=28,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=214,Y=44,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="赵元宝",模型="男人_老伯",X=227,Y=79,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17] = {名称="小花",模型="普陀_接引仙女",X=204,Y=106,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[18] = {名称="赵捕头",模型="男人_衙役",称谓="新手任务",X=115,Y=80,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[19] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=107,Y=87,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[20] = {名称="张来福",模型="男人_镖头",X=87,Y=71,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[21] = {名称="建邺特产商人",模型="男人_特产商人",X=84,Y=77,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[22] = {名称="马全有",模型="男人_武器店老板",X=49,Y=89,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[23] = {名称="迎客僧",模型="男人_胖和尚",X=10,Y=89,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[24] = {名称="管家",模型="男人_店小二",X=42,Y=64,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[25] = {名称="符全",模型="男人_兰虎",X=18,Y=54,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[26] = {名称="建邺守卫",称谓="传送江南野外",模型="男人_衙役",X=15.5,Y=138.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[27] = {名称="雷黑子",模型="小孩_雷黑子",X=70,Y=133,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[28] = {名称="教书先生",模型="男人_书生",X=77,Y=54,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[29] = {名称="仓库管理员",模型="仓库保管员",X=52,Y=112,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[30] = {名称="梨园小贩",模型="小孩_飞儿",称谓="建业密探任务",X=49,Y=12,方向=1,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[31] = {名称="技能指导师",模型="男人_武器店老板",X=73,Y=61,方向=1,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[32] = {名称="好友推荐人",模型="女人_绿儿",X=202,Y=89,方向=0,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[33] = {名称="仙族使者",模型="女人_万圣公主",X=190,Y=111,方向=1,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       -- 假人[34] = {名称="魔族使者",模型="二大王",X=201,Y=116,方向=1,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[35] = {名称="人族使者",模型="程咬金",X=181,Y=115,方向=0,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[36] = {名称="大唐驿使",模型="男人_马副将",X=275,Y=73,方向=0,显示饰品=true,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[37] = {名称="老胡",模型="男人_店小二",X=54,Y=110,方向=0,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[38] = {名称="刘老爹",模型="男人_村长",X=32,Y=111,方向=0,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[39] = {名称="梦幻新手指引",模型="花妖",X=19,Y=132,方向=0,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[40] = {名称="新手指引",模型="花妖",X=239,Y=15,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[41] = {名称="小小七",称谓="情怀剧情使",模型="龙太子",锦衣="青花瓷",武器="弑皇",X=201,Y=19,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 6043 then --梦战建邺城
        假人[1] = {名称="宠物仙子",模型="普陀_接引仙女",X=62,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[2] = {名称="张捕头",模型="男人_镖头",X=87,Y=71,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[3] = {名称="小小七",称谓="情怀剧情使",模型="龙太子",锦衣="竹林熊猫",武器="弑皇",X=201,Y=19,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[4] = {名称="江南小盗",模型="强盗",X=80,Y=2,方向=0}
        假人[5] = {名称="老孙头",模型="男人_老孙头",X=224,Y=10,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[6] = {名称="小红",模型="少女",X=41,Y=64,方向=0}
        假人[7] = {名称="渔夫",模型="男人_钓鱼",X=39,Y=66,方向=0}
        假人[8] = {名称="黄狮王",模型="巨魔王",X=43,Y=68,方向=2,武器="五丁开山"}
    elseif 地图ID == 6044 then --梦战东海湾
    	假人[1] = {名称="大大龟",模型="大海龟",X=77,Y=99,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[2] = {名称="果毛虫",模型="海毛虫",X=81,Y=105,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 6045 then --梦战岩洞
    	假人[1] = {名称="绿皮蛙",模型="巨蛙",X=82,Y=42,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 6046 then --梦战海底
		假人[1] = {名称="屈原",模型="考官2",X=48,Y=30,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="狂盗",模型="强盗",染色方案=74,染色组={1,1},X=153,Y=17,方向=1}
    elseif 地图ID == 1525  then
		假人[1] = {名称="小宝箱",模型="宝箱",X=19,Y=20,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1127  then
		假人[1] = {名称="幽冥鬼",模型="巡游天神",X=52,Y=31,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1193  then---江南野外
		假人[1] = {名称="罗纤纤",模型="女人_丫鬟",X=25,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="江湖奸商",模型="仓库保管员",X=102,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="卵二姐",模型="女人_丫鬟",X=23,Y=99,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="樵夫",模型="樵夫",X=134,Y=96,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="洛树妖",模型="树怪",称谓="旭梦篇",X=43,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1129  then
		假人[1] = {名称="无名野鬼",模型="野鬼",X=64,Y=26,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1103  then
		假人[1] = {名称="美猴王",模型="孙悟空",称谓="剧情技能",X=62,Y=34,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1505  then
		假人[1] = {名称="杂货店老板",模型="男人_巫医",X=35,Y=26,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1202 then
		假人[1] = {名称="小宝箱",模型="宝箱",X=127,Y=17,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1208 then
		假人[1] = {名称="朱紫校尉",模型="校尉",X=138,Y=21,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="药店伙计",模型="男人_苦力",X=125,Y=97,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="紫阳药师",模型="男人_药店老板",X=144,Y=82,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="端木娘子",模型="女人_栗栗娘",X=97,Y=113,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="朱紫侍卫",模型="校尉",X=21,Y=115,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="朱紫侍卫",模型="校尉",X=7,Y=109,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=9,Y=31,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="申太公",模型="男人_村长",X=76,Y=105,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="妖魔亲信",模型="蝴蝶仙子",X=104,Y=10,方向=1,变异=true,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="土地公公",模型="男人_土地",X=21,Y=25,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1040 then--西凉女国
		假人[1] = {名称="西梁女兵",模型="女兵",X=129,Y=104,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="西梁女兵",模型="女兵",X=141,Y=99,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[3] = {名称="西梁女兵",模型="女兵",X=73,Y=107,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[4] = {名称="西梁女兵",模型="女兵",X=67,Y=110,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="驿站老板",称谓="传送朱紫国",模型="男人_驿站老板",X=18,Y=71,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="驿站老板",称谓="传送丝绸之路",模型="男人_驿站老板",X=15,Y=114,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="周吊伦",称谓="剧情大师",模型="周杰伦",X=85,Y=62,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[8] = {名称="藏宝阁大使",称谓="人物取回",模型="太白金星",X=96,Y=36,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="西凉国王",称谓="69级突破战斗",模型="春十三娘",X=21,Y=18,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1215 then
		假人[1] = {名称="蜃妖元神",称谓="",模型="炎魔神",X=52,Y=32,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1216 then
		假人[1] = {名称="御兽仙",称谓="召唤兽进阶",模型="进阶凤凰",X=151,Y=59,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="百兽王",称谓="坐骑任务",模型="大大王",X=24,Y=84,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	--	假人[3] = {名称="桃园仙翁",称谓="坐骑饰品",模型="南极仙翁",X=67,Y=94,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    --  假人[4] = {名称="仙缘染坊主",称谓="坐骑染色",模型="女人_赵姨娘",X=121,Y=61,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- elseif 地图ID == 1209 then--朱紫国皇宫
	-- 	假人[1] = {名称="朱紫国国王",模型="宝象国国王",X=65,Y=39,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 	假人[2] = {名称="阿米国师",模型="小西天和尚",X=53,Y=38,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1226 then
		假人[1] =  {名称="驿站老板",称谓="传送长安城",模型="男人_驿站老板",X=143,Y=27,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="镖局学童",模型="男人_店小二",X=54,Y=14,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="土地公公",称谓="宝藏山传送员",模型="男人_土地",X=119,Y=16,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[4] = {名称="北斗星君",称谓="玲珑石任务",模型="太白金星",X=103,Y=40,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[5] = {名称="仓库管理员",模型="仓库管理员",X=110,Y=44,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[6] = {名称="药店老板",模型="男人_药店老板",X=148,Y=67,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[7] = {名称="花店老板",模型="金圣宫",X=117,Y=77,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[8] = {名称="香料店老板",模型="金圣宫",X=69,Y=64,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[9] = {名称="小木匠",模型="小木匠",X=69,Y=68,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[10] = {名称="武器大师",模型="男人_武器店老板",X=71,Y=67,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[11] = {名称="逍遥游侠",模型="小白龙",X=74,Y=65,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[12] = {名称="霓裳姑娘",模型="灵鼠娃娃",X=43,Y=80,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 5001 then
		假人[1] = {名称="土地公公",称谓="传送至宝象国",模型="男人_土地",X=76,Y=24,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1537 then--建邺城衙门
		假人[1] = {名称="建邺县令",模型="男人_老书生",X=43,Y=17,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[1] = {名称="贸易车队总管",模型="男人_老财",X=12,Y=28,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="衙役",模型="男人_衙役",X=17,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="衙役",模型="男人_衙役",X=26,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="衙役",模型="男人_衙役",X=26,Y=29,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="衙役",模型="男人_衙役",X=33,Y=25,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="简师爷",模型="男人_师爷",X=30,Y=19,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1523 then
		假人[1] = {名称="当铺老板",模型="男人_特产商人",X=28,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1502 then
		假人[1] = {名称="武器店老板",模型="男人_武器店老板",X=22,Y=18,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2]  = {名称="武器店掌柜",模型="男人_老孙头",X=15,Y=18,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[3]  = {名称="打铁炉",模型="物件_打铁炉",X=19,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1503 then
		假人[1] = {名称="服装店老板",模型="男人_服装店老板",X=24,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[2] = {名称="缝纫台",模型="物件_缝纫台",X=28,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1504 then
		假人[1] = {名称="药店老板",模型="男人_药店老板",X=28,Y=20,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1526 then
		假人[1]  = {名称="周猎户",模型="男人_兰虎",X=20,Y=25,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1524 then
		假人[1] = {名称="钱庄老板",模型="男人_财主",X=36,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1534 then
		假人[1]  = {名称="李善人",模型="男人_老财",X=21,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 东海湾
	elseif 地图ID == 1506 then
		假人[1] = {名称="船夫",称谓="传送傲来国",模型="男人_驿站老板",X=55,Y=112,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="云游神医",模型="男人_药店老板",X=75,Y=109,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="超级巫医",模型="男人_巫医",X=101,Y=104,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="林老汉",称谓="传送东海岩洞",模型="男人_村长",X=91,Y=81,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="老虾",称谓="传送龙宫",模型="虾兵",X=115,Y=29,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="楚恋依",模型="普陀_接引仙女",X=58,Y=35,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="海盗头子",模型="强盗",X=18,Y=102,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="牛二",模型="男人_老伯",X=59,Y=70,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="玉面公主",模型="狐狸精",X=88,Y=11,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 国境
	elseif 地图ID == 1110 then
		假人[1] = {名称="大唐国境土地",称谓="传送凌波城",模型="男人_土地",X=177,Y=74,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="普陀山接引仙女",称谓="传送普陀山",模型="普陀_接引仙女",X=229,Y=269,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="小二",模型="男人_店小二",X=68,Y=268,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="驿站老板",称谓="传送长安城",模型="男人_驿站老板",X=86,Y=86,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=35,Y=257,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="者释和尚",模型="男人_胖和尚",X=174,Y=248,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="业释和尚",模型="男人_胖和尚",X=186,Y=184,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="海释和尚",模型="男人_胖和尚",X=139,Y=157,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="白琉璃",模型="星灵仙子",X=27,Y=176,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="山神",模型="雨师",X=43,Y=98,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="虾兵",模型="虾兵",X=241,Y=76,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="吴老爹",模型="男人_村长",X=312,Y=82,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="小芸芸",模型="女人_丫鬟",X=169,Y=33,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="吴文彩",模型="男人_书生",X=306,Y=116,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="婆婆",模型="女人_孟婆",X=35,Y=310,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="文秀",模型="女人_丫鬟",X=238,Y=54,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17] = {名称="衙役",模型="男人_衙役",X=314,Y=37,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[18] = {名称="赌徒喽啰",模型="赌徒",称谓="旭梦篇",X=252,Y=117,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[19] = {名称="江洋大盗",模型="强盗",称谓="旭梦篇",X=223,Y=19,方向=0}
		假人[20] = {名称="洛川鬼",模型="骷髅怪",称谓="旭梦篇",X=37,Y=22,方向=1}
		假人[21] = {名称="大唐国境西域使者",模型="男人_马副将",X=30,Y=145,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1153 then
		假人[1] = {名称="酒肉和尚",称谓="剧情战斗",模型="雨师",X=38,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="玄奘",称谓="金蝉子",模型="唐僧",X=13,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1168 then
		假人[1] = {名称="刘洪",模型="护卫",X=38,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="殷温娇",模型="陈妈妈",X=13,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="江州县令",模型="男人_老书生",称谓="旭梦篇",X=27,Y=21,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 凌波城
	elseif 地图ID == 1150 then
		假人[1] = {名称="二郎神",称谓="门派师傅",模型="二郎神",X=68,Y=32,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="哮天犬",模型="哮天犬",X=77,Y=36,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="守门天将",模型="天兵",X=6,Y=88,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="守门天将",模型="天兵",X=15,Y=93.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[12] = {名称="荀卿",称谓="凌波城少主",模型="剑侠客",武器="擒龙",X=49,Y=65,方向=4,染色方案=2,染色组={3,3,4},事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="荒芜星",模型="狂豹人形",X=23,Y=117,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="刀砧星",模型="鲛人",X=29,Y=141,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="反吟星",模型="羊头怪",X=54,Y=137,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="天瘟星",模型="犀牛将军人形",X=93,Y=104,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="伏断星",模型="野猪精",X=100,Y=48,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="破碎星",模型="百足将军",X=26.5,Y=55.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="传送天将",称谓="传送长安",模型="天兵",X=44,Y=57,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 普陀山
	elseif 地图ID == 1140 then
		假人[2] = {名称="龙女宝宝",模型="小龙女",X=23,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="黑熊怪",模型="黑熊精",X=24,Y=47,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[1] = {名称="接引仙女",称谓="传送长安",模型="普陀_接引仙女",X=16,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 潮音洞
	elseif 地图ID == 1141 then
		假人[1] = {名称="观音姐姐",称谓="门派师傅",模型="观音姐姐",X=12.5,Y=11.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="青莲仙女",模型="普陀_接引仙女",X=25,Y=33,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 地府
	elseif 地图ID == 1122 then
		假人[1] = {名称="钟馗",称谓="捉鬼任务",模型="男人_钟馗",X=63,Y=60,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="马面",模型="马面",X=10,Y=87,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="追梦鬼",模型="兔子怪",X=10,Y=104,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="地遁鬼",称谓="传送长安",模型="僵尸",X=27.5,Y=63.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="孟婆",模型="女人_孟婆",X=99.5,Y=94.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="地府商人",模型="男人_特产商人",X=83,Y=108,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="地府货商",模型="男人_老财",X=68,Y=73,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 森罗 3.4 2
	elseif 地图ID == 1123 then
		假人[1] = {名称="判官",模型="男人_判官",X=18,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="阎罗王",模型="阎罗王",X=22.2,Y=26.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="转轮王",模型="阎罗王",X=25.6,Y=28.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="秦广王",模型="阎罗王",X=29,Y=30.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="初江王",模型="阎罗王",X=32.4,Y=32.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="宋帝王",模型="阎罗王",X=35.8,Y=34.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="卞城王",模型="阎罗王",X=31.7,Y=21.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="平等王",模型="阎罗王",X=35.1,Y=23.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="泰山王",模型="阎罗王",X=38.5,Y=25.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="都市王",模型="阎罗王",X=41.9,Y=27.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="忤官王",模型="阎罗王",X=45.3,Y=29.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1125 then
		假人[1] = {名称="白无常",模型="白无常",称谓="传送长安",X=20,Y=23,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="黑无常",模型="黑无常",称谓="鬼王任务",X=37,Y=22,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 地藏王府
	elseif 地图ID == 1124 then
		假人[1] = {名称="地藏王",称谓="门派师傅",模型="地藏王",X=32,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 龙宫
	elseif 地图ID == 1116 then
		假人[1] = {名称="虾兵",称谓="传送东海湾",模型="虾兵",X=24,Y=97,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="蟹将军",模型="蟹将",X=32,Y=100,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="虾兵",模型="虾兵",X=40,Y=104,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="龟千岁",模型="龟丞相",X=99,Y=57,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="小龙女",模型="小龙女",X=96,Y=49,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="虾兵",模型="虾兵",X=47,Y=21,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="龟太尉",模型="龟丞相",X=53,Y=16,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="虾兵",模型="虾兵",X=62,Y=14,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="虾兵",模型="虾兵",X=188,Y=12,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="蛤蟆勇士",模型="蛤蟆精",X=195,Y=16,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="虾兵",模型="虾兵",X=203,Y=20,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="虾兵",模型="虾兵",X=188,Y=92,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="虾将军",模型="虾兵",X=195,Y=88,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="虾兵",模型="虾兵",X=203,Y=84,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="万圣公主",模型="女人_万圣公主",X=18,Y=50,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[17] = {名称="小白龙",模型="男人_小白龙",X=81,Y=60,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="传送蟹将",称谓="传送长安",模型="蟹将",X=108,Y=60,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 水晶宫
	elseif 地图ID == 1117 then
		假人[1] = {名称="东海龙王",称谓="门派师傅",模型="东海龙王",X=39,Y=25,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	--海底
	elseif 地图ID == 1507 then
		假人[1] = {名称="螃蟹精",称谓="传送建邺城",模型="蟹将",X=34,Y=31,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="蛤蟆精",模型="蛤蟆精",X=50,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 花果山
	elseif 地图ID == 1514 then
		假人[1] = {名称="老马猴",称谓="法术认证",模型="马猴",X=42,Y=75,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="猴医仙",模型="长眉灵猴",X=135,Y=36,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="老猕猴",称谓="潜能果兑换",模型="马猴",X=44,Y=14,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 北俱芦洲
	elseif 地图ID == 1174 then
		假人[1] = {名称="地遁鬼",模型="兔子怪",称谓="传送长寿郊外",X=195,Y=163,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="女娲神迹传送人",模型="净瓶女娲",称谓="传送女娲神迹",X=13,Y=17,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="青琉璃",模型="星灵仙子",X=202,Y=35,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="超级巫医",模型="男人_巫医",X=29,Y=105,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="龙女妹妹",模型="小龙女",X=138,Y=71,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="莽汉",模型="山贼",X=38,Y=129,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="北俱商人",模型="男人_特产商人",X=148,Y=145,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="北俱货商",模型="男人_老财",X=198,Y=91,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="驿站老板",称谓="传送长安城",模型="男人_驿站老板",X=93,Y=76,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="雷鸟精",模型="雷鸟人",X=63,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="白熊怪",模型="白熊",X=108,Y=117,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="翻天怪",模型="地狱战神",X=181,Y=137,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 花果山
	-- 长寿郊外
	elseif 地图ID == 1091 then
		假人[1] = {名称="驿站老板",模型="男人_驿站老板",称谓="传送北俱芦洲",X=68,Y=88,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="传送天将",模型="男人_将军",称谓="传送天宫",X=22,Y=112,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="西牛贺洲土地",模型="男人_土地",称谓="传送大唐境外",X=90,Y=158,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="鬼谷道人",模型="男人_道士",称谓="降妖除魔",X=133,Y=86,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="路人甲",模型="赌徒",X=174,Y=119,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="长寿郊外西域使者",模型="男人_马副将",X=24,Y=128,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长寿村
	-- 方寸
	elseif 地图ID == 1135 then
		假人[2] = {名称="觉明",模型="男人_道士",X=62,Y=118,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="灵儿",模型="女人_丫鬟",X=50,Y=92,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[4] = {名称="觉岸",模型="男人_道士",称谓="剧情技能",X=108,Y=43,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[1] = {名称="接引道童",称谓="传送长安",模型="男人_道童",X=118,Y=30,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 境外
	elseif 地图ID == 1173 then
		假人[1] = {名称="南瞻部洲土地",模型="男人_土地",称谓="传送西牛贺洲",X=44,Y=102,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="驿站老板",模型="男人_驿站老板",称谓="传送碗子山",X=13,Y=95,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=50,Y=49,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="山贼头子",模型="山贼",X=94,Y=15,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="牛将军",模型="牛妖",X=79,Y=43,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="驿站老板",模型="男人_驿站老板",称谓="传送长安城",X=205,Y=93,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="白衣人",模型="逍遥生",X=234,Y=110,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="阿紫",模型="星灵仙子",X=319,Y=47,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="姚太尉",模型="天兵",X=324,Y=44,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="云游僧",模型="空度禅师",X=350,Y=89,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="白鹿精",模型="赌徒",X=354,Y=111,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="玉面狐狸",模型="狐狸精",X=349,Y=110,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=409,Y=108,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="野猪王",模型="野猪",X=480,Y=113,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="偷尸鬼",模型="骷髅怪",X=579,Y=98,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="李彪",模型="强盗",X=588,Y=101,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17] = {名称="刘洪",模型="男人_马副将",X=591,Y=104,方向=2,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[18] = {名称="强盗头子",模型="强盗",称谓="剧情技能",X=562,Y=33,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[19] = {名称="冤魂",模型="僵尸",X=603,Y=19,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[20] = {名称="至尊宝",模型="至尊宝",X=161,Y=59,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[21] = {名称="天兵飞剑",模型="天兵",X=246,Y=56,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[22] = {名称="卷帘大将",模型="沙僧",X=237,Y=64,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[23] = {名称="天蓬元帅",模型="猪八戒",X=396,Y=71,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 沉船
	elseif 地图ID == 1508 then
		假人[1] = {名称="虾精",称谓="传送建邺城",模型="虾兵",X=17,Y=16,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="妖风",模型="吸血鬼",X=55,Y=31,染色方案=96,染色组={1,1},方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1509 then
		假人[1] = {名称="商人的鬼魂",模型="野鬼",X=23,Y=27,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --武神坛
	 elseif 地图ID == 1994 then
	 	 假人[1] = {名称="武神坛使者",模型="男人_兰虎",称谓="武神坛传送",X=431,Y=171,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 	 假人[2] = {名称="打铁炉",模型="物件_打铁炉",X=438,Y=184,方向=1,事件ID=nil,执行事件="物件_打铁炉",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

	 	 假人[3] = {名称="二郎神",称谓="凌波城",模型="二郎神",X=449,Y=183,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[4] = {名称="观音姐姐",称谓="普陀山",模型="观音姐姐",X=453,Y=186,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[5] = {名称="地藏王",称谓="地府",模型="地藏王",X=457,Y=187,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[6] = {名称="东海龙王",称谓="龙宫",模型="东海龙王",X=461,Y=190,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[7] = {名称="程咬金",称谓="大唐官府",模型="程咬金",X=465,Y=191,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[8] = {名称="空度禅师",称谓="化生寺",模型="空度禅师",X=469,Y=194,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[9] = {名称="孙婆婆",称谓="女儿村",模型="孙婆婆",X=473,Y=195,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[10] = {名称="菩提老祖",称谓="方寸山",模型="菩提老祖",X=477,Y=198,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[11] = {名称="李靖",称谓="天宫",模型="李靖",X=481,Y=199,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[12] = {名称="牛魔王",称谓="魔王寨",模型="牛魔王",显示饰品=true,X=485,Y=202,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[13] = {名称="镇元子",称谓="五庄观",模型="镇元子",X=489,Y=203,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[14] = {名称="白晶晶",称谓="盘丝洞",模型="白晶晶",X=493,Y=206,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[15] = {名称="巫奎虎",称谓="神木林",模型="巫奎虎",X=497,Y=207,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[16] = {名称="地涌夫人",称谓="无底洞",模型="地涌夫人",X=501,Y=210,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         假人[17] = {名称="大大王",称谓="狮驼岭",模型="大大王",X=505,Y=211,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

         假人[18] = {名称="袁天罡",模型="袁天罡",称谓="多功能使者",X=427,Y=188,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}




	-- 长安
	elseif 地图ID == 1001 then
		假人[1] = {名称="长安导游",模型="男人_书生",X=463,Y=262,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="王夫人",模型="女人_王大嫂",X=393,Y=231,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="商会总管",模型="仓库保管员",X=329,Y=265,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="陈员外",模型="仓库保管员",X=176,Y=249,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="花香香",模型="普陀_接引仙女",X=301,Y=256,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="老花农",模型="男人_村长",X=289,Y=249,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="罗道人",模型="男人_道士",X=258,Y=243,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="染色师",模型="女人_染色师",X=290,Y=264,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="驿站老板",称谓="传送大唐国境",模型="男人_驿站老板",X=274,Y=238,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="张老财",模型="男人_老财",X=247,Y=253,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] ={名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=526,Y=95,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="门派传送人",模型="男人_镖头",X=478,Y=246.8,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="圣山传送人",模型="男人_太上老君",X=350.5,Y=205,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="门派闯关使者",称谓="十五门派大闯关活动使者",模型="护卫",显示饰品=true,X=202,Y=116,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="刘副将",模型="男人_马副将",X=147,Y=176,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="兰虎",模型="男人_兰虎",称谓="剧情技能",X=234,Y=104,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17] = {名称="马副将",模型="男人_马副将",称谓="双倍经验",X=193,Y=109,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[18] = {名称="御林军",模型="男人_马副将",称谓="精修经验",X=201,Y=106,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[19] = {名称="皇宫护卫",称谓="平定安邦",模型="护卫",X=228,Y=102,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[20] = {名称="礼部侍郎",称谓="科举大赛",模型="考官2",X=280,Y=95,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[21] = {名称="袁天罡",模型="袁天罡",称谓="全功能服务大师",X=358,Y=35,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[22] = {名称="李将军",模型="男人_马副将",称谓="官职任务",X=145,Y=84,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[23] = {名称="五行大师",模型="五行大师",称谓="点化套装",X=223,Y=156,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[24] = {名称="杜少海",模型="男人_店小二",称谓="初出江湖",X=223,Y=99,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[25] = {名称="御林军左统领",模型="护卫",称谓="皇宫飞贼",X=195,Y=119,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[26] = {名称="御林军右统领",模型="护卫",X=110,Y=49,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[27] = {名称="长安珍品商人",模型="珍品商人",X=193,Y=261,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[28] = {名称="装备收购商",模型="男人_苦力",X=419,Y=47,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[29] = {名称="装备鉴定商",模型="男人_苦力",X=429,Y=51,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[30] = {名称="仓库管理员",模型="仓库保管员",X=449,Y=107,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[31] = {名称="符石道人",模型="男人_道童",X=490,Y=203,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[32] = {名称="帮派管理员",模型="男人_兰虎",称谓="帮派业务",X=382,Y=17,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[33] = {名称="长安商人",模型="男人_特产商人",X=275,Y=166,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[34] = {名称="长安货商",模型="男人_老财",X=383,Y=120,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[35] = {名称="袁守城",模型="男人_太上老君",X=181,Y=263,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[36] = {名称="龙孙",模型="男人_小白龙",X=176,Y=267,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[37] = {名称="建房吏",模型="男人_衙役",称谓="房屋建设",X=26,Y=213,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[38] = {名称="乌巢禅师(废弃NPC)",模型="男人_方丈",X=999,Y=999,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        --假人[39] = {名称="李捕头",模型="男人_衙役",称谓="种族任务",X=10,Y=215,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
   	   	假人[40] = {名称="效果取消员",模型="男人_老书生",称谓="取消各种状态效果",X=246,Y=109,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
   	   	--假人[41] = {名称="百晓星君(废弃NPC)",模型="女人_万圣公主",X=999,Y=999,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[42] = {名称="皇宫护卫(废弃NPC)",称谓="赏金任务",模型="护卫",X=999,Y=999,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
      	假人[43] = {名称="宝石商人",模型="男人_老财",X=497,Y=140,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[44] = {名称="王捕头",模型="男人_衙役",称谓="除暴安良任务",X=19,Y=220,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[45] = {名称="长安府守卫",模型="男人_衙役",X=51,Y=242,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[46] = {名称="长安府守卫",模型="男人_衙役",X=62,Y=237,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[47] = {名称="秦府守卫",模型="护卫",X=106,Y=214,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[48] = {名称="秦府守卫",模型="护卫",X=113,Y=209,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[49] = {名称="相府守卫",模型="护卫",X=177,Y=171,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[50] = {名称="相府守卫",模型="护卫",X=195,Y=162,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[51] = {名称="节日礼物使者",模型="兔子怪",X=206,Y=153,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[52] = {名称="智能伤害测试",称谓="哎哟！不错哦",模型="周杰伦",X=227,Y=93,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[52] = {名称="御林军",模型="男人_马副将",X=209,Y=97,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[53] = {名称="御林军",模型="男人_马副将",X=175,Y=113,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[54] = {名称="御林军",模型="男人_马副将",X=140,Y=86,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[55] = {名称="御林军",模型="男人_马副将",X=151,Y=80,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[56] = {名称="御林军",模型="男人_马副将",X=126,Y=76,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[57] = {名称="御林军",模型="男人_马副将",X=138,Y=69,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[58] = {名称="御林军",模型="男人_马副将",X=112,Y=64,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	--假人[59] = {名称="御林军",模型="男人_马副将",X=124,Y=58,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[60] = {名称="房都尉",模型="男人_马副将",X=375,Y=206,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       	假人[61] = {名称="怜儿姑娘",模型="女人_丫鬟",X=259,Y=184,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	   	假人[62] = {名称="小宝",模型="小孩_飞儿",X=314,Y=147,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[63] = {名称="奖励发放员",模型="偃无师",称谓="各种活动奖励领取",锦衣="黑浪淘纱",X=240,Y=106,方向=1,武器="四法青云",事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[64] = {名称="比武大会主持人",称谓="英雄会比武PVP活动",模型="男人_将军",X=110,Y=167,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[65] = {名称="首席争霸使者",称谓="首席争霸PVP活动",模型="男人_马副将",显示饰品=true,X=235,Y=126,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[66] = {名称="神树",称谓="仙玉抽奖",模型="神树",X=220,Y=129,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[67] = {名称="帮派竞赛主持人",称谓="帮战报名官员",模型="男人_将军",X=379,Y=159,方向=1,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[68] = {名称="月老",称谓="月下老人",模型="男人_太上老君",X=422,Y=134,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[69] = {名称="轿夫",称谓="家园传送人",模型="男人_兰虎",X=519,Y=151,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[70] = {名称="孙小空",模型="超级六耳猕猴",称谓="剧情技能",X=237,Y=106,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[71] = {名称="觉岸",模型="男人_道士",称谓="剧情技能",X=240,Y=107,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[72] = {名称="强盗头子",模型="强盗",称谓="剧情技能",X=243,Y=108,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[73] = {名称="法明长老",模型="空度禅师",称谓="剧情技能",X=247,Y=110,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[74] = {名称="蝴蝶妹妹",称谓="剧情技能",模型="蝴蝶仙子",X=250,Y=112,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[75] = {名称="南极仙翁",模型="南极仙翁",称谓="剧情技能",X=254,Y=114,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[76] = {名称="钟馗",称谓="捉鬼任务",模型="男人_钟馗",X=206,Y=113,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		-- 假人[77] = {名称="老马猴",称谓="法术认证",模型="马猴",X=218,Y=103,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[78] = {名称="御兽仙",称谓="召唤兽进阶染色",模型="进阶凤凰",显示饰品=true,X=258,Y=114,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[79] = {名称="女猪脚",称谓="师徒关系",模型="鬼潇潇",锦衣="黑浪淘纱",武器="九阴勾魂",X=301,Y=91,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[80] = {名称="殷丞相",模型="考官2",X=165,Y=143,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[81] = {名称="武神坛使者",称谓="妖魔积分抽奖",模型="剑侠客",锦衣="黑浪淘纱",X=220,Y=106,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[82] = {名称="神秘老人",称谓="跨服接引人",模型="男人_太上老君",X=208,Y=114,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

        --假人[82] = {名称="赌日天",称谓="把你的摇裤儿输脱",模型="男人_老书生",X=232,Y=163,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[83] = {名称="游奕灵官",称谓="天降辰星",模型="天兵",X=212,Y=110,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[84] = {名称="雪人",称谓="新春活动",模型="雪人5",X=437,Y=72,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
  --  	    假人[85]={名称="刻晴",模型="偃无师",武器="百辟镇魂",染色方案=14,染色组={4,4,4},称谓="情怀作者",X=399,方向=4,Y=66,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		 假人[86]={名称="虚位以待",模型="龙太子",武器="弑皇",染色方案=10,染色组={3,3,4},称谓="情怀一枝花",X=364,方向=4,Y=50,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 -- 假人[87]={名称="冷少",模型="剑侠客",武器="倚天",染色方案=2,染色组={4,1,4},称谓="有钱任性",X=382,方向=0,Y=51,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --     假人[88]={名称="哒总",模型="虎头怪",武器="护法灭魔",染色方案=6,染色组={3,3,3},称谓="最骚管理员",X=378,方向=4,Y=53,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --     假人[89]={名称="菊花",模型="巨魔王",武器="业火三灾",染色方案=5,染色组={2,1,1},称谓="夏夏夏的大哥",X=387,方向=4,Y=49,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --     假人[90]={名称="曲终人散",模型="玄彩娥",武器="九霄",染色方案=12,染色组={9,7,6},称谓="刻晴小迷妹",X=378,方向=4,Y=44,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --     假人[91]={名称="季珪",模型="剑侠客",武器="四法青云",染色方案=2,染色组={0,3,3},称谓="情怀老六",X=383,方向=0,Y=60,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --     假人[92]={名称="虚位以待",模型="剑侠客",武器="擒龙",染色方案=2,染色组={0,0,3},称谓="天下第一帅",X=380,方向=4,Y=42,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[93]={名称="风清柒、",模型="剑侠客",武器="魏武青虹",染色方案=2,染色组={4,4,4},称谓="一代屌丝",X=348,方向=0,Y=48,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[94]={名称="阿饼",模型="剑侠客",武器="灵犀神剑",染色方案=2,染色组={0,3,3},称谓="不会横扫的大唐弟子",X=352,方向=0,Y=50,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[95]={名称="江湖小虾米",模型="剑侠客",武器="霜冷九州",染色方案=2,染色组={5,5,5},称谓="落入凡间的星灵",X=357,方向=0,Y=52,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[96]={名称="踏月夜归人",模型="龙太子",武器="刑天之逆",染色方案=10,染色组={3,3,6},称谓="南宁甘蔗王小弟",X=377,方向=4,Y=35,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	       假人[97]={名称="虚位以待",模型="神天兵",武器="天龙破城",锦衣="青花瓷",染色方案=10,染色组={4,1,6},称谓="情怀第一高手",X=381,方向=4,Y=53,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[98]={名称="书生",模型="逍遥生",武器="逍遥江湖",染色方案=1,染色组={3,3,7},称谓="笑傲情怀",X=353,方向=4,Y=35,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[99]={名称="扳手",模型="逍遥生",武器="秋水人家",染色方案=1,染色组={3,3,4},称谓="情怀元老级粉丝",X=360,方向=4,Y=33,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	       假人[100]={名称="高启强",模型="剑侠客",武器="鸣鸿",染色方案=2,染色组={4,4,4},称谓="最骚大哥",X=372,方向=4,Y=51,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	       假人[101]={名称="六一大侠",模型="逍遥生",武器="浩气长舒",染色方案=1,染色组={10,3,5},称谓="狗头军师",X=379,方向=4,Y=48,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 --    假人[102]={名称="大鱼海棠",模型="狐美人",武器="霜陨",染色方案=8,染色组={2,3,8},称谓="老表",X=408,方向=4,Y=65,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
  --       假人[103]={名称="方寸是星河",模型="剑侠客",武器="四法青云",染色方案=2,染色组={4,4,4},称谓="水封方寸",X=403,方向=0,Y=69,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
           假人[104] = {名称="神兽使者",称谓="神兜兜兑换",模型="超级神兔",X=375,Y=50,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
       -- 假人[105] = {名称="鬼谷道人",模型="男人_道士",称谓="降妖除魔",X=221,Y=132,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--书香斋
		   假人[106] = {名称="礼部侍郎官",称谓="文韵墨香",模型="考官2",X=230,Y=165,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
           假人[107] = {名称="长安西域使者",模型="男人_马副将",X=362,Y=195,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=5,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

           if 池定制 then
           	假人[66]=nil
        	假人[84]=nil
        	假人[86]=nil
        	假人[97]=nil
        	假人[100]=nil
        	假人[101]=nil
           end



	elseif 地图ID >= 6010 and 地图ID<=6019 then
		假人[1] = {名称="夺旗竞赛裁判",称谓="裁判员",模型="男人_马副将",X=137,Y=10,方向=1,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="传送侍卫",称谓="传送员",模型="男人_马副将",X=7,Y=95,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6020 then
		假人[1] = {名称="传送侍卫",称谓="传送员",模型="男人_马副将",X=29,Y=19,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="传送侍卫",称谓="传送员",模型="男人_马副将",X=133,Y=12,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1019 then
	    假人[1] = {名称="颜如玉",称谓="书呆子",模型="男人_老书生",X=27,Y=25,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1015 then
	    假人[1] = {名称="杂货店老板",模型="男人_巫医",X=21,Y=15,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1013 then--广源钱庄
	    假人[1] = {名称="钱庄老板",模型="男人_财主",X=29,Y=25,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1049 then
	    假人[1] = {名称="殷丞相",模型="考官2",X=31,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="殷夫人",模型="女人_程夫人",X=14,Y=36,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1056 then
		假人[1] = {名称="秦夫人",模型="女人_程夫人",X=24,Y=18,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1057 then
	    假人[1] = {名称="秦琼",模型="秦琼",X=31,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1081 then--长寿村钱庄
	    假人[1] = {名称="钱庄老板",模型="宝石商人",X=21,Y=14,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1099 then--傲来钱庄
	    假人[1] = {名称="钱庄老板",模型="宝石商人",X=26,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1025 then--冯记铁铺
		假人[1] = {名称="冯铁匠",称谓="铁王",模型="男人_武器店老板",X=25,Y=16,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[2] = {名称="冯冯",称谓="合成能手",模型="男人_武器店老板",X=22,Y=26,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="打铁炉",模型="物件_打铁炉",X=29,Y=19,方向=0,事件ID=nil,执行事件="物件_打铁炉",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1033 then
		假人[1] = {名称="罗百万",模型="罗百万",X=37,Y=41,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="小桃红",模型="少女",X=42,Y=39,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[3] = {名称="陈妈妈",模型="陈妈妈",X=33,Y=33,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 金銮殿
	elseif 地图ID == 1044 then
		假人[1] = {名称="魏征",模型="考官2",X=70,Y=52.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[2] = {名称="戴胄下属",模型="考官2",X=78.5,Y=57.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="房玄龄",模型="考官2",X=78,Y=57,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[4] = {名称="杜如晦",模型="考官2",X=64.5,Y=67,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="李世民",模型="皇帝",X=51,Y=46,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安酒店
	elseif 地图ID == 1028 then
		假人[1] = {名称="店小二",称谓="挖宝图任务",模型="男人_店小二",X=12,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="酒店老板",模型="男人_酒店老板",X=41,Y=34,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 大唐官府
	elseif 地图ID == 1198 then
		假人[2] = {名称="程夫人",模型="女人_程夫人",X=28,Y=26,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="丫鬟",模型="女人_丫鬟",X=24,Y=28,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="程府护卫",模型="护卫",X=89,Y=95,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="程府护卫",模型="护卫",X=121.5,Y=82.4,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="程府护卫",模型="护卫",X=128,Y=79,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="程府护卫",模型="护卫",X=155,Y=63,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[1] = {名称="传送护卫",称谓="传送长安",模型="护卫",X=72,Y=61,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1054 then
		假人[1] = {名称="程咬金",称谓="门派师傅",模型="程咬金",X=21,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安药店
	elseif 地图ID == 1016  then
		假人[1] = {名称="药店老板",模型="男人_药店老板",X=13.5,Y=18.7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安镖局
	elseif 地图ID == 1024 then
		假人[1] = {名称="郑镖头",称谓="镖王活动",模型="男人_镖头",X=31,Y=24,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安兵铁铺
	elseif 地图ID == 1020 then
		假人[1] = {名称="武器店掌柜",模型="男人_老孙头",X=16,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="武器店老板",模型="男人_武器店老板",X=28,Y=21,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[3] = {名称="打铁炉",模型="物件_打铁炉",X=30,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 国子监
	elseif 地图ID == 1026 then
		假人[1] = {名称="吴举人",模型="男人_书生",X=26,Y=26,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 云来酒店
	elseif 地图ID == 1030 then
		假人[1] = {名称="酒店老板",模型="男人_酒店老板",X=38,Y=24,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 化生寺
	elseif 地图ID == 1002 then
		假人[2] = {名称="疥癞和尚",模型="男人_胖和尚",称谓="水陆大会",X=37,Y=55,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="接引僧",称谓="传送长安",模型="男人_胖和尚",X=58,Y=66,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="慧海",模型="男人_胖和尚",X=46,Y=60,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="慧悲",模型="男人_胖和尚",X=20,Y=51,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="空慈方丈",模型="男人_方丈",称谓="旭梦篇",X=40,Y=25,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[1] = {名称="慧静",模型="男人_胖和尚",X=113,Y=47,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1004 then
		假人[1] = {名称="马超",模型="逍遥生",X=54,Y=49,方向=0,武器="擒龙",武器染色方案=20113,武器染色组={[1]=1,[2]=0},事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="妩媚狐仙",模型="狐狸精",称谓="旭梦篇",X=71,Y=7,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1005 then
		假人[1] = {名称="黄忠",模型="羽灵神",X=85,Y=23,方向=0,武器="若木",武器染色方案=20113,武器染色组={[1]=2,[2]=0},事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="赌霸城",模型="赌徒",称谓="旭梦篇",X=77,Y=71,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1006 then
		假人[1] = {名称="张飞",模型="龙太子",X=54,Y=36,方向=0,武器="飞龙在天",武器染色方案=20113,武器染色组={[1]=3,[2]=0},事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="半阁守将",模型="天将",称谓="旭梦篇",X=71,Y=10,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1007 then
		假人[1] = {名称="关羽",模型="巨魔王",X=79,Y=41,方向=0,武器="裂天",武器染色方案=20113,武器染色组={[1]=4,[2]=0},事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="流氓兔",模型="兔子怪",称谓="旭梦篇",X=103,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1008 then
		假人[1] = {名称="赵云",模型="龙太子",X=59,Y=36,方向=0,武器="弑皇",武器染色方案=20113,武器染色组={[1]=5,[2]=0},事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="流氓兔",模型="兔子怪",称谓="旭梦篇",X=103,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 1090 then
	    假人[1] = {名称="大雁塔塔主",模型="风伯",称谓="旭梦篇",X=70,Y=44,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1009 then
		假人[1] = {名称="镇塔之神",模型="男人_将军",X=29,Y=24,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="狂盗",模型="强盗",染色方案=74,染色组={1,1},X=58,Y=23,称谓="旭梦篇",方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1528 then
		假人[1] = {名称="慧明",模型="男人_胖和尚",X=14,Y=23,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="法明长老",模型="空度禅师",称谓="剧情技能",X=29,Y=21,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1043 then
		假人[1] = {名称="空度禅师",称谓="门派师傅",模型="空度禅师",X=7,Y=17,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安饰品店
	elseif 地图ID == 1017 then
		假人[1] = {名称="饰品店老板",模型="女人_赵姨娘",X=26,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长安衣服店
	elseif 地图ID == 1022 then
		假人[1] = {名称="服装店老板",模型="男人_服装店老板",X=35,Y=19,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[2] = {名称="张裁缝",模型="男人_服装店老板",X=20,Y=20,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[3] = {名称="缝纫台",模型="物件_缝纫台",X=16,Y=27,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 傲来国
	elseif 地图ID == 1092 then
		假人[1] = {名称="船夫",称谓="传送东海湾",模型="男人_驿站老板",X=188,Y=135,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="仙岛引路人",称谓="传送蓬莱仙岛",模型="男人_诗中仙",X=18,Y=51,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="驿站老板",称谓="传送长安城",模型="男人_驿站老板",X=63,Y=67,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=53,Y=119,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="蝴蝶妹妹",称谓="剧情技能",模型="蝴蝶仙子",X=67,Y=98,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="九头精怪",模型="九头精怪",X=47,Y=64,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="报名官",模型="雨师",称谓="游泳比赛",X=144,Y=59,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="偷偷怪",模型="兔子怪",X=107,Y=42,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="金毛猿",模型="马猴",称谓="幻域迷宫",X=202,Y=6,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="傲来珍品商人",模型="珍品商人",X=56,Y=38,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="傲来商人",模型="男人_特产商人",X=180,Y=46,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="傲来货商",模型="男人_老财",X=87,Y=41,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[13] = {名称="红毛猿",模型="马猴",X=57,Y=47,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
----        假人[14] = {名称="刻晴",称谓="赌一赌:单车变路虎",模型="神天兵",锦衣="黑浪淘纱",武器="弑皇",X=112,Y=41,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[15] = {名称="渔夫",称谓="钓鱼",模型="男人_钓鱼",X=150,Y=143,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
--        假人[16] = {名称="八卦炼丹炉",模型="炼丹炉",X=108,Y=46,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
         --假人[17] = {名称="云游道人",模型="男人_道士",X=112,Y=38,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
--        假人[18] = {名称="金毛猿",模型="马猴",X=112,Y=38,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[19] = {名称="蓝火兽",模型="古代瑞兽",称谓="旭梦篇",染色方案=73,染色组={1,1},X=197,Y=128,方向=0}
        假人[20] = {名称="吸血蝙蝠",模型="大蝙蝠",称谓="旭梦篇",染色方案=66,染色组={1,0},X=188,Y=90,方向=0}
        假人[21] = {名称="肾宝狼",模型="狼",称谓="旭梦篇",染色方案=68,染色组={1,0},X=115,Y=86,方向=0}

	elseif 地图ID == 1093 then
		假人[1] = {名称="王福来",称谓="旭梦篇",模型="男人_酒店老板",X=21,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="慕容先生",模型="考官1",X=44,Y=18,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1104 then
		假人[1] = {名称="沈妙衣",模型="男人_药店老板",X=28,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 1105 then
		假人[1] = {名称="杂货店老板",模型="男人_巫医",X=15,Y=24,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1101 then
		假人[1] = {名称="杜天",模型="男人_兰虎",X=23,Y=18,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1095 then
		假人[1] = {名称="牛师傅",模型="男人_服装店老板",X=27,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 女儿村
	elseif 地图ID == 1142 then
		假人[2] = {名称="翠花",模型="女人_翠花",X=73,Y=96,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="栗栗娘",模型="女人_栗栗娘",X=102,Y=56,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="柳飞絮",模型="普陀_接引仙女",X=11,Y=98,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="绿儿",模型="女人_绿儿",X=77,Y=68,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="翠儿",模型="女人_绿儿",X=34,Y=70,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[1] = {名称="接引女使",称谓="传送长安",模型="女人_丫鬟",X=24,Y=14,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1143 then
		假人[1] = {名称="孙婆婆",称谓="门派师傅",模型="孙婆婆",X=25,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 方寸
	elseif 地图ID == 1137 then
		假人[1] = {名称="菩提老祖",称谓="门派师傅",模型="菩提老祖",X=45,Y=30,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	--天宫
	elseif 地图ID == 1111 then
		假人[1] = {名称="守门天将",称谓="传送长寿郊外",模型="天兵",X=242,Y=154,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="执法天兵",模型="天兵",X=231.5,Y=149.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="守门天兵",模型="天兵",X=238.8,Y=146,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="接引仙女",称谓="传送长安",模型="芙蓉仙子",X=148.5,Y=109.8,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="守门道童",模型="男人_道童",X=25,Y=146.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="守门道童",模型="男人_道童",X=32,Y=144,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="千里眼",模型="天兵",X=175,Y=102,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="顺风耳",模型="天兵",X=117,Y=113,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="马真人",称谓="宠物修炼",模型="男人_道士",X=229,Y=95,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="天牢守卫",模型="天将",X=228,Y=25,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="水兵统领",模型="男人_将军",X=175,Y=28,方向=1,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="大力神灵",模型="风伯",X=19,Y=39,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
    elseif 地图ID == 6035 then --梦战天宫
     	假人[1] = {名称="秋风的回忆",称谓="旭梦篇",模型="龙太子",染色方案=10,染色组={3,3,4},武器="弑皇",X=89,Y=76,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
     elseif 地图ID == 6040 then --梦战天宫
     	假人[1] = {名称="秋风的回忆",称谓="旭梦篇",模型="龙太子",染色方案=10,染色组={3,3,4},武器="弑皇",X=117,Y=10,方向=4,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="太白金星",称谓="旭梦篇",模型="太白金星",X=193,Y=128,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 elseif 地图ID == 6041 then --梦战兜率宫
     	假人[1] = {名称="太上老君",称谓="旭梦篇",模型="男人_太上老君",X=20,Y=17,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	    假人[2] = {名称="三清",称谓="旭梦篇",模型="灵鹤",X=15,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	 elseif 地图ID == 6042 then --梦战凌霄殿
		假人[1] = {名称="玉皇大帝",模型="男人_玉帝",称谓="旭梦篇",X=25,Y=33,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 凌霄殿
	elseif 地图ID == 1112 then
		假人[1] = {名称="杨戬",称谓="降妖伏魔",模型="男人_杨戬",X=54.5,Y=53.4,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="李靖",称谓="门派师傅",模型="李靖",X=26,Y=43,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="玉皇大帝",模型="男人_玉帝",X=29.8,Y=34.8,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="王母娘娘",模型="女人_王母",X=35.0,Y=31.5,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="哪吒",模型="男人_哪吒",X=65.7,Y=46.8,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1113 then
		假人[1] = {名称="太上老君",模型="男人_太上老君",X=14,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="炼丹道士",模型="男人_道士",X=35,Y=23,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="金童子",模型="男人_道童",X=23,Y=23,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1114 then
		假人[1] = {名称="吴刚",模型="男人_打铁",X=12,Y=60,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="嫦娥",模型="女人_满天星",X=97,Y=29,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="康太尉",模型="天兵",X=104,Y=35,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 魔王寨
	elseif 地图ID == 1512 then
		假人[1] = {名称="守门牛妖",模型="牛妖",X=13,Y=75,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="守门牛妖",模型="牛妖",X=17,Y=78,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="传送牛妖",称谓="传送长安",模型="牛妖",X=87,Y=13,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1145 then
		假人[1] = {名称="牛魔王",称谓="门派师傅",模型="牛魔王",显示饰品=true,X=33,Y=21,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		--假人[2] = {名称="九头精怪",称谓="种族任务",模型="九头精怪",X=17,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 五庄
	elseif 地图ID == 1146 then
		假人[1] = {名称="接引道童",称谓="传送长安",模型="男人_道童",X=46.5,Y=37,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="清风",模型="男人_道童",X=60,Y=43,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 乾坤殿
	elseif 地图ID == 1147 then
		假人[1] = {名称="镇元子",称谓="门派师傅",模型="镇元子",X=25.5,Y=20.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 狮驼岭
	elseif 地图ID == 1131 then
		假人[1] = {名称="守山小妖",模型="雷鸟人",X=114,Y=8,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="守山小妖",模型="雷鸟人",X=119.2,Y=12.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="传送小妖",称谓="传送长安",模型="雷鸟人",X=111,Y=71,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 狮王洞
	elseif 地图ID == 1132 then
		假人[1] = {名称="二大王",模型="二大王",X=29,Y=19,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1133 then
		假人[1] = {名称="三大王",模型="三大王",X=25,Y=21,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1134 then
		假人[1] = {名称="大大王",称谓="门派师傅",模型="大大王",X=29.2,Y=19.2,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 盘丝岭
	elseif 地图ID == 1513 then
		假人[1] = {名称="女妖",模型="芙蓉仙子",X=110,Y=104,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="金琉璃",模型="如意仙子",X=64.5,Y=81,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="栗栗儿",模型="女人_丫鬟",X=73,Y=85,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="看门小妖",模型="树怪",X=171.8,Y=27.5,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="看门小妖",模型="树怪",X=180,Y=33,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="引路小妖",称谓="传送长安",模型="蝴蝶仙子",X=180,Y=22,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1144 then
		假人[1] = {名称="春十三娘",模型="春十三娘",X=30,Y=42,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="白晶晶",称谓="门派师傅",模型="白晶晶",X=38,Y=13,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 神木林
	elseif 地图ID == 1138 then
		假人[1] = {名称="引路族民",称谓="传送长安",模型="巫师",X=54,Y=92,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="云中月",模型="巫师",X=22,Y=68,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="云小奴",模型="女人_云小奴",X=17,Y=48,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="满天星",模型="女人_满天星",X=25,Y=37,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1154 then
		假人[1] = {名称="巫奎虎",称谓="门派师傅",模型="巫奎虎",X=33.5,Y=32,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 碗子山
	elseif 地图ID == 1228 then
		假人[1] = {名称="碗子山土地",模型="男人_土地",称谓="传送无底洞",X=25,Y=173,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 无底洞
	elseif 地图ID == 1139 then
		假人[1] = {名称="璎珞",模型="幽萤娃娃",X=85,Y=49,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="墨衣",模型="修罗傀儡妖",X=4,Y=54,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="红莲",模型="修罗傀儡妖",X=29,Y=15,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="接引小妖",称谓="传送长安",模型="幽萤娃娃",X=47,Y=120,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1156 then
		假人[1] = {名称="地涌夫人",称谓="门派师傅",模型="地涌夫人",X=49.6,Y=27.6,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="灵鼠娃娃",模型="女人_灵鼠娃娃",X=55,Y=33,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
   -- 丝绸之路
	elseif 地图ID == 1235 then
		假人[1] = {名称="驿站老板",称谓="传送西梁女国",模型="男人_驿站老板",X=464,Y=92,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 麒麟山
	elseif 地图ID == 1210 then
		假人[1] = {名称="驿站老板",称谓="传送宝象国",模型="男人_驿站老板",X=70,Y=140,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 蓬莱仙岛
	elseif 地图ID == 1207 then
		假人[1] = {名称="驿站老板",称谓="传送傲来国",模型="男人_驿站老板",X=9.2,Y=101.8,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 长寿村
	elseif 地图ID == 1070 then
		假人[1] = {名称="慧觉和尚",模型="男人_胖和尚",称谓="车迟斗法副本",X=120,Y=141,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="陆萧然",称谓="任务链",模型="男人_老书生",X=20,Y=185,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="蝴蝶女",模型="蝴蝶仙子",称谓="通天河副本",X=47,Y=71,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="太白金星",模型="太白金星",称谓="仙族任务",X=53,Y=194,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="海老先生",模型="男人_村长",X=107,Y=175,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="钟书生",模型="男人_书生",X=43,Y=51,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="许姑娘",模型="少女",X=76,Y=35,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[8] = {名称="仓库管理员",模型="仓库保管员",X=100,Y=149,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[9] = {名称="南极仙翁",模型="南极仙翁",称谓="剧情技能",X=107,Y=22,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[10] = {名称="长寿珍品商人",模型="珍品商人",X=109,Y=158,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="长寿商人",模型="男人_特产商人",X=141,Y=41,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="长寿货商",模型="男人_老财",X=54,Y=168,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="许大娘",模型="女人_王大嫂",X=80,Y=144,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[14] = {名称="超级巫医",称谓="召唤兽治疗师",模型="男人_巫医",X=126,Y=101,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[15] = {名称="毛驴张",模型="男人_老伯",X=76,Y=82,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[16] = {名称="凤凰姑娘",模型="普陀_接引仙女",X=25,Y=103,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[17] = {名称="马婆婆",模型="女人_孟婆",X=43,Y=140,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=2,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[18] = {名称="长寿村村长",模型="男人_村长",X=16,Y=169,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[19] = {名称="PK申请人",模型="男人_兰虎",称谓="不服就干",X=50,Y=113,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[20] = {名称="药店老板",模型="男人_药店老板",X=89,Y=192,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1083 then
		假人[1] = {名称="裁缝张",模型="男人_服装店老板",X=23.2,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1213 then
		假人[1] = {名称="子鼠",称谓="十二生肖",模型="鼠先锋",X=114,Y=47,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="丑牛",称谓="十二生肖",模型="超级神牛",X=113,Y=38,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="寅虎",称谓="十二生肖",模型="超级神虎",X=115,Y=28,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="卯兔",称谓="十二生肖",模型="超级神兔",X=117,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1085 then
		假人[1] = {名称="武器店老板",模型="男人_武器店老板",X=19,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 月宫
	elseif 地图ID == 1114 then
		假人[1] = {名称="吴刚",模型="吴刚",X=12,Y=63,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	-- 小雷音寺
	elseif 地图ID == 1204 then
		假人[1] = {名称="丹青生",模型="男人_书生",X=22,Y=48,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1875 then -- 聚义堂
		假人[1] = {名称="帮派总管",模型="男人_兰虎",X=23,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="黑色机关人",模型="帮派机关人",X=47,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1865 then -- 青龙堂
		假人[1] = {名称="青龙总管",模型="男人_兰虎",X=18,Y=19,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="橙色机关人",模型="帮派机关人",X=30,Y=19,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1855 then -- 药房
		假人[1] = {名称="药房总管",模型="男人_药店老板",X=20,方向=1,Y=16,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="红色机关人",模型="帮派机关人",X=15,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1845 then -- 厢房
		假人[1] = {名称="厢房总管",模型="男人_兰虎",X=18,Y=18,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="绿色机关人",模型="帮派机关人",X=16,Y=23,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1835 then -- 兽室
		假人[1] = {名称="帮派守护兽",模型="帮派妖兽",X=20,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="青色机关人",模型="帮派机关人",X=35,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1825 then -- 书院
		假人[1] = {名称="帮派师爷",模型="男人_师爷",X=15,Y=17,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="蓝色机关人",模型="帮派机关人",X=33,Y=21,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1815 then -- 金库
		假人[1] = {名称="金库总管",模型="男人_兰虎",X=22,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="紫色机关人",模型="帮派机关人",X=27,Y=20,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6021 then --车迟副本
		假人[1] = {名称="道观",模型="道观",X=88,Y=28,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6024 then
		假人[1] = {名称="道场督僧",模型="男人_方丈",X=38,Y=61,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="道场童子",模型="男人_胖和尚",X=4,Y=86,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6025 then
		假人[1] = {名称="传送侍卫",模型="男人_马副将",X=501,Y=6,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="代笔师爷",模型="男人_师爷",X=483,Y=125,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[3] = {名称="瓜农",模型="男人_老伯",X=478,Y=119,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[4] = {名称="绣娘",模型="女人_染色师",X=459,Y=162,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[5] = {名称="喜轿轿夫",模型="男人_兰虎",X=483,Y=147,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[6] = {名称="卖艺者",模型="男人_苦力",X=430,Y=182,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[7] = {名称="乞丐乙",模型="男人_村长",X=455,Y=184,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[8] = {名称="阿咪",模型="女人_丫鬟",X=470,Y=192,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[9] = {名称="马商",模型="珍品商人",X=407,Y=211,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[10] = {名称="小顽童",模型="女人_绿儿",X=401,Y=203,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[11] = {名称="卖花童",模型="女人_绿儿",X=420,Y=219,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[12] = {名称="丫鬟",模型="女人_丫鬟",X=424,Y=222,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[13] = {名称="富家小姐",模型="普陀_接引仙女",X=431,Y=225,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[14] = {名称="卖鱼人",模型="男人_苦力",X=442,Y=229,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[15] = {名称="面点师傅",模型="男人_苦力",X=443,Y=223,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[16] = {名称="针线娘子",模型="女人_王大嫂",X=464,Y=240,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[17] = {名称="樵夫",模型="樵夫",X=462,Y=262,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[18] = {名称="大财主",模型="男人_老财",X=427,Y=228,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[19] = {名称="曾衙役",模型="男人_衙役",X=421,Y=225,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[20] = {名称="布陈太医",模型="男人_村长",X=370,Y=243,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[21] = {名称="游方郎中",模型="男人_书生",X=389,Y=234,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1249 then
		假人[1] = {名称="传送侍卫",称谓="传送至长安",模型="女人_云小奴",X=86,Y=29,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1250 then
		假人[1] = {名称="传送侍卫",称谓="传送至长安",模型="女人_云小奴",X=137,Y=46,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1251 then
		假人[1] = {名称="齐天大圣",模型="孙悟空",X=91,Y=16,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="传送侍卫",称谓="传送至长安",模型="女人_云小奴",X=90,Y=24,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1252 then
		假人[1] = {名称="天女魃",模型="金圣宫",X=41,Y=16,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1253 then
		假人[1] = {名称="小夫子",模型="鲁班",X=58,Y=127,方向=1,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1332 then
		假人[1] = {名称="女佣",模型="女人_丫鬟",X=31,Y=44,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="管家",模型="男人_师爷",X=46,Y=49,方向=2,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 1340 then
		假人[1] = {名称="看门爬虫",模型="进阶超级神龙",X=16,Y=26,方向=1,事件ID=nil,执行事件="不执行"}
		假人[2] = {名称="看门爬虫",模型="进阶超级神龙",X=24,Y=32,方向=1,事件ID=nil,执行事件="不执行"}
	elseif 地图ID == 6037 then
		假人[1] = {名称="判官",模型="男人_判官",X=47,Y=65,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="阎王",模型="阎罗王",X=31,Y=53,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6038 then
		假人[1] = {名称="玉皇大帝",模型="男人_玉帝",X=152,Y=108,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
		假人[2] = {名称="天蓬元帅",模型="猪八戒",X=247,Y=104,方向=3,事件ID=nil,执行事件="不执行",小地图名称颜色=0,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
	elseif 地图ID == 6039 then
		假人[1] = {名称="镇塔之神",模型="男人_将军",X=25,Y=24,方向=0,显示饰品=true,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}

--嘎嘎
    elseif 地图ID == 5140 then
		假人[1] = {名称="嘎嘎人物",模型="男人_胖和尚",称谓="潜能突破",X=14,Y=36,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[2] = {名称="嘎嘎宠物",模型="猪八戒",称谓="召唤兽提升",X=58,Y=14,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}
        假人[3] = {名称="二代监正",模型="男人_太上老君",称谓="征战神州",X=27,Y=22,方向=0,事件ID=nil,执行事件="不执行",小地图名称颜色=3,商业分类1=0,商业分类2=0,商业分类3=0,商业分类4=0}




	end
	if 假人ID==nil then
		return 假人
    else
		return 假人[假人ID]
	end
end